notebook/xe2-reference.org
* Introducing CLON 
CLON stands for Common Lisp Object Network. CLON is a prototype-based
object system for Common Lisp. It is different from CLOS in several
important ways:
 - CLON is prototype-based, not class-based. A prototype is a template
   object from which other objects are "cloned".
 - Method invocation happens via message-passing, not generic
   functions; messages are conceptually different from synchronous
   function calls and may be freely queued, forwarded, and filtered.
 - Built-in support for serialization.
 - Simple and small: as of December 2008, clon.lisp contains about 750 lines
   of code and commentary.
 - Special syntax support for message sending:
 
:   [method-name object arg1 arg2 ...]
   and for accessing fields (i.e. "slots" in CLOS terminology):
:   (setf <slot-name> value)
    - [[http://en.wikipedia.org/wiki/Prototype-based_programming][Wikipedia page on Prototype-based programming]]
    - [[http://en.wikipedia.org/wiki/Message_passing][Wikipedia page on Message passing]]
    - http://www.cliki.net/Garnet
    - http://iolanguage.com/about/
** clon.el: Emacs editing support for CLON
CLON includes a small Emacs Lisp program that adds optional support
for CLON syntax, complete with fontification. 
To set up clon.el, add the following to your Emacs initialization file:
: (add-to-list 'load-path "~/clon") ;; Change this to where you installed CLON
: (require 'clon)
: (add-hook 'lisp-mode-hook #'clon-do-font-lock)
** Code examples
*** What is an object in CLON?
An object in CLON consists of a set of fields (keyword/value pairs),
and optionally: 
      - a name (a symbol)
      - a link to a parent object from which this object delegates slot lookups
[[file:../clon/clon.html#Object_data_structure][See also clon.lisp, "Object data structure"]]
*** Defclass-like prototype definitions
First we must define a prototype and name its fields:
: (define-prototype rectangle ()
:   x y width height)
[[file:../clon/clon.html#Defining_prototypes][See also clon.lisp, "Defining prototypes"]]
We could also have provided initialization forms for the slots, and
documentation strings:
: (define-prototype rectangle ()
:   (x :initform 0 
:      :documentation "The x-coordinate of the rectangle's top-left corner.")
:   (y :initform 0 
:      :documentation "The y-coordinate of the rectangle's top-left corner.")
:   (width :documentation "The width of the rectangle.")
:   (height :documentation "The height of the rectangle."))
*** Single inheritance
And if there was a "shape" prototype, from which we would like
"rectangle" to inherit data and methods, we might have written:
: (define-prototype rectangle (:parent =shape=)
:   (x :initform 0 
:      :documentation "The x-coordinate of the rectangle's top-left corner.")
:   (y :initform 0 
:      :documentation "The y-coordinate of the rectangle's top-left corner.")
:   (width :documentation "The width of the rectangle.")
:   (height :documentation "The height of the rectangle."))
Notice the equals signs surrounding the parent object's name; all
objects made with define-prototype are accessible via special
variables with such names. 
The reason for this is that usually you want to call a widget a
widget, but if that name is taken for a special variable "widget"
whose value was the prototype for all widgets, then you will have to
use some other probably less effective name for the binding, like "w"
or "wt" or "wydget", everywhere you want to just talk about a "widget"
in your code. So instead we only reserve the equals-sign-delimited
name:
:  =WIDGET=
*** Cloning objects
The function CLON:CLONE is used to create new objects from these
prototypes. Now we write an initializer, which is passed any creation
arguments at the time of cloning.
: (define-method initialize rectangle (&key width height)
:   (setf <width> width)
:   (setf <height> height))
[[file:../clon/clon.html#Cloning_objects][See also clon.lisp, "Cloning objects".]]
Notice how field accesses can be written with the angle brackets; this
works both for reading and for writing, so long as you use "setf" for
the latter. 
[[file:../clon/clon.html#Field_reference_syntax][See also "Field reference syntax".]]
Now when you say:
: (setf rectangle (clone =rectangle= :width 5 :height 12))
The rectangle's initializer method is invoked with those arguments,
and a rectangle of the correct height and width is created.
*** Basic field access
: (field-value :width rectangle)
: (setf (field-value :height rectangle) 7)
[[file:../clon/clon.html#Fields][See also clon.lisp, "Fields"]]
*** Methods
Now we define a few methods:
: (define-method area rectangle ()
:   (* <width> <height>))
: 
: (define-method print rectangle (&optional (stream t))
:   (format stream "height: ~A width: ~A area: ~A"
: 	  <height> <width> 
: 	  [area self]))
[[file:../clon/clon.html#Methods_and_messages][See also clon.lisp, "Methods and messages"]]
And invoke them with the aforementioned square bracket notation.
: (defvar rect (clone =rectangle= :width 10 :height 8))
:
: [print rect]
The result: 
: "height: 8 width: 10 area: 80"
*** Message queueing
CLON also supports a concept called message queueing. When there is an
active message queue, messages may be entered into the queue instead
of directly invoking a method:
: [queue>>render widget]
: [queue>>attack self :north]
The sender, receiver, method name, and arguments are all recorded in
the queue. The developer can then filter or process them before
sending.
[[file:../clon/clon.html#Message_queueing][See also clon.lisp, "Message queueing"]]
*** Message forwarding
And finally, I will mention message forwarding, which handles the case
that an object has no handler for a particular method. This is akin to
[[http://en.wikipedia.org/wiki/Smalltalk][Smalltalk's]] "doesNotUnderstand" concept.
[[file:../clon/clon.html#Message_forwarding][See also clon.lisp, "Message forwarding"]]
* A simple example
Before we move on to the reference dictionary of the objects,
functions, and variables of XE2, here's an example game to
peek at: [[http://github.com/dto/xe2/blob/master/example/example.lisp][example.lisp]]
You can try it by running (xe2:play "example") at the SLIME REPL.
There's more to making an XE2 module than just a Lisp file; you must
have resource files (.png, .ogg) and a resource index (.pak file).
See http://github.com/dto/xe2/tree/master/example/ for the full list
of files in the example game.
