notebook/xe2-reference.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Introducing CLON </h2>
<div class="outline-text-2" id="text-2">

<p>CLON stands for Common Lisp Object Network. CLON is a prototype-based
object system for Common Lisp. It is different from CLOS in several
important ways:
</p><ul>
<li>CLON is prototype-based, not class-based. A prototype is a template
   object from which other objects are "cloned".
</li>
<li>Method invocation happens via message-passing, not generic
   functions; messages are conceptually different from synchronous
   function calls and may be freely queued, forwarded, and filtered.
</li>
<li>Built-in support for serialization.
</li>
<li>Simple and small: as of December 2008, clon.lisp contains about 750 lines
   of code and commentary.
</li>
<li>Special syntax support for message sending:
</li>
</ul>


<pre class="example">
  [method-name object arg1 arg2 ...]
</pre>

<p>   and for accessing fields (i.e. "slots" in CLOS terminology):
</p><pre class="example">
  (setf &lt;slot-name&gt; value)
</pre>

<ul>
<li><a href="http://en.wikipedia.org/wiki/Prototype-based_programming">Wikipedia page on Prototype-based programming</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Message_passing">Wikipedia page on Message passing</a>
</li>
<li><a href="http://www.cliki.net/Garnet">http://www.cliki.net/Garnet</a>
</li>
<li><a href="http://iolanguage.com/about/">http://iolanguage.com/about/</a>
</li>
</ul>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">clon.el: Emacs editing support for CLON </h3>
<div class="outline-text-3" id="text-2-1">

<p>CLON includes a small Emacs Lisp program that adds optional support
for CLON syntax, complete with fontification. 
To set up clon.el, add the following to your Emacs initialization file:
</p><pre class="example">
(add-to-list 'load-path "~/clon") ;; Change this to where you installed CLON
(require 'clon)
(add-hook 'lisp-mode-hook #'clon-do-font-lock)
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Code examples </h3>
<div class="outline-text-3" id="text-2-2">


</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1">What is an object in CLON? </h4>
<div class="outline-text-4" id="text-2-2-1">

<p>An object in CLON consists of a set of fields (keyword/value pairs),
and optionally: 
</p><ul>
<li>a name (a symbol)
</li>
<li>a link to a parent object from which this object delegates slot lookups
</li>
</ul>

<p><a href="../clon/clon.html#Object_data_structure">See also clon.lisp, "Object data structure"</a>
</p></div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2">Defclass-like prototype definitions </h4>
<div class="outline-text-4" id="text-2-2-2">

<p>First we must define a prototype and name its fields:
</p><pre class="example">
(define-prototype rectangle ()
  x y width height)
</pre>

<p><a href="../clon/clon.html#Defining_prototypes">See also clon.lisp, "Defining prototypes"</a>
We could also have provided initialization forms for the slots, and
documentation strings:
</p><pre class="example">
(define-prototype rectangle ()
  (x :initform 0 
     :documentation "The x-coordinate of the rectangle's top-left corner.")
  (y :initform 0 
     :documentation "The y-coordinate of the rectangle's top-left corner.")
  (width :documentation "The width of the rectangle.")
  (height :documentation "The height of the rectangle."))
</pre>

</div>

</div>

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3">Single inheritance </h4>
<div class="outline-text-4" id="text-2-2-3">

<p>And if there was a "shape" prototype, from which we would like
"rectangle" to inherit data and methods, we might have written:
</p><pre class="example">
(define-prototype rectangle (:parent =shape=)
  (x :initform 0 
     :documentation "The x-coordinate of the rectangle's top-left corner.")
  (y :initform 0 
     :documentation "The y-coordinate of the rectangle's top-left corner.")
  (width :documentation "The width of the rectangle.")
  (height :documentation "The height of the rectangle."))
</pre>

<p>Notice the equals signs surrounding the parent object's name; all
objects made with define-prototype are accessible via special
variables with such names. 
The reason for this is that usually you want to call a widget a
widget, but if that name is taken for a special variable "widget"
whose value was the prototype for all widgets, then you will have to
use some other probably less effective name for the binding, like "w"
or "wt" or "wydget", everywhere you want to just talk about a "widget"
in your code. So instead we only reserve the equals-sign-delimited
name:
</p><pre class="example">
 =WIDGET=
</pre>

</div>

</div>

<div id="outline-container-2-2-4" class="outline-4">
<h4 id="sec-2-2-4">Cloning objects </h4>
<div class="outline-text-4" id="text-2-2-4">

<p>The function CLON:CLONE is used to create new objects from these
prototypes. Now we write an initializer, which is passed any creation
arguments at the time of cloning.
</p><pre class="example">
(define-method initialize rectangle (&amp;key width height)
  (setf &lt;width&gt; width)
  (setf &lt;height&gt; height))
</pre>

<p><a href="../clon/clon.html#Cloning_objects">See also clon.lisp, "Cloning objects".</a>
Notice how field accesses can be written with the angle brackets; this
works both for reading and for writing, so long as you use "setf" for
the latter. 
<a href="../clon/clon.html#Field_reference_syntax">See also "Field reference syntax".</a>
Now when you say:
</p><pre class="example">
(setf rectangle (clone =rectangle= :width 5 :height 12))
</pre>

<p>The rectangle's initializer method is invoked with those arguments,
and a rectangle of the correct height and width is created.
</p></div>

</div>

<div id="outline-container-2-2-5" class="outline-4">
<h4 id="sec-2-2-5">Basic field access </h4>
<div class="outline-text-4" id="text-2-2-5">

<pre class="example">
(field-value :width rectangle)
(setf (field-value :height rectangle) 7)
</pre>

<p><a href="../clon/clon.html#Fields">See also clon.lisp, "Fields"</a>
</p></div>

</div>

<div id="outline-container-2-2-6" class="outline-4">
<h4 id="sec-2-2-6">Methods </h4>
<div class="outline-text-4" id="text-2-2-6">

<p>Now we define a few methods:
</p><pre class="example">
(define-method area rectangle ()
  (* &lt;width&gt; &lt;height&gt;))

(define-method print rectangle (&amp;optional (stream t))
  (format stream "height: ~A width: ~A area: ~A"
        &lt;height&gt; &lt;width&gt; 
        [area self]))
</pre>

<p><a href="../clon/clon.html#Methods_and_messages">See also clon.lisp, "Methods and messages"</a>
And invoke them with the aforementioned square bracket notation.
</p><pre class="example">
(defvar rect (clone =rectangle= :width 10 :height 8))

[print rect]
</pre>

<p>The result: 
</p><pre class="example">
"height: 8 width: 10 area: 80"
</pre>

</div>

</div>

<div id="outline-container-2-2-7" class="outline-4">
<h4 id="sec-2-2-7">Message queueing </h4>
<div class="outline-text-4" id="text-2-2-7">

<p>CLON also supports a concept called message queueing. When there is an
active message queue, messages may be entered into the queue instead
of directly invoking a method:
</p><pre class="example">
[queue&gt;&gt;render widget]
[queue&gt;&gt;attack self :north]
</pre>

<p>The sender, receiver, method name, and arguments are all recorded in
the queue. The developer can then filter or process them before
sending.
<a href="../clon/clon.html#Message_queueing">See also clon.lisp, "Message queueing"</a>
</p></div>

</div>

<div id="outline-container-2-2-8" class="outline-4">
<h4 id="sec-2-2-8">Message forwarding </h4>
<div class="outline-text-4" id="text-2-2-8">

<p>And finally, I will mention message forwarding, which handles the case
that an object has no handler for a particular method. This is akin to
<a href="http://en.wikipedia.org/wiki/Smalltalk">Smalltalk's</a> "doesNotUnderstand" concept.
<a href="../clon/clon.html#Message_forwarding">See also clon.lisp, "Message forwarding"</a>
</p></div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">A simple example </h2>
<div class="outline-text-2" id="text-3">

<p>Before we move on to the reference dictionary of the objects,
functions, and variables of XE2, here's an example game to
peek at: <a href="http://github.com/dto/xe2/blob/master/example/example.lisp">example.lisp</a>
You can try it by running (xe2:play "example") at the SLIME REPL.
There's more to making an XE2 module than just a Lisp file; you must
have resource files (.png, .ogg) and a resource index (.pak file).
See <a href="http://github.com/dto/xe2/tree/master/example/">http://github.com/dto/xe2/tree/master/example/</a> for the full list
of files in the example game.
</p></div>

</div>
