notebook/xe2-reference.html

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Support links </h2>
<div class="outline-text-2" id="text-4">

<p>If you have questions about XE2 or have problems, feel free to use the
following lines of support:
</p><ul>
<li>IRC channel #lispgames on irc.freenode.net
</li>
<li><a href="mailto:dto@gnu.org">email me</a>.
</li>
<li>Join our <a href="http://common-lisp.net/mailman/listinfo/lisp-game-dev">mailing list</a>.
</li>
</ul>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Symbol dictionary </h2>
<div class="outline-text-2" id="text-5">

<p>The remainder of this reference lists documentation for all the
exported symbols, in the following order:
</p><ul>
<li>Prototypes 
<ul>
<li>Fields
</li>
<li>Methods, in alphabetical order
</li>
</ul>

</li>
<li>Special variables, in alphabetical order
</li>
<li>Macros, functions, and variables, in alphabetical order
</li>
</ul>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">=BROWSER= (prototype) </h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">Parent prototype </h3>
<div class="outline-text-3" id="text-6-1">

<pre class="example">
=FORMATTER=
</pre>


</div>

<div id="outline-container-6-1-1" class="outline-4">
<h4 id="sec-6-1-1">Fields </h4>
<div class="outline-text-4" id="text-6-1-1">

<ul>
<li id="sec-6-1-1-1">COLLECTION (field) <br/>
<ul>
<li id="sec-6-1-1-1-1">Documentation <br/>
The vector of browsable CLON objects being browsed.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-2">CURSOR (field) <br/>
<ul>
<li id="sec-6-1-1-2-1">Documentation <br/>
The array index of the currently selected object.
</li>
</ul>
<ul>
<li id="sec-6-1-1-2-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-3">VISIBLE (field) <br/>
</li>
</ul>
<ul>
<li id="sec-6-1-1-4">HISTORY (field) <br/>
<ul>
<li id="sec-6-1-1-4-1">Documentation <br/>
Recently browsed collections.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-5">PROMPT (field) <br/>
<ul>
<li id="sec-6-1-1-5-1">Documentation <br/>
Prompt to receive command messages.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-6">LINES (field) <br/>
<ul>
<li id="sec-6-1-1-6-1">Documentation <br/>
Vector of lines.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-7">CURRENT-LINE (field) <br/>
<ul>
<li id="sec-6-1-1-7-1">Documentation <br/>
Formatted line currently being composed.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-8">KEYMAP (field) <br/>
<ul>
<li id="sec-6-1-1-8-1">Documentation <br/>
A hash table mapping keylists to lambdas.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-9">IMAGE (field) <br/>
<ul>
<li id="sec-6-1-1-9-1">Documentation <br/>
The offscreen image buffer containing the widget's rendered output.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-10">WIDTH (field) <br/>
<ul>
<li id="sec-6-1-1-10-1">Documentation <br/>
The current allocated image width of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-11">HEIGHT (field) <br/>
<ul>
<li id="sec-6-1-1-11-1">Documentation <br/>
The current allocated image height of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-12">VISIBLE (field) <br/>
<ul>
<li id="sec-6-1-1-12-1">Documentation <br/>
The boolean visibility of the widget.
</li>
</ul>
<ul>
<li id="sec-6-1-1-12-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-13">X (field) <br/>
<ul>
<li id="sec-6-1-1-13-1">Documentation <br/>
The screen x-coordinate of the left side of the widget's display area.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-6-1-1-14">Y (field) <br/>
<ul>
<li id="sec-6-1-1-14-1">Documentation <br/>
The screen y-coordinate of the top of the widget's display area.
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">BACK [BROWSER] (method) </h3>
<div class="outline-text-3" id="text-6-2">


</div>

<div id="outline-container-6-2-1" class="outline-4">
<h4 id="sec-6-2-1">Arguments </h4>
<div class="outline-text-4" id="text-6-2-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3">CURSOR-ITEM [BROWSER] (method) </h3>
<div class="outline-text-3" id="text-6-3">


</div>

<div id="outline-container-6-3-1" class="outline-4">
<h4 id="sec-6-3-1">Arguments </h4>
<div class="outline-text-4" id="text-6-3-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4">CURSOR-NEXT [BROWSER] (method) </h3>
<div class="outline-text-3" id="text-6-4">


</div>

<div id="outline-container-6-4-1" class="outline-4">
<h4 id="sec-6-4-1">Arguments </h4>
<div class="outline-text-4" id="text-6-4-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5">CURSOR-PREVIOUS [BROWSER] (method) </h3>
<div class="outline-text-3" id="text-6-5">


</div>

<div id="outline-container-6-5-1" class="outline-4">
<h4 id="sec-6-5-1">Arguments </h4>
<div class="outline-text-4" id="text-6-5-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6">FOLLOW [BROWSER] (method) </h3>
<div class="outline-text-3" id="text-6-6">


</div>

<div id="outline-container-6-6-1" class="outline-4">
<h4 id="sec-6-6-1">Arguments </h4>
<div class="outline-text-4" id="text-6-6-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7">INITIALIZE [BROWSER] (method) </h3>
<div class="outline-text-3" id="text-6-7">


</div>

<div id="outline-container-6-7-1" class="outline-4">
<h4 id="sec-6-7-1">Arguments </h4>
<div class="outline-text-4" id="text-6-7-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-6-8" class="outline-3">
<h3 id="sec-6-8">PRINT-OBJECT [BROWSER] (method) </h3>
<div class="outline-text-3" id="text-6-8">


</div>

<div id="outline-container-6-8-1" class="outline-4">
<h4 id="sec-6-8-1">Arguments </h4>
<div class="outline-text-4" id="text-6-8-1">

<p>(OBJECT &amp;OPTIONAL SELECTED-P)
</p></div>

</div>

<div id="outline-container-6-8-2" class="outline-4">
<h4 id="sec-6-8-2">Documentation </h4>
<div class="outline-text-4" id="text-6-8-2">

<p>Print the OBJECT in the browser as a new formatted line.
When SELECTED-P is non-nil, draw the highlighted (or otherwise
visually distinguished) version of the line.
</p></div>
</div>

</div>

<div id="outline-container-6-9" class="outline-3">
<h3 id="sec-6-9">SET-COLLECTION [BROWSER] (method) </h3>
<div class="outline-text-3" id="text-6-9">


</div>

<div id="outline-container-6-9-1" class="outline-4">
<h4 id="sec-6-9-1">Arguments </h4>
<div class="outline-text-4" id="text-6-9-1">

<p>(COLLECTION)
</p></div>
</div>

</div>

<div id="outline-container-6-10" class="outline-3">
<h3 id="sec-6-10">SET-COLLECTION-FROM-MENU-SPEC [BROWSER] (method) </h3>
<div class="outline-text-3" id="text-6-10">


</div>

<div id="outline-container-6-10-1" class="outline-4">
<h4 id="sec-6-10-1">Arguments </h4>
<div class="outline-text-4" id="text-6-10-1">

<p>(MENU-SPEC)
</p></div>
</div>

</div>

<div id="outline-container-6-11" class="outline-3">
<h3 id="sec-6-11">SET-PROMPT [BROWSER] (method) </h3>
<div class="outline-text-3" id="text-6-11">


</div>

<div id="outline-container-6-11-1" class="outline-4">
<h4 id="sec-6-11-1">Arguments </h4>
<div class="outline-text-4" id="text-6-11-1">

<p>(PROMPT)
</p></div>
</div>

</div>

<div id="outline-container-6-12" class="outline-3">
<h3 id="sec-6-12">UPDATE [BROWSER] (method) </h3>
<div class="outline-text-3" id="text-6-12">


</div>

<div id="outline-container-6-12-1" class="outline-4">
<h4 id="sec-6-12-1">Arguments </h4>
<div class="outline-text-4" id="text-6-12-1">

<p>NIL
</p></div>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">=BUTTON-CELL= (prototype) </h2>
<div class="outline-text-2" id="text-7">


</div>
