notebook/xe2-reference.org
*** Documentation
Determine whether the cell has enough action points to take some
action during PHASE.

The Action Points system is XE2's model of roguelike time; Time is
divided into discrete episodes called phases.  Each phase consists
of one or more actions, each of which lasts a certain number of
action points' worth of time. During an action, the cell may modify
its own fields, invoke methods on itself, or send queued messages
to other cells in the environment. When a cell runs out of action
points, its phase ends and another cell's phase begins.

`Action points' (or `AP') control an actor cell's ability to take
actions during a phase. The AP score for a cell's phase starts at
 [stat-value cell :speed]. The AP cost of an action is determined by
the corresponding method's use of `expend-action-points'; see below. 

First your turn comes up, and XE2 waits for your input.  Once you
issue a command, some AP may be used up. When your AP is gone, the
computer's phase begins. The results are displayed, and if you're
still alive, the player phase begins again.

 (In realtime mode, XE2 does not wait for input.)

The queued messages' targets can be keywords like :world, :browser,
or :narrator instead of direct references to objects; the world
processes the messages before delivery and sends them to the right
place. (See also worlds.lisp)
** CANCEL [CELL] (method)
*** Arguments
NIL
*** Documentation
This cell was scheduled for drop and possible loadout in a world,
but this was canceled. A canceled cell should update any global state
to reflect its disappearance; this is different from a dying cell.
** CLEAR-LOCATION [CELL] (method)
*** Arguments
NIL
** COMPUTE [CELL] (method)
*** Arguments
NIL
** DAMAGE [CELL] (method)
*** Arguments
(DAMAGE-POINTS)
** DELETE-CATEGORY [CELL] (method)
*** Arguments
(CATEGORY)
*** Documentation
Remove this cell from the specified CATEGORY.
** DELETE-EQUIPMENT [CELL] (method)
*** Arguments
(SLOT)
** DELETE-FROM-WORLD [CELL] (method)
*** Arguments
NIL
** DEQUIP [CELL] (method)
*** Arguments
(SLOT)
** DESCRIBE [CELL] (method)
*** Arguments
(&OPTIONAL DESCRIPTION)
*** Documentation
Narrate a description of the object. By default, uses
the :description field of the cell.
** DIE [CELL] (method)
*** Arguments
NIL
*** Documentation
Abandon this cell to the garbage collector.
** DIRECTION-TO-PLAYER [CELL] (method)
*** Arguments
NIL
*** Documentation
Calculate the general compass direction of the player.
** DISEMBARK [CELL] (method)
*** Arguments
NIL
*** Documentation
Eject the occupant.
** DISLOCATE [CELL] (method)
*** Arguments
NIL
*** Documentation
Remove any location data from the cell.
** DISTANCE-TO-PLAYER [CELL] (method)
*** Arguments
NIL
*** Documentation
Calculate the distance from the current location to the player.
** DO-COLLISION [CELL] (method)
*** Arguments
(OBJECT)
*** Documentation
Respond to a collision detected with OBJECT.
** DO-POST-UNPROXIED [CELL] (method)
*** Arguments
NIL
*** Documentation
This method is invoked on the unproxied former occupant cell after
unproxying. By default, it does nothing.
** DRAW [CELL] (method)
*** Arguments
(X Y IMAGE)
*** Documentation
Use XE2 drawing commands to render a presentation of this cell at
X, Y to the offscreen image IMAGE.  This method is invoked to draw a
cell when its TILE field is nil, or when it is in the
category :drawn. See also viewport.lisp.
** DROP [CELL] (method)
*** Arguments
(CELL &KEY LOADOUT (EXCLUSIVE NIL))
*** Documentation
Add CELL to the world at the current location. By default,
EXCLUSIVE is nil; this allows one to drop objects on top of oneself.
When LOADOUT is non-nil, call the :loadout method.
** DROP-ITEM [CELL] (method)
*** Arguments
(POS)
*** Documentation
Drop the item at inventory position POS.
** DROP-SPRITE [CELL] (method)
*** Arguments
(SPRITE X Y)
*** Documentation
Add SPRITE to the world at location X,Y.
** EMBARK [CELL] (method)
*** Arguments
(&OPTIONAL V)
