notebook/xe2-reference.html

<div id="outline-container-8-8-1" class="outline-4">
<h4 id="sec-8-8-1">Arguments </h4>
<div class="outline-text-4" id="text-8-8-1">

<p>(PHASE)
</p></div>

</div>

<div id="outline-container-8-8-2" class="outline-4">
<h4 id="sec-8-8-2">Documentation </h4>
<div class="outline-text-4" id="text-8-8-2">

<p>Determine whether the cell has enough action points to take some
action during PHASE.
</p>
<p>
The Action Points system is XE2's model of roguelike time; Time is
divided into discrete episodes called phases.  Each phase consists
of one or more actions, each of which lasts a certain number of
action points' worth of time. During an action, the cell may modify
its own fields, invoke methods on itself, or send queued messages
to other cells in the environment. When a cell runs out of action
points, its phase ends and another cell's phase begins.
</p>
<p>
`Action points' (or `AP') control an actor cell's ability to take
actions during a phase. The AP score for a cell's phase starts at
 [stat-value cell :speed]. The AP cost of an action is determined by
the corresponding method's use of `expend-action-points'; see below. 
</p>
<p>
First your turn comes up, and XE2 waits for your input.  Once you
issue a command, some AP may be used up. When your AP is gone, the
computer's phase begins. The results are displayed, and if you're
still alive, the player phase begins again.
</p>
<p>
 (In realtime mode, XE2 does not wait for input.)
</p>
<p>
The queued messages' targets can be keywords like :world, :browser,
or :narrator instead of direct references to objects; the world
processes the messages before delivery and sends them to the right
place. (See also worlds.lisp)
</p></div>
</div>

</div>

<div id="outline-container-8-9" class="outline-3">
<h3 id="sec-8-9">CANCEL [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-9">


</div>

<div id="outline-container-8-9-1" class="outline-4">
<h4 id="sec-8-9-1">Arguments </h4>
<div class="outline-text-4" id="text-8-9-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-9-2" class="outline-4">
<h4 id="sec-8-9-2">Documentation </h4>
<div class="outline-text-4" id="text-8-9-2">

<p>This cell was scheduled for drop and possible loadout in a world,
but this was canceled. A canceled cell should update any global state
to reflect its disappearance; this is different from a dying cell.
</p></div>
</div>

</div>

<div id="outline-container-8-10" class="outline-3">
<h3 id="sec-8-10">CLEAR-LOCATION [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-10">


</div>

<div id="outline-container-8-10-1" class="outline-4">
<h4 id="sec-8-10-1">Arguments </h4>
<div class="outline-text-4" id="text-8-10-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-8-11" class="outline-3">
<h3 id="sec-8-11">COMPUTE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-11">


</div>

<div id="outline-container-8-11-1" class="outline-4">
<h4 id="sec-8-11-1">Arguments </h4>
<div class="outline-text-4" id="text-8-11-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-8-12" class="outline-3">
<h3 id="sec-8-12">DAMAGE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-12">


</div>

<div id="outline-container-8-12-1" class="outline-4">
<h4 id="sec-8-12-1">Arguments </h4>
<div class="outline-text-4" id="text-8-12-1">

<p>(DAMAGE-POINTS)
</p></div>
</div>

</div>

<div id="outline-container-8-13" class="outline-3">
<h3 id="sec-8-13">DELETE-CATEGORY [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-13">


</div>

<div id="outline-container-8-13-1" class="outline-4">
<h4 id="sec-8-13-1">Arguments </h4>
<div class="outline-text-4" id="text-8-13-1">

<p>(CATEGORY)
</p></div>

</div>

<div id="outline-container-8-13-2" class="outline-4">
<h4 id="sec-8-13-2">Documentation </h4>
<div class="outline-text-4" id="text-8-13-2">

<p>Remove this cell from the specified CATEGORY.
</p></div>
</div>

</div>

<div id="outline-container-8-14" class="outline-3">
<h3 id="sec-8-14">DELETE-EQUIPMENT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-14">


</div>

<div id="outline-container-8-14-1" class="outline-4">
<h4 id="sec-8-14-1">Arguments </h4>
<div class="outline-text-4" id="text-8-14-1">

<p>(SLOT)
</p></div>
</div>

</div>

<div id="outline-container-8-15" class="outline-3">
<h3 id="sec-8-15">DELETE-FROM-WORLD [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-15">


</div>

<div id="outline-container-8-15-1" class="outline-4">
<h4 id="sec-8-15-1">Arguments </h4>
<div class="outline-text-4" id="text-8-15-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-8-16" class="outline-3">
<h3 id="sec-8-16">DEQUIP [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-16">


</div>

<div id="outline-container-8-16-1" class="outline-4">
<h4 id="sec-8-16-1">Arguments </h4>
<div class="outline-text-4" id="text-8-16-1">

<p>(SLOT)
</p></div>
</div>

</div>

<div id="outline-container-8-17" class="outline-3">
<h3 id="sec-8-17">DESCRIBE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-17">


</div>

<div id="outline-container-8-17-1" class="outline-4">
<h4 id="sec-8-17-1">Arguments </h4>
<div class="outline-text-4" id="text-8-17-1">

<p>(&amp;OPTIONAL DESCRIPTION)
</p></div>

</div>

<div id="outline-container-8-17-2" class="outline-4">
<h4 id="sec-8-17-2">Documentation </h4>
<div class="outline-text-4" id="text-8-17-2">

<p>Narrate a description of the object. By default, uses
the :description field of the cell.
</p></div>
</div>

</div>

<div id="outline-container-8-18" class="outline-3">
<h3 id="sec-8-18">DIE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-18">


</div>

<div id="outline-container-8-18-1" class="outline-4">
<h4 id="sec-8-18-1">Arguments </h4>
<div class="outline-text-4" id="text-8-18-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-18-2" class="outline-4">
<h4 id="sec-8-18-2">Documentation </h4>
<div class="outline-text-4" id="text-8-18-2">

<p>Abandon this cell to the garbage collector.
</p></div>
</div>

</div>

<div id="outline-container-8-19" class="outline-3">
<h3 id="sec-8-19">DIRECTION-TO-PLAYER [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-19">


</div>

<div id="outline-container-8-19-1" class="outline-4">
<h4 id="sec-8-19-1">Arguments </h4>
<div class="outline-text-4" id="text-8-19-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-19-2" class="outline-4">
<h4 id="sec-8-19-2">Documentation </h4>
<div class="outline-text-4" id="text-8-19-2">

<p>Calculate the general compass direction of the player.
</p></div>
</div>

</div>

<div id="outline-container-8-20" class="outline-3">
<h3 id="sec-8-20">DISEMBARK [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-20">


</div>

<div id="outline-container-8-20-1" class="outline-4">
<h4 id="sec-8-20-1">Arguments </h4>
<div class="outline-text-4" id="text-8-20-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-20-2" class="outline-4">
<h4 id="sec-8-20-2">Documentation </h4>
<div class="outline-text-4" id="text-8-20-2">

<p>Eject the occupant.
</p></div>
</div>

</div>

<div id="outline-container-8-21" class="outline-3">
<h3 id="sec-8-21">DISLOCATE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-21">


</div>

<div id="outline-container-8-21-1" class="outline-4">
<h4 id="sec-8-21-1">Arguments </h4>
<div class="outline-text-4" id="text-8-21-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-21-2" class="outline-4">
<h4 id="sec-8-21-2">Documentation </h4>
<div class="outline-text-4" id="text-8-21-2">

<p>Remove any location data from the cell.
</p></div>
</div>

</div>

<div id="outline-container-8-22" class="outline-3">
<h3 id="sec-8-22">DISTANCE-TO-PLAYER [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-22">


</div>

<div id="outline-container-8-22-1" class="outline-4">
<h4 id="sec-8-22-1">Arguments </h4>
<div class="outline-text-4" id="text-8-22-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-22-2" class="outline-4">
<h4 id="sec-8-22-2">Documentation </h4>
<div class="outline-text-4" id="text-8-22-2">

<p>Calculate the distance from the current location to the player.
</p></div>
</div>

</div>

<div id="outline-container-8-23" class="outline-3">
<h3 id="sec-8-23">DO-COLLISION [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-23">


</div>

<div id="outline-container-8-23-1" class="outline-4">
<h4 id="sec-8-23-1">Arguments </h4>
<div class="outline-text-4" id="text-8-23-1">

<p>(OBJECT)
</p></div>

</div>

<div id="outline-container-8-23-2" class="outline-4">
<h4 id="sec-8-23-2">Documentation </h4>
<div class="outline-text-4" id="text-8-23-2">

<p>Respond to a collision detected with OBJECT.
</p></div>
</div>

</div>

<div id="outline-container-8-24" class="outline-3">
<h3 id="sec-8-24">DO-POST-UNPROXIED [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-24">


</div>

<div id="outline-container-8-24-1" class="outline-4">
<h4 id="sec-8-24-1">Arguments </h4>
<div class="outline-text-4" id="text-8-24-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-24-2" class="outline-4">
<h4 id="sec-8-24-2">Documentation </h4>
<div class="outline-text-4" id="text-8-24-2">

<p>This method is invoked on the unproxied former occupant cell after
unproxying. By default, it does nothing.
</p></div>
</div>

</div>

<div id="outline-container-8-25" class="outline-3">
<h3 id="sec-8-25">DRAW [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-25">


</div>

<div id="outline-container-8-25-1" class="outline-4">
<h4 id="sec-8-25-1">Arguments </h4>
<div class="outline-text-4" id="text-8-25-1">

<p>(X Y IMAGE)
</p></div>

</div>

<div id="outline-container-8-25-2" class="outline-4">
<h4 id="sec-8-25-2">Documentation </h4>
<div class="outline-text-4" id="text-8-25-2">

<p>Use XE2 drawing commands to render a presentation of this cell at
X, Y to the offscreen image IMAGE.  This method is invoked to draw a
cell when its TILE field is nil, or when it is in the
category :drawn. See also viewport.lisp.
</p></div>
</div>

</div>

<div id="outline-container-8-26" class="outline-3">
<h3 id="sec-8-26">DROP [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-26">


</div>

<div id="outline-container-8-26-1" class="outline-4">
<h4 id="sec-8-26-1">Arguments </h4>
<div class="outline-text-4" id="text-8-26-1">

<p>(CELL &amp;KEY LOADOUT (EXCLUSIVE NIL))
</p></div>

</div>

<div id="outline-container-8-26-2" class="outline-4">
<h4 id="sec-8-26-2">Documentation </h4>
<div class="outline-text-4" id="text-8-26-2">

<p>Add CELL to the world at the current location. By default,
EXCLUSIVE is nil; this allows one to drop objects on top of oneself.
When LOADOUT is non-nil, call the :loadout method.
</p></div>
</div>

</div>

<div id="outline-container-8-27" class="outline-3">
<h3 id="sec-8-27">DROP-ITEM [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-27">


</div>

<div id="outline-container-8-27-1" class="outline-4">
<h4 id="sec-8-27-1">Arguments </h4>
<div class="outline-text-4" id="text-8-27-1">

<p>(POS)
</p></div>

</div>

<div id="outline-container-8-27-2" class="outline-4">
<h4 id="sec-8-27-2">Documentation </h4>
<div class="outline-text-4" id="text-8-27-2">

<p>Drop the item at inventory position POS.
</p></div>
</div>

</div>

<div id="outline-container-8-28" class="outline-3">
<h3 id="sec-8-28">DROP-SPRITE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-28">


</div>

<div id="outline-container-8-28-1" class="outline-4">
<h4 id="sec-8-28-1">Arguments </h4>
<div class="outline-text-4" id="text-8-28-1">

<p>(SPRITE X Y)
</p></div>

</div>

<div id="outline-container-8-28-2" class="outline-4">
<h4 id="sec-8-28-2">Documentation </h4>
<div class="outline-text-4" id="text-8-28-2">

<p>Add SPRITE to the world at location X,Y.
</p></div>
</div>

</div>
