notebook/xe2-reference.org
*** Documentation
Enter a vehicle V.
** END-PHASE [CELL] (method)
*** Arguments
NIL
*** Documentation
End this cell's phase.
** EQUIP [CELL] (method)
*** Arguments
(&OPTIONAL REFERENCE SLOT)
** EQUIPMENT-MATCH [CELL] (method)
*** Arguments
(ITEM)
*** Documentation
Return a list of possible slots on which this cell could equip
ITEM. Returns nil if no such match is possible.
** EQUIPMENT-SLOT [CELL] (method)
*** Arguments
(SLOT)
*** Documentation
Return the equipment item (if any) in the slot named SLOT.
** EXIT [CELL] (method)
*** Arguments
NIL
*** Documentation
This method is invoked on a player cell when it leaves a world.
** EXPEND-ACTION-POINTS [CELL] (method)
*** Arguments
(POINTS &OPTIONAL MIN)
*** Documentation
Expend POINTS action points, possibly going into the negative.
** EXPEND-DEFAULT-ACTION-POINTS [CELL] (method)
*** Arguments
NIL
** EXPEND-ENERGY [CELL] (method)
*** Arguments
(AMOUNT)
** FIND [CELL] (method)
*** Arguments
(&KEY (DIRECTION HERE) (INDEX TOP) CATEGORY)
** FIRE [CELL] (method)
*** Arguments
(DIRECTION)
** FIRST-OPEN-SLOT [CELL] (method)
*** Arguments
NIL
*** Documentation
Return the integer position of the first open inventory slot, or
nil if none.
** FORM-HEIGHT [CELL] (method)
*** Arguments
NIL
** FORM-LABEL [CELL] (method)
*** Arguments
NIL
** FORM-RENDER [CELL] (method)
*** Arguments
(IMAGE X Y WIDTH)
** FORM-WIDTH [CELL] (method)
*** Arguments
NIL
** FORWARD [CELL] (method)
*** Arguments
(METHOD &REST ARGS)
*** Documentation
Attempt to deliver the failed message to the occupant, if any.
** GET [CELL] (method)
*** Arguments
NIL
** GET-ACTIONS [CELL] (method)
*** Arguments
NIL
** GET-MAX-ITEMS [CELL] (method)
*** Arguments
NIL
*** Documentation
Return the maximum number of items this container can hold.
** GRID-COORDINATES [CELL] (method)
*** Arguments
NIL
** HIT [CELL] (method)
*** Arguments
(&OPTIONAL OTHER)
** IMAGE-COORDINATES [CELL] (method)
*** Arguments
NIL
*** Documentation
Return as values X,Y the viewport image coordinates of CELL.
** IN-CATEGORY [CELL] (method)
*** Arguments
(CATEGORY)
