notebook/xe2-reference.html

<div id="outline-container-8-29" class="outline-3">
<h3 id="sec-8-29">EMBARK [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-29">


</div>

<div id="outline-container-8-29-1" class="outline-4">
<h4 id="sec-8-29-1">Arguments </h4>
<div class="outline-text-4" id="text-8-29-1">

<p>(&amp;OPTIONAL V)
</p></div>

</div>

<div id="outline-container-8-29-2" class="outline-4">
<h4 id="sec-8-29-2">Documentation </h4>
<div class="outline-text-4" id="text-8-29-2">

<p>Enter a vehicle V.
</p></div>
</div>

</div>

<div id="outline-container-8-30" class="outline-3">
<h3 id="sec-8-30">END-PHASE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-30">


</div>

<div id="outline-container-8-30-1" class="outline-4">
<h4 id="sec-8-30-1">Arguments </h4>
<div class="outline-text-4" id="text-8-30-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-30-2" class="outline-4">
<h4 id="sec-8-30-2">Documentation </h4>
<div class="outline-text-4" id="text-8-30-2">

<p>End this cell's phase.
</p></div>
</div>

</div>

<div id="outline-container-8-31" class="outline-3">
<h3 id="sec-8-31">EQUIP [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-31">


</div>

<div id="outline-container-8-31-1" class="outline-4">
<h4 id="sec-8-31-1">Arguments </h4>
<div class="outline-text-4" id="text-8-31-1">

<p>(&amp;OPTIONAL REFERENCE SLOT)
</p></div>
</div>

</div>

<div id="outline-container-8-32" class="outline-3">
<h3 id="sec-8-32">EQUIPMENT-MATCH [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-32">


</div>

<div id="outline-container-8-32-1" class="outline-4">
<h4 id="sec-8-32-1">Arguments </h4>
<div class="outline-text-4" id="text-8-32-1">

<p>(ITEM)
</p></div>

</div>

<div id="outline-container-8-32-2" class="outline-4">
<h4 id="sec-8-32-2">Documentation </h4>
<div class="outline-text-4" id="text-8-32-2">

<p>Return a list of possible slots on which this cell could equip
ITEM. Returns nil if no such match is possible.
</p></div>
</div>

</div>

<div id="outline-container-8-33" class="outline-3">
<h3 id="sec-8-33">EQUIPMENT-SLOT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-33">


</div>

<div id="outline-container-8-33-1" class="outline-4">
<h4 id="sec-8-33-1">Arguments </h4>
<div class="outline-text-4" id="text-8-33-1">

<p>(SLOT)
</p></div>

</div>

<div id="outline-container-8-33-2" class="outline-4">
<h4 id="sec-8-33-2">Documentation </h4>
<div class="outline-text-4" id="text-8-33-2">

<p>Return the equipment item (if any) in the slot named SLOT.
</p></div>
</div>

</div>

<div id="outline-container-8-34" class="outline-3">
<h3 id="sec-8-34">EXIT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-34">


</div>

<div id="outline-container-8-34-1" class="outline-4">
<h4 id="sec-8-34-1">Arguments </h4>
<div class="outline-text-4" id="text-8-34-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-34-2" class="outline-4">
<h4 id="sec-8-34-2">Documentation </h4>
<div class="outline-text-4" id="text-8-34-2">

<p>This method is invoked on a player cell when it leaves a world.
</p></div>
</div>

</div>

<div id="outline-container-8-35" class="outline-3">
<h3 id="sec-8-35">EXPEND-ACTION-POINTS [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-35">


</div>

<div id="outline-container-8-35-1" class="outline-4">
<h4 id="sec-8-35-1">Arguments </h4>
<div class="outline-text-4" id="text-8-35-1">

<p>(POINTS &amp;OPTIONAL MIN)
</p></div>

</div>

<div id="outline-container-8-35-2" class="outline-4">
<h4 id="sec-8-35-2">Documentation </h4>
<div class="outline-text-4" id="text-8-35-2">

<p>Expend POINTS action points, possibly going into the negative.
</p></div>
</div>

</div>

<div id="outline-container-8-36" class="outline-3">
<h3 id="sec-8-36">EXPEND-DEFAULT-ACTION-POINTS [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-36">


</div>

<div id="outline-container-8-36-1" class="outline-4">
<h4 id="sec-8-36-1">Arguments </h4>
<div class="outline-text-4" id="text-8-36-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-8-37" class="outline-3">
<h3 id="sec-8-37">EXPEND-ENERGY [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-37">


</div>

<div id="outline-container-8-37-1" class="outline-4">
<h4 id="sec-8-37-1">Arguments </h4>
<div class="outline-text-4" id="text-8-37-1">

<p>(AMOUNT)
</p></div>
</div>

</div>

<div id="outline-container-8-38" class="outline-3">
<h3 id="sec-8-38">FIND [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-38">


</div>

<div id="outline-container-8-38-1" class="outline-4">
<h4 id="sec-8-38-1">Arguments </h4>
<div class="outline-text-4" id="text-8-38-1">

<p>(&amp;KEY (DIRECTION HERE) (INDEX TOP) CATEGORY)
</p></div>
</div>

</div>

<div id="outline-container-8-39" class="outline-3">
<h3 id="sec-8-39">FIRE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-39">


</div>

<div id="outline-container-8-39-1" class="outline-4">
<h4 id="sec-8-39-1">Arguments </h4>
<div class="outline-text-4" id="text-8-39-1">

<p>(DIRECTION)
</p></div>
</div>

</div>

<div id="outline-container-8-40" class="outline-3">
<h3 id="sec-8-40">FIRST-OPEN-SLOT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-40">


</div>

<div id="outline-container-8-40-1" class="outline-4">
<h4 id="sec-8-40-1">Arguments </h4>
<div class="outline-text-4" id="text-8-40-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-40-2" class="outline-4">
<h4 id="sec-8-40-2">Documentation </h4>
<div class="outline-text-4" id="text-8-40-2">

<p>Return the integer position of the first open inventory slot, or
nil if none.
</p></div>
</div>

</div>

<div id="outline-container-8-41" class="outline-3">
<h3 id="sec-8-41">FORM-HEIGHT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-41">


</div>

<div id="outline-container-8-41-1" class="outline-4">
<h4 id="sec-8-41-1">Arguments </h4>
<div class="outline-text-4" id="text-8-41-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-8-42" class="outline-3">
<h3 id="sec-8-42">FORM-LABEL [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-42">


</div>

<div id="outline-container-8-42-1" class="outline-4">
<h4 id="sec-8-42-1">Arguments </h4>
<div class="outline-text-4" id="text-8-42-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-8-43" class="outline-3">
<h3 id="sec-8-43">FORM-RENDER [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-43">


</div>

<div id="outline-container-8-43-1" class="outline-4">
<h4 id="sec-8-43-1">Arguments </h4>
<div class="outline-text-4" id="text-8-43-1">

<p>(IMAGE X Y WIDTH)
</p></div>
</div>

</div>

<div id="outline-container-8-44" class="outline-3">
<h3 id="sec-8-44">FORM-WIDTH [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-44">


</div>

<div id="outline-container-8-44-1" class="outline-4">
<h4 id="sec-8-44-1">Arguments </h4>
<div class="outline-text-4" id="text-8-44-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-8-45" class="outline-3">
<h3 id="sec-8-45">FORWARD [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-45">


</div>

<div id="outline-container-8-45-1" class="outline-4">
<h4 id="sec-8-45-1">Arguments </h4>
<div class="outline-text-4" id="text-8-45-1">

<p>(METHOD &amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-8-45-2" class="outline-4">
<h4 id="sec-8-45-2">Documentation </h4>
<div class="outline-text-4" id="text-8-45-2">

<p>Attempt to deliver the failed message to the occupant, if any.
</p></div>
</div>

</div>

<div id="outline-container-8-46" class="outline-3">
<h3 id="sec-8-46">GET [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-46">


</div>

<div id="outline-container-8-46-1" class="outline-4">
<h4 id="sec-8-46-1">Arguments </h4>
<div class="outline-text-4" id="text-8-46-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-8-47" class="outline-3">
<h3 id="sec-8-47">GET-ACTIONS [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-47">


</div>

<div id="outline-container-8-47-1" class="outline-4">
<h4 id="sec-8-47-1">Arguments </h4>
<div class="outline-text-4" id="text-8-47-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-8-48" class="outline-3">
<h3 id="sec-8-48">GET-MAX-ITEMS [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-48">


</div>

<div id="outline-container-8-48-1" class="outline-4">
<h4 id="sec-8-48-1">Arguments </h4>
<div class="outline-text-4" id="text-8-48-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-48-2" class="outline-4">
<h4 id="sec-8-48-2">Documentation </h4>
<div class="outline-text-4" id="text-8-48-2">

<p>Return the maximum number of items this container can hold.
</p></div>
</div>

</div>

<div id="outline-container-8-49" class="outline-3">
<h3 id="sec-8-49">GRID-COORDINATES [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-49">


</div>

<div id="outline-container-8-49-1" class="outline-4">
<h4 id="sec-8-49-1">Arguments </h4>
<div class="outline-text-4" id="text-8-49-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-8-50" class="outline-3">
<h3 id="sec-8-50">HIT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-50">


</div>

<div id="outline-container-8-50-1" class="outline-4">
<h4 id="sec-8-50-1">Arguments </h4>
<div class="outline-text-4" id="text-8-50-1">

<p>(&amp;OPTIONAL OTHER)
</p></div>
</div>

</div>

<div id="outline-container-8-51" class="outline-3">
<h3 id="sec-8-51">IMAGE-COORDINATES [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-51">


</div>

<div id="outline-container-8-51-1" class="outline-4">
<h4 id="sec-8-51-1">Arguments </h4>
<div class="outline-text-4" id="text-8-51-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-51-2" class="outline-4">
<h4 id="sec-8-51-2">Documentation </h4>
<div class="outline-text-4" id="text-8-51-2">

<p>Return as values X,Y the viewport image coordinates of CELL.
</p></div>
</div>

</div>

<div id="outline-container-8-52" class="outline-3">
<h3 id="sec-8-52">IN-CATEGORY [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-52">


</div>
