notebook/xe2-reference.org
*** Documentation
Return non-nil if this cell is in the specified CATEGORY.

Cells may be placed into categories that influence their processing by
the engine. The field `<categories>' is a set of keyword symbols; if a
symbol `:foo' is in the list, then the cell is in the category `:foo'.

Although a game built on XE2 can define whatever categories are
needed, certain base categories are built-in and have a fixed
interpretation:

 -    :actor --- This cell is active and may be controlled by either the
      user or the CPU. Only actor cells receive `:run' messages
      every turn. Other cells are purely `reactive'. Actor
      cells participate in the Action Points system.
 -    :target --- This cell is susceptible to targeting.
 -    :proxy --- This cell is a proxy for another cell.
 -    :drawn --- This cell has a [draw] method used for custom drawing.
 -    :proxied  --- This cell is an occupant of a proxy.
 -    :dead --- This cell is no longer receiving run messages.
 -    :player --- Only one cell (your player avatar) has this category.
 -    :enemy --- This cell is playing against you.
 -    :exclusive --- Prevent some objects from stacking. See also the method `drop-cell' in worlds.lisp
 -    :obstacle --- Blocks movement and causes collisions
 -    :pushable --- Can be pushed by impacts.
 -    :ephemeral --- This cell is not preserved when exiting a world.
 -    :combining --- This cell automatically combines units with other cells in a container.
 -    :light-source --- This object casts light. 
 -    :opaque --- Blocks line-of-sight, casts shadows. 
 -    :container --- This cell contains other cells, and has an <inventory> field
 -    :contained ---  This cell is contained in another cell (i.e. not in open space on the map)
 -    :item --- A potential inventory item. 
 -    :equipper --- Uses equipment. 
 -    :equipped --- This item is currently equipped.
 -    :equipment --- This item can be equipped. 
** IS-ACTOR [CELL] (method)
*** Arguments
NIL
*** Documentation
Return non-nil if this cell is an actor. Actor cells receive a :run
message every frame.
** IS-CONTAINER [CELL] (method)
*** Arguments
NIL
*** Documentation
Returns non-nil if this cell is a container.
** IS-EQUIPMENT [CELL] (method)
*** Arguments
NIL
*** Documentation
Return non-nil if this cell is a piece of equipment.
** IS-ITEM [CELL] (method)
*** Arguments
NIL
*** Documentation
Returns non-nil if this cell is a potential inventory item.
** IS-LIGHT-SOURCE [CELL] (method)
*** Arguments
NIL
*** Documentation
Returns non-nil if this cell is a light source.
** IS-LOCATED [CELL] (method)
*** Arguments
NIL
*** Documentation
Returns non-nil if this cell is located somewhere on the grid.
** IS-PLAYER [CELL] (method)
*** Arguments
NIL
*** Documentation
Return non-nil if this is the player.
** ITEM-AT [CELL] (method)
*** Arguments
(POS)
*** Documentation
Return the item at inventory position POS.
** LOADOUT [CELL] (method)
*** Arguments
NIL
*** Documentation
This is called for cells after being dropped in a world, with a
non-nil :loadout argument. It can also be triggered manually.  Use
`loadout' for things that have to be done while in a world. (During
your cell's normal CLON `initialize' method, the cell will not be in a
world or have a location.
** MAKE-EQUIPMENT [CELL] (method)
*** Arguments
NIL
*** Documentation
Create an empty equipment property list.
** MAKE-INVENTORY [CELL] (method)
*** Arguments
NIL
*** Documentation
Create an empty <inventory> of length <max-items>.
** MOVE [CELL] (method)
*** Arguments
(DIRECTION &OPTIONAL IGNORE-OBSTACLES)
*** Documentation
Move this cell one step in DIRECTION on the grid. If
IGNORE-OBSTACLES is non-nil, the move will occur even if an obstacle
is in the way. Returns non-nil if a move occurred.
** MOVE-TO [CELL] (method)
*** Arguments
(R C)
** PHASE-HOOK [CELL] (method)
*** Arguments
NIL
*** Documentation
Invoked once at the beginning of each phase.
** PLAY-SAMPLE [CELL] (method)
*** Arguments
(SAMPLE-NAME)
*** Documentation
Play the sample SAMPLE-NAME.
May be affected by the player's :hearing-range stat, if any.
** PROXY [CELL] (method)
*** Arguments
(OCCUPANT)
*** Documentation
Make this cell a proxy for OCCUPANT.
** PUSH [CELL] (method)
*** Arguments
(DIRECTION)
