notebook/xe2-reference.html

<div id="outline-container-8-52-1" class="outline-4">
<h4 id="sec-8-52-1">Arguments </h4>
<div class="outline-text-4" id="text-8-52-1">

<p>(CATEGORY)
</p></div>

</div>

<div id="outline-container-8-52-2" class="outline-4">
<h4 id="sec-8-52-2">Documentation </h4>
<div class="outline-text-4" id="text-8-52-2">

<p>Return non-nil if this cell is in the specified CATEGORY.
</p>
<p>
Cells may be placed into categories that influence their processing by
the engine. The field `&lt;categories&gt;' is a set of keyword symbols; if a
symbol `:foo' is in the list, then the cell is in the category `:foo'.
</p>
<p>
Although a game built on XE2 can define whatever categories are
needed, certain base categories are built-in and have a fixed
interpretation:
</p>
<ul>
<li>:actor &mdash; This cell is active and may be controlled by either the
      user or the CPU. Only actor cells receive `:run' messages
      every turn. Other cells are purely `reactive'. Actor
      cells participate in the Action Points system.
</li>
<li>:target &mdash; This cell is susceptible to targeting.
</li>
<li>:proxy &mdash; This cell is a proxy for another cell.
</li>
<li>:drawn &mdash; This cell has a [draw] method used for custom drawing.
</li>
<li>:proxied  &mdash; This cell is an occupant of a proxy.
</li>
<li>:dead &mdash; This cell is no longer receiving run messages.
</li>
<li>:player &mdash; Only one cell (your player avatar) has this category.
</li>
<li>:enemy &mdash; This cell is playing against you.
</li>
<li>:exclusive &mdash; Prevent some objects from stacking. See also the method `drop-cell' in worlds.lisp
</li>
<li>:obstacle &mdash; Blocks movement and causes collisions
</li>
<li>:pushable &mdash; Can be pushed by impacts.
</li>
<li>:ephemeral &mdash; This cell is not preserved when exiting a world.
</li>
<li>:combining &mdash; This cell automatically combines units with other cells in a container.
</li>
<li>:light-source &mdash; This object casts light. 
</li>
<li>:opaque &mdash; Blocks line-of-sight, casts shadows. 
</li>
<li>:container &mdash; This cell contains other cells, and has an &lt;inventory&gt; field
</li>
<li>:contained &mdash;  This cell is contained in another cell (i.e. not in open space on the map)
</li>
<li>:item &mdash; A potential inventory item. 
</li>
<li>:equipper &mdash; Uses equipment. 
</li>
<li>:equipped &mdash; This item is currently equipped.
</li>
<li>:equipment &mdash; This item can be equipped. 
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-8-53" class="outline-3">
<h3 id="sec-8-53">IS-ACTOR [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-53">


</div>

<div id="outline-container-8-53-1" class="outline-4">
<h4 id="sec-8-53-1">Arguments </h4>
<div class="outline-text-4" id="text-8-53-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-53-2" class="outline-4">
<h4 id="sec-8-53-2">Documentation </h4>
<div class="outline-text-4" id="text-8-53-2">

<p>Return non-nil if this cell is an actor. Actor cells receive a :run
message every frame.
</p></div>
</div>

</div>

<div id="outline-container-8-54" class="outline-3">
<h3 id="sec-8-54">IS-CONTAINER [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-54">


</div>

<div id="outline-container-8-54-1" class="outline-4">
<h4 id="sec-8-54-1">Arguments </h4>
<div class="outline-text-4" id="text-8-54-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-54-2" class="outline-4">
<h4 id="sec-8-54-2">Documentation </h4>
<div class="outline-text-4" id="text-8-54-2">

<p>Returns non-nil if this cell is a container.
</p></div>
</div>

</div>

<div id="outline-container-8-55" class="outline-3">
<h3 id="sec-8-55">IS-EQUIPMENT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-55">


</div>

<div id="outline-container-8-55-1" class="outline-4">
<h4 id="sec-8-55-1">Arguments </h4>
<div class="outline-text-4" id="text-8-55-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-55-2" class="outline-4">
<h4 id="sec-8-55-2">Documentation </h4>
<div class="outline-text-4" id="text-8-55-2">

<p>Return non-nil if this cell is a piece of equipment.
</p></div>
</div>

</div>

<div id="outline-container-8-56" class="outline-3">
<h3 id="sec-8-56">IS-ITEM [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-56">


</div>

<div id="outline-container-8-56-1" class="outline-4">
<h4 id="sec-8-56-1">Arguments </h4>
<div class="outline-text-4" id="text-8-56-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-56-2" class="outline-4">
<h4 id="sec-8-56-2">Documentation </h4>
<div class="outline-text-4" id="text-8-56-2">

<p>Returns non-nil if this cell is a potential inventory item.
</p></div>
</div>

</div>

<div id="outline-container-8-57" class="outline-3">
<h3 id="sec-8-57">IS-LIGHT-SOURCE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-57">


</div>

<div id="outline-container-8-57-1" class="outline-4">
<h4 id="sec-8-57-1">Arguments </h4>
<div class="outline-text-4" id="text-8-57-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-57-2" class="outline-4">
<h4 id="sec-8-57-2">Documentation </h4>
<div class="outline-text-4" id="text-8-57-2">

<p>Returns non-nil if this cell is a light source.
</p></div>
</div>

</div>

<div id="outline-container-8-58" class="outline-3">
<h3 id="sec-8-58">IS-LOCATED [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-58">


</div>

<div id="outline-container-8-58-1" class="outline-4">
<h4 id="sec-8-58-1">Arguments </h4>
<div class="outline-text-4" id="text-8-58-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-58-2" class="outline-4">
<h4 id="sec-8-58-2">Documentation </h4>
<div class="outline-text-4" id="text-8-58-2">

<p>Returns non-nil if this cell is located somewhere on the grid.
</p></div>
</div>

</div>

<div id="outline-container-8-59" class="outline-3">
<h3 id="sec-8-59">IS-PLAYER [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-59">


</div>

<div id="outline-container-8-59-1" class="outline-4">
<h4 id="sec-8-59-1">Arguments </h4>
<div class="outline-text-4" id="text-8-59-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-59-2" class="outline-4">
<h4 id="sec-8-59-2">Documentation </h4>
<div class="outline-text-4" id="text-8-59-2">

<p>Return non-nil if this is the player.
</p></div>
</div>

</div>

<div id="outline-container-8-60" class="outline-3">
<h3 id="sec-8-60">ITEM-AT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-60">


</div>

<div id="outline-container-8-60-1" class="outline-4">
<h4 id="sec-8-60-1">Arguments </h4>
<div class="outline-text-4" id="text-8-60-1">

<p>(POS)
</p></div>

</div>

<div id="outline-container-8-60-2" class="outline-4">
<h4 id="sec-8-60-2">Documentation </h4>
<div class="outline-text-4" id="text-8-60-2">

<p>Return the item at inventory position POS.
</p></div>
</div>

</div>

<div id="outline-container-8-61" class="outline-3">
<h3 id="sec-8-61">LOADOUT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-61">


</div>

<div id="outline-container-8-61-1" class="outline-4">
<h4 id="sec-8-61-1">Arguments </h4>
<div class="outline-text-4" id="text-8-61-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-61-2" class="outline-4">
<h4 id="sec-8-61-2">Documentation </h4>
<div class="outline-text-4" id="text-8-61-2">

<p>This is called for cells after being dropped in a world, with a
non-nil :loadout argument. It can also be triggered manually.  Use
`loadout' for things that have to be done while in a world. (During
your cell's normal CLON `initialize' method, the cell will not be in a
world or have a location.
</p></div>
</div>

</div>

<div id="outline-container-8-62" class="outline-3">
<h3 id="sec-8-62">MAKE-EQUIPMENT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-62">


</div>

<div id="outline-container-8-62-1" class="outline-4">
<h4 id="sec-8-62-1">Arguments </h4>
<div class="outline-text-4" id="text-8-62-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-62-2" class="outline-4">
<h4 id="sec-8-62-2">Documentation </h4>
<div class="outline-text-4" id="text-8-62-2">

<p>Create an empty equipment property list.
</p></div>
</div>

</div>

<div id="outline-container-8-63" class="outline-3">
<h3 id="sec-8-63">MAKE-INVENTORY [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-63">


</div>

<div id="outline-container-8-63-1" class="outline-4">
<h4 id="sec-8-63-1">Arguments </h4>
<div class="outline-text-4" id="text-8-63-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-63-2" class="outline-4">
<h4 id="sec-8-63-2">Documentation </h4>
<div class="outline-text-4" id="text-8-63-2">

<p>Create an empty &lt;inventory&gt; of length &lt;max-items&gt;.
</p></div>
</div>

</div>

<div id="outline-container-8-64" class="outline-3">
<h3 id="sec-8-64">MOVE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-64">


</div>

<div id="outline-container-8-64-1" class="outline-4">
<h4 id="sec-8-64-1">Arguments </h4>
<div class="outline-text-4" id="text-8-64-1">

<p>(DIRECTION &amp;OPTIONAL IGNORE-OBSTACLES)
</p></div>

</div>

<div id="outline-container-8-64-2" class="outline-4">
<h4 id="sec-8-64-2">Documentation </h4>
<div class="outline-text-4" id="text-8-64-2">

<p>Move this cell one step in DIRECTION on the grid. If
IGNORE-OBSTACLES is non-nil, the move will occur even if an obstacle
is in the way. Returns non-nil if a move occurred.
</p></div>
</div>

</div>

<div id="outline-container-8-65" class="outline-3">
<h3 id="sec-8-65">MOVE-TO [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-65">


</div>

<div id="outline-container-8-65-1" class="outline-4">
<h4 id="sec-8-65-1">Arguments </h4>
<div class="outline-text-4" id="text-8-65-1">

<p>(R C)
</p></div>
</div>

</div>

<div id="outline-container-8-66" class="outline-3">
<h3 id="sec-8-66">PHASE-HOOK [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-66">


</div>

<div id="outline-container-8-66-1" class="outline-4">
<h4 id="sec-8-66-1">Arguments </h4>
<div class="outline-text-4" id="text-8-66-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-66-2" class="outline-4">
<h4 id="sec-8-66-2">Documentation </h4>
<div class="outline-text-4" id="text-8-66-2">

<p>Invoked once at the beginning of each phase.
</p></div>
</div>

</div>

<div id="outline-container-8-67" class="outline-3">
<h3 id="sec-8-67">PLAY-SAMPLE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-67">


</div>

<div id="outline-container-8-67-1" class="outline-4">
<h4 id="sec-8-67-1">Arguments </h4>
<div class="outline-text-4" id="text-8-67-1">

<p>(SAMPLE-NAME)
</p></div>

</div>

<div id="outline-container-8-67-2" class="outline-4">
<h4 id="sec-8-67-2">Documentation </h4>
<div class="outline-text-4" id="text-8-67-2">

<p>Play the sample SAMPLE-NAME.
May be affected by the player's :hearing-range stat, if any.
</p></div>
</div>

</div>

<div id="outline-container-8-68" class="outline-3">
<h3 id="sec-8-68">PROXY [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-68">


</div>

<div id="outline-container-8-68-1" class="outline-4">
<h4 id="sec-8-68-1">Arguments </h4>
<div class="outline-text-4" id="text-8-68-1">

<p>(OCCUPANT)
</p></div>

</div>

<div id="outline-container-8-68-2" class="outline-4">
<h4 id="sec-8-68-2">Documentation </h4>
<div class="outline-text-4" id="text-8-68-2">

<p>Make this cell a proxy for OCCUPANT.
</p></div>
</div>

</div>

<div id="outline-container-8-69" class="outline-3">
<h3 id="sec-8-69">PUSH [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-69">


</div>
