notebook/xe2-reference.org
** REMOVE-ITEM [CELL] (method)
*** Arguments
(ITEM)
*** Documentation
Remove ITEM from the <inventory>.
Return ITEM if successful, nil otherwise.
** REPLACE-ITEM-AT [CELL] (method)
*** Arguments
(ITEM POS)
*** Documentation
Replace the inventory item at position POS with ITEM.
** RESOLVE [CELL] (method)
*** Arguments
(REFERENCE &OPTIONAL CATEGORY)
*** Documentation
Accept a REFERENCE to a cell, and try to get the real cell.
The REFERENCE may be an object, one of the `*compass-directions*', an
equipment slot keyword, or an integer denoting the nth inventory
slot.
** SAY [CELL] (method)
*** Arguments
(FORMAT-STRING &REST ARGS)
*** Documentation
Print a string to the message narration window. Arguments
are as with `format'.
** SCREEN-COORDINATES [CELL] (method)
*** Arguments
NIL
*** Documentation
Return as values X,Y the screen coordinates of CELL.
** SELECT [CELL] (method)
*** Arguments
NIL
** SET [CELL] (method)
*** Arguments
(DATA)
** SET-CONTAINER [CELL] (method)
*** Arguments
(CONTAINER)
*** Documentation
Set the container pointer of this cell to CONTAINER.
All contained cells maintain a pointer to their containers.
** SET-LOCATION [CELL] (method)
*** Arguments
(R C)
*** Documentation
Set the row R and column C of the cell.
** START [CELL] (method)
*** Arguments
NIL
*** Documentation
This method is invoked on the player whenever entering a new world map.
** STAT-EFFECT [CELL] (method)
*** Arguments
(STAT-NAME VAL &OPTIONAL (COMPONENT BASE) (CLAMPING T))
*** Documentation
Add VAL, which may be negative, to the COMPONENT part of the stat
field named by STAT-NAME. The default is to change the :base value.
** STAT-VALUE [CELL] (method)
*** Arguments
(STAT-NAME &OPTIONAL COMPONENT (CLAMPING T))
*** Documentation
Compute the current value of the statistic in field STAT-NAME.
If a COMPONENT keyword is provided, return that component of the stat
instead of computing the value.

Characters and objects may have numeric-valued attributes like
Strength and Dexterity that have a minimum and maximum value
 (perhaps decided on the basis of class) as well as temporary and
permanent effects. In this case you want to store a base value,
minimum, maximum, and current delta, and compute the value at run
time.

Stats are just property lists with four different components: :base
:min :max and :delta.
** STEP [CELL] (method)
*** Arguments
(STEPPER)
*** Documentation
Respond to being stepped on by the STEPPER.
** STEP-ON-CURRENT-SQUARE [CELL] (method)
*** Arguments
NIL
*** Documentation
Send :step events to all the cells on the current square.
** TAKE [CELL] (method)
*** Arguments
(&KEY (DIRECTION HERE) INDEX CATEGORY)
*** Documentation
Take the item and return non-nil if successful.
** UNPROXY [CELL] (method)
*** Arguments
(&KEY DR DC DX DY)
*** Documentation
Remove the occupant from this cell, dropping it on top.
** USE [CELL] (method)
*** Arguments
(USER)
*** Documentation
Return non-nil if cell is used up and should disappear.
** VIEWPORT-COORDINATES [CELL] (method)
*** Arguments
NIL
*** Documentation
Return as values X,Y the world coordinates of CELL.
** WEIGHT [CELL] (method)
*** Arguments
NIL
*** Documentation
Recursively calculate the weight of this cell.
** XY-COORDINATES [CELL] (method)
*** Arguments
NIL
* =COMMENT-CELL= (prototype)
** Parent prototype
: =CELL=
*** Fields
**** COMMENT (field)
**** TYPE (field)
**** AUTO-LOADOUT (field)
***** Documentation
When non-nil, the :loadout method is invoked upon entry into a world.
**** TEAM (field)
***** Documentation
Keyword symbol of team, if any.
**** WEIGHT (field)
***** Documentation
Recursively calculate the weight of this cell.
**** WIDGET (field)
***** Documentation
XE2 widget object, if any.
**** TILE (field)
***** Documentation
Resource name of image. 
When nil, the method DRAW is invoked instead of using a tile.
**** RENDER-CELL (field)
***** Documentation
Subcell to render. See load-sprite-sheet-resource.
**** ROW (field)
***** Documentation
When non-nil, the current row location of the cell.
**** COLUMN (field)
***** Documentation
When non-nil, the current column of the cell.
**** CATEGORIES (field)
***** Documentation
List of category keyword symbols
**** LIGHT-RADIUS (field)
***** Documentation
Strength of light cast by this object.
