notebook/xe2-reference.html

<div id="outline-container-8-69-1" class="outline-4">
<h4 id="sec-8-69-1">Arguments </h4>
<div class="outline-text-4" id="text-8-69-1">

<p>(DIRECTION)
</p></div>
</div>

</div>

<div id="outline-container-8-70" class="outline-3">
<h3 id="sec-8-70">REMOVE-ITEM [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-70">


</div>

<div id="outline-container-8-70-1" class="outline-4">
<h4 id="sec-8-70-1">Arguments </h4>
<div class="outline-text-4" id="text-8-70-1">

<p>(ITEM)
</p></div>

</div>

<div id="outline-container-8-70-2" class="outline-4">
<h4 id="sec-8-70-2">Documentation </h4>
<div class="outline-text-4" id="text-8-70-2">

<p>Remove ITEM from the &lt;inventory&gt;.
Return ITEM if successful, nil otherwise.
</p></div>
</div>

</div>

<div id="outline-container-8-71" class="outline-3">
<h3 id="sec-8-71">REPLACE-ITEM-AT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-71">


</div>

<div id="outline-container-8-71-1" class="outline-4">
<h4 id="sec-8-71-1">Arguments </h4>
<div class="outline-text-4" id="text-8-71-1">

<p>(ITEM POS)
</p></div>

</div>

<div id="outline-container-8-71-2" class="outline-4">
<h4 id="sec-8-71-2">Documentation </h4>
<div class="outline-text-4" id="text-8-71-2">

<p>Replace the inventory item at position POS with ITEM.
</p></div>
</div>

</div>

<div id="outline-container-8-72" class="outline-3">
<h3 id="sec-8-72">RESOLVE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-72">


</div>

<div id="outline-container-8-72-1" class="outline-4">
<h4 id="sec-8-72-1">Arguments </h4>
<div class="outline-text-4" id="text-8-72-1">

<p>(REFERENCE &amp;OPTIONAL CATEGORY)
</p></div>

</div>

<div id="outline-container-8-72-2" class="outline-4">
<h4 id="sec-8-72-2">Documentation </h4>
<div class="outline-text-4" id="text-8-72-2">

<p>Accept a REFERENCE to a cell, and try to get the real cell.
The REFERENCE may be an object, one of the `*compass-directions*', an
equipment slot keyword, or an integer denoting the nth inventory
slot.
</p></div>
</div>

</div>

<div id="outline-container-8-73" class="outline-3">
<h3 id="sec-8-73">SAY [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-73">


</div>

<div id="outline-container-8-73-1" class="outline-4">
<h4 id="sec-8-73-1">Arguments </h4>
<div class="outline-text-4" id="text-8-73-1">

<p>(FORMAT-STRING &amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-8-73-2" class="outline-4">
<h4 id="sec-8-73-2">Documentation </h4>
<div class="outline-text-4" id="text-8-73-2">

<p>Print a string to the message narration window. Arguments
are as with `format'.
</p></div>
</div>

</div>

<div id="outline-container-8-74" class="outline-3">
<h3 id="sec-8-74">SCREEN-COORDINATES [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-74">


</div>

<div id="outline-container-8-74-1" class="outline-4">
<h4 id="sec-8-74-1">Arguments </h4>
<div class="outline-text-4" id="text-8-74-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-74-2" class="outline-4">
<h4 id="sec-8-74-2">Documentation </h4>
<div class="outline-text-4" id="text-8-74-2">

<p>Return as values X,Y the screen coordinates of CELL.
</p></div>
</div>

</div>

<div id="outline-container-8-75" class="outline-3">
<h3 id="sec-8-75">SELECT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-75">


</div>

<div id="outline-container-8-75-1" class="outline-4">
<h4 id="sec-8-75-1">Arguments </h4>
<div class="outline-text-4" id="text-8-75-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-8-76" class="outline-3">
<h3 id="sec-8-76">SET [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-76">


</div>

<div id="outline-container-8-76-1" class="outline-4">
<h4 id="sec-8-76-1">Arguments </h4>
<div class="outline-text-4" id="text-8-76-1">

<p>(DATA)
</p></div>
</div>

</div>

<div id="outline-container-8-77" class="outline-3">
<h3 id="sec-8-77">SET-CONTAINER [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-77">


</div>

<div id="outline-container-8-77-1" class="outline-4">
<h4 id="sec-8-77-1">Arguments </h4>
<div class="outline-text-4" id="text-8-77-1">

<p>(CONTAINER)
</p></div>

</div>

<div id="outline-container-8-77-2" class="outline-4">
<h4 id="sec-8-77-2">Documentation </h4>
<div class="outline-text-4" id="text-8-77-2">

<p>Set the container pointer of this cell to CONTAINER.
All contained cells maintain a pointer to their containers.
</p></div>
</div>

</div>

<div id="outline-container-8-78" class="outline-3">
<h3 id="sec-8-78">SET-LOCATION [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-78">


</div>

<div id="outline-container-8-78-1" class="outline-4">
<h4 id="sec-8-78-1">Arguments </h4>
<div class="outline-text-4" id="text-8-78-1">

<p>(R C)
</p></div>

</div>

<div id="outline-container-8-78-2" class="outline-4">
<h4 id="sec-8-78-2">Documentation </h4>
<div class="outline-text-4" id="text-8-78-2">

<p>Set the row R and column C of the cell.
</p></div>
</div>

</div>

<div id="outline-container-8-79" class="outline-3">
<h3 id="sec-8-79">START [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-79">


</div>

<div id="outline-container-8-79-1" class="outline-4">
<h4 id="sec-8-79-1">Arguments </h4>
<div class="outline-text-4" id="text-8-79-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-79-2" class="outline-4">
<h4 id="sec-8-79-2">Documentation </h4>
<div class="outline-text-4" id="text-8-79-2">

<p>This method is invoked on the player whenever entering a new world map.
</p></div>
</div>

</div>

<div id="outline-container-8-80" class="outline-3">
<h3 id="sec-8-80">STAT-EFFECT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-80">


</div>

<div id="outline-container-8-80-1" class="outline-4">
<h4 id="sec-8-80-1">Arguments </h4>
<div class="outline-text-4" id="text-8-80-1">

<p>(STAT-NAME VAL &amp;OPTIONAL (COMPONENT BASE) (CLAMPING T))
</p></div>

</div>

<div id="outline-container-8-80-2" class="outline-4">
<h4 id="sec-8-80-2">Documentation </h4>
<div class="outline-text-4" id="text-8-80-2">

<p>Add VAL, which may be negative, to the COMPONENT part of the stat
field named by STAT-NAME. The default is to change the :base value.
</p></div>
</div>

</div>

<div id="outline-container-8-81" class="outline-3">
<h3 id="sec-8-81">STAT-VALUE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-81">


</div>

<div id="outline-container-8-81-1" class="outline-4">
<h4 id="sec-8-81-1">Arguments </h4>
<div class="outline-text-4" id="text-8-81-1">

<p>(STAT-NAME &amp;OPTIONAL COMPONENT (CLAMPING T))
</p></div>

</div>

<div id="outline-container-8-81-2" class="outline-4">
<h4 id="sec-8-81-2">Documentation </h4>
<div class="outline-text-4" id="text-8-81-2">

<p>Compute the current value of the statistic in field STAT-NAME.
If a COMPONENT keyword is provided, return that component of the stat
instead of computing the value.
</p>
<p>
Characters and objects may have numeric-valued attributes like
Strength and Dexterity that have a minimum and maximum value
 (perhaps decided on the basis of class) as well as temporary and
permanent effects. In this case you want to store a base value,
minimum, maximum, and current delta, and compute the value at run
time.
</p>
<p>
Stats are just property lists with four different components: :base
:min :max and :delta.
</p></div>
</div>

</div>

<div id="outline-container-8-82" class="outline-3">
<h3 id="sec-8-82">STEP [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-82">


</div>

<div id="outline-container-8-82-1" class="outline-4">
<h4 id="sec-8-82-1">Arguments </h4>
<div class="outline-text-4" id="text-8-82-1">

<p>(STEPPER)
</p></div>

</div>

<div id="outline-container-8-82-2" class="outline-4">
<h4 id="sec-8-82-2">Documentation </h4>
<div class="outline-text-4" id="text-8-82-2">

<p>Respond to being stepped on by the STEPPER.
</p></div>
</div>

</div>

<div id="outline-container-8-83" class="outline-3">
<h3 id="sec-8-83">STEP-ON-CURRENT-SQUARE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-83">


</div>

<div id="outline-container-8-83-1" class="outline-4">
<h4 id="sec-8-83-1">Arguments </h4>
<div class="outline-text-4" id="text-8-83-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-83-2" class="outline-4">
<h4 id="sec-8-83-2">Documentation </h4>
<div class="outline-text-4" id="text-8-83-2">

<p>Send :step events to all the cells on the current square.
</p></div>
</div>

</div>

<div id="outline-container-8-84" class="outline-3">
<h3 id="sec-8-84">TAKE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-84">


</div>

<div id="outline-container-8-84-1" class="outline-4">
<h4 id="sec-8-84-1">Arguments </h4>
<div class="outline-text-4" id="text-8-84-1">

<p>(&amp;KEY (DIRECTION HERE) INDEX CATEGORY)
</p></div>

</div>

<div id="outline-container-8-84-2" class="outline-4">
<h4 id="sec-8-84-2">Documentation </h4>
<div class="outline-text-4" id="text-8-84-2">

<p>Take the item and return non-nil if successful.
</p></div>
</div>

</div>

<div id="outline-container-8-85" class="outline-3">
<h3 id="sec-8-85">UNPROXY [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-85">


</div>

<div id="outline-container-8-85-1" class="outline-4">
<h4 id="sec-8-85-1">Arguments </h4>
<div class="outline-text-4" id="text-8-85-1">

<p>(&amp;KEY DR DC DX DY)
</p></div>

</div>

<div id="outline-container-8-85-2" class="outline-4">
<h4 id="sec-8-85-2">Documentation </h4>
<div class="outline-text-4" id="text-8-85-2">

<p>Remove the occupant from this cell, dropping it on top.
</p></div>
</div>

</div>

<div id="outline-container-8-86" class="outline-3">
<h3 id="sec-8-86">USE [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-86">


</div>

<div id="outline-container-8-86-1" class="outline-4">
<h4 id="sec-8-86-1">Arguments </h4>
<div class="outline-text-4" id="text-8-86-1">

<p>(USER)
</p></div>

</div>

<div id="outline-container-8-86-2" class="outline-4">
<h4 id="sec-8-86-2">Documentation </h4>
<div class="outline-text-4" id="text-8-86-2">

<p>Return non-nil if cell is used up and should disappear.
</p></div>
</div>

</div>

<div id="outline-container-8-87" class="outline-3">
<h3 id="sec-8-87">VIEWPORT-COORDINATES [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-87">


</div>

<div id="outline-container-8-87-1" class="outline-4">
<h4 id="sec-8-87-1">Arguments </h4>
<div class="outline-text-4" id="text-8-87-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-87-2" class="outline-4">
<h4 id="sec-8-87-2">Documentation </h4>
<div class="outline-text-4" id="text-8-87-2">

<p>Return as values X,Y the world coordinates of CELL.
</p></div>
</div>

</div>

<div id="outline-container-8-88" class="outline-3">
<h3 id="sec-8-88">WEIGHT [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-88">


</div>

<div id="outline-container-8-88-1" class="outline-4">
<h4 id="sec-8-88-1">Arguments </h4>
<div class="outline-text-4" id="text-8-88-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-8-88-2" class="outline-4">
<h4 id="sec-8-88-2">Documentation </h4>
<div class="outline-text-4" id="text-8-88-2">

<p>Recursively calculate the weight of this cell.
</p></div>
</div>

</div>

<div id="outline-container-8-89" class="outline-3">
<h3 id="sec-8-89">XY-COORDINATES [CELL] (method) </h3>
<div class="outline-text-3" id="text-8-89">


</div>

<div id="outline-container-8-89-1" class="outline-4">
<h4 id="sec-8-89-1">Arguments </h4>
<div class="outline-text-4" id="text-8-89-1">

<p>NIL
</p></div>
</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">=COMMENT-CELL= (prototype) </h2>
<div class="outline-text-2" id="text-9">


</div>
