notebook/xe2-reference.html

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1">Parent prototype </h3>
<div class="outline-text-3" id="text-9-1">

<pre class="example">
=CELL=
</pre>


</div>

<div id="outline-container-9-1-1" class="outline-4">
<h4 id="sec-9-1-1">Fields </h4>
<div class="outline-text-4" id="text-9-1-1">


<ul>
<li id="sec-9-1-1-1">TYPE (field) <br/>
</li>
</ul>
<ul>
<li id="sec-9-1-1-2">AUTO-LOADOUT (field) <br/>
<ul>
<li id="sec-9-1-1-2-1">Documentation <br/>
When non-nil, the :loadout method is invoked upon entry into a world.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-3">TEAM (field) <br/>
<ul>
<li id="sec-9-1-1-3-1">Documentation <br/>
Keyword symbol of team, if any.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-4">WEIGHT (field) <br/>
<ul>
<li id="sec-9-1-1-4-1">Documentation <br/>
Recursively calculate the weight of this cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-5">WIDGET (field) <br/>
<ul>
<li id="sec-9-1-1-5-1">Documentation <br/>
XE2 widget object, if any.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-6">TILE (field) <br/>
<ul>
<li id="sec-9-1-1-6-1">Documentation <br/>
Resource name of image. 
When nil, the method DRAW is invoked instead of using a tile.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-7">RENDER-CELL (field) <br/>
<ul>
<li id="sec-9-1-1-7-1">Documentation <br/>
Subcell to render. See load-sprite-sheet-resource.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-8">ROW (field) <br/>
<ul>
<li id="sec-9-1-1-8-1">Documentation <br/>
When non-nil, the current row location of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-9">COLUMN (field) <br/>
<ul>
<li id="sec-9-1-1-9-1">Documentation <br/>
When non-nil, the current column of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-10">CATEGORIES (field) <br/>
<ul>
<li id="sec-9-1-1-10-1">Documentation <br/>
List of category keyword symbols
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-11">LIGHT-RADIUS (field) <br/>
<ul>
<li id="sec-9-1-1-11-1">Documentation <br/>
Strength of light cast by this object.
</li>
</ul>
<ul>
<li id="sec-9-1-1-11-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-12">MENU (field) <br/>
<ul>
<li id="sec-9-1-1-12-1">Documentation <br/>
Menu objects.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-13">SPEED (field) <br/>
<ul>
<li id="sec-9-1-1-13-1">Documentation <br/>
The number of action points alloted each phase.
</li>
</ul>
<ul>
<li id="sec-9-1-1-13-2">Initialization form <br/>
<pre class="example">
'(:BASE 10)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-14">PHASE-NUMBER (field) <br/>
<ul>
<li id="sec-9-1-1-14-1">Documentation <br/>
An integer giving the last phase this cell has completed.
</li>
</ul>
<ul>
<li id="sec-9-1-1-14-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-15">ACTION-POINTS (field) <br/>
<ul>
<li id="sec-9-1-1-15-1">Documentation <br/>
An integer giving the ability of a cell to take turns on a given round.
</li>
</ul>
<ul>
<li id="sec-9-1-1-15-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-16">DEFAULT-COST (field) <br/>
<ul>
<li id="sec-9-1-1-16-1">Documentation <br/>
Cost for basic actions.
</li>
</ul>
<ul>
<li id="sec-9-1-1-16-2">Initialization form <br/>
<pre class="example">
'(:BASE 5 :MIN NIL :MAX NIL :DELTA NIL)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-17">STEPPING (field) <br/>
<ul>
<li id="sec-9-1-1-17-1">Documentation <br/>
Whether to generate step events where you walk.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-18">MOVEMENT-COST (field) <br/>
<ul>
<li id="sec-9-1-1-18-1">Documentation <br/>
Base cost of moving one square.
</li>
</ul>
<ul>
<li id="sec-9-1-1-18-2">Initialization form <br/>
<pre class="example">
'(:BASE 10 :MIN NIL :MAX NIL :DELTA NIL)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-19">TOOLTIP (field) <br/>
<ul>
<li id="sec-9-1-1-19-1">Documentation <br/>
A formatted line giving dev help or information about the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-20">NAME (field) <br/>
<ul>
<li id="sec-9-1-1-20-1">Documentation <br/>
The name of this cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-21">DESCRIPTION (field) <br/>
<ul>
<li id="sec-9-1-1-21-1">Documentation <br/>
A description of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-22">UNKNOWN-NAME (field) <br/>
<ul>
<li id="sec-9-1-1-22-1">Documentation <br/>
The name of this cell, when it is unknown.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-23">UNKNOWN-DESCRIPTION (field) <br/>
<ul>
<li id="sec-9-1-1-23-1">Documentation <br/>
A description of the cell, when it is unknown.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-24">EQUIPMENT (field) <br/>
<ul>
<li id="sec-9-1-1-24-1">Documentation <br/>
Property list of :slot -&gt; cell pairs.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-25">EQUIPMENT-SLOTS (field) <br/>
<ul>
<li id="sec-9-1-1-25-1">Documentation <br/>
List of keyword symbols identifying available equipment slots.
</li>
</ul>
<ul>
<li id="sec-9-1-1-25-2">Initialization form <br/>
<pre class="example">
'(:HEAD :NECK :LEFT-HAND :RIGHT-HAND :HANDS :FEET :LEGS :TORSO :ARMS :PACK
</pre>

<p>    :BELT)
</p></li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-26">USING-SLOT (field) <br/>
<ul>
<li id="sec-9-1-1-26-1">Documentation <br/>
Keyword symbol of the currently selected equipment slot.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-27">ATTACKING-WITH (field) <br/>
<ul>
<li id="sec-9-1-1-27-1">Documentation <br/>
Keyword symbol of the currently selected weapon slot.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-28">FIRING-WITH (field) <br/>
<ul>
<li id="sec-9-1-1-28-1">Documentation <br/>
Keyword symbol of the currently selected firing weapon slot.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-29">EQUIP-FOR (field) <br/>
<ul>
<li id="sec-9-1-1-29-1">Documentation <br/>
List of keyword symbols showing where this item may be equipped.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-30">EQUIPPER (field) <br/>
<ul>
<li id="sec-9-1-1-30-1">Documentation <br/>
When non-nil, the character currently equipping this item.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-31">INVENTORY (field) <br/>
<ul>
<li id="sec-9-1-1-31-1">Documentation <br/>
The contents (if any) of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-32">MAX-WEIGHT (field) <br/>
<ul>
<li id="sec-9-1-1-32-1">Documentation <br/>
Maximum weight this container can hold.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-33">MAX-ITEMS (field) <br/>
<ul>
<li id="sec-9-1-1-33-1">Documentation <br/>
Maximum number of items this container can hold.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-34">PARENT-CONTAINER (field) <br/>
<ul>
<li id="sec-9-1-1-34-1">Documentation <br/>
Link to containing cell, if any.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-35">LABEL (field) <br/>
<ul>
<li id="sec-9-1-1-35-1">Documentation <br/>
Label (string or formatted line) to be used as display in forms.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-36">OCCUPANT (field) <br/>
<ul>
<li id="sec-9-1-1-36-1">Documentation <br/>
Occupant cell, used to implement drivable vehicles.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-37">PROXY (field) <br/>
<ul>
<li id="sec-9-1-1-37-1">Documentation <br/>
Make this cell a proxy for OCCUPANT.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-38">COMBINATION-AMOUNT (field) <br/>
<ul>
<li id="sec-9-1-1-38-1">Documentation <br/>
Amount of item this cell represents.
</li>
</ul>
<ul>
<li id="sec-9-1-1-38-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-39">COMBINATION-KEY (field) <br/>
<ul>
<li id="sec-9-1-1-39-1">Documentation <br/>
Only items matching this key will be combined.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-9-1-1-40">EXCLUDED-FIELDS (field) <br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2">COMPUTE [COMMENT-CELL] (method) </h3>
<div class="outline-text-3" id="text-9-2">


</div>

<div id="outline-container-9-2-1" class="outline-4">
<h4 id="sec-9-2-1">Arguments </h4>
<div class="outline-text-4" id="text-9-2-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3">GET [COMMENT-CELL] (method) </h3>
<div class="outline-text-3" id="text-9-3">


</div>

<div id="outline-container-9-3-1" class="outline-4">
<h4 id="sec-9-3-1">Arguments </h4>
<div class="outline-text-4" id="text-9-3-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4">INITIALIZE [COMMENT-CELL] (method) </h3>
<div class="outline-text-3" id="text-9-4">


</div>

<div id="outline-container-9-4-1" class="outline-4">
<h4 id="sec-9-4-1">Arguments </h4>
<div class="outline-text-4" id="text-9-4-1">

<p>(COMMENT)
</p></div>
</div>

</div>

<div id="outline-container-9-5" class="outline-3">
<h3 id="sec-9-5">SET [COMMENT-CELL] (method) </h3>
<div class="outline-text-3" id="text-9-5">


</div>

<div id="outline-container-9-5-1" class="outline-4">
<h4 id="sec-9-5-1">Arguments </h4>
<div class="outline-text-4" id="text-9-5-1">

<p>(COMMENT)
</p></div>
</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">=DATA-CELL= (prototype) </h2>
<div class="outline-text-2" id="text-10">


</div>
