notebook/xe2-reference.html

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1">Parent prototype </h3>
<div class="outline-text-3" id="text-11-1">

<pre class="example">
=CELL=
</pre>


</div>

<div id="outline-container-11-1-1" class="outline-4">
<h4 id="sec-11-1-1">Fields </h4>
<div class="outline-text-4" id="text-11-1-1">

<ul>
<li id="sec-11-1-1-1">EVENT (field) <br/>
</li>
</ul>
<ul>
<li id="sec-11-1-1-2">CAPTURING (field) <br/>
</li>
</ul>
<ul>
<li id="sec-11-1-1-3">TYPE (field) <br/>
</li>
</ul>
<ul>
<li id="sec-11-1-1-4">AUTO-LOADOUT (field) <br/>
<ul>
<li id="sec-11-1-1-4-1">Documentation <br/>
When non-nil, the :loadout method is invoked upon entry into a world.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-5">TEAM (field) <br/>
<ul>
<li id="sec-11-1-1-5-1">Documentation <br/>
Keyword symbol of team, if any.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-6">WEIGHT (field) <br/>
<ul>
<li id="sec-11-1-1-6-1">Documentation <br/>
Recursively calculate the weight of this cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-7">WIDGET (field) <br/>
<ul>
<li id="sec-11-1-1-7-1">Documentation <br/>
XE2 widget object, if any.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-8">TILE (field) <br/>
<ul>
<li id="sec-11-1-1-8-1">Documentation <br/>
Resource name of image. 
When nil, the method DRAW is invoked instead of using a tile.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-9">RENDER-CELL (field) <br/>
<ul>
<li id="sec-11-1-1-9-1">Documentation <br/>
Subcell to render. See load-sprite-sheet-resource.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-10">ROW (field) <br/>
<ul>
<li id="sec-11-1-1-10-1">Documentation <br/>
When non-nil, the current row location of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-11">COLUMN (field) <br/>
<ul>
<li id="sec-11-1-1-11-1">Documentation <br/>
When non-nil, the current column of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-12">CATEGORIES (field) <br/>
<ul>
<li id="sec-11-1-1-12-1">Documentation <br/>
List of category keyword symbols
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-13">LIGHT-RADIUS (field) <br/>
<ul>
<li id="sec-11-1-1-13-1">Documentation <br/>
Strength of light cast by this object.
</li>
</ul>
<ul>
<li id="sec-11-1-1-13-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-14">MENU (field) <br/>
<ul>
<li id="sec-11-1-1-14-1">Documentation <br/>
Menu objects.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-15">SPEED (field) <br/>
<ul>
<li id="sec-11-1-1-15-1">Documentation <br/>
The number of action points alloted each phase.
</li>
</ul>
<ul>
<li id="sec-11-1-1-15-2">Initialization form <br/>
<pre class="example">
'(:BASE 10)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-16">PHASE-NUMBER (field) <br/>
<ul>
<li id="sec-11-1-1-16-1">Documentation <br/>
An integer giving the last phase this cell has completed.
</li>
</ul>
<ul>
<li id="sec-11-1-1-16-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-17">ACTION-POINTS (field) <br/>
<ul>
<li id="sec-11-1-1-17-1">Documentation <br/>
An integer giving the ability of a cell to take turns on a given round.
</li>
</ul>
<ul>
<li id="sec-11-1-1-17-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-18">DEFAULT-COST (field) <br/>
<ul>
<li id="sec-11-1-1-18-1">Documentation <br/>
Cost for basic actions.
</li>
</ul>
<ul>
<li id="sec-11-1-1-18-2">Initialization form <br/>
<pre class="example">
'(:BASE 5 :MIN NIL :MAX NIL :DELTA NIL)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-19">STEPPING (field) <br/>
<ul>
<li id="sec-11-1-1-19-1">Documentation <br/>
Whether to generate step events where you walk.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-20">MOVEMENT-COST (field) <br/>
<ul>
<li id="sec-11-1-1-20-1">Documentation <br/>
Base cost of moving one square.
</li>
</ul>
<ul>
<li id="sec-11-1-1-20-2">Initialization form <br/>
<pre class="example">
'(:BASE 10 :MIN NIL :MAX NIL :DELTA NIL)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-21">TOOLTIP (field) <br/>
<ul>
<li id="sec-11-1-1-21-1">Documentation <br/>
A formatted line giving dev help or information about the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-22">NAME (field) <br/>
<ul>
<li id="sec-11-1-1-22-1">Documentation <br/>
The name of this cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-23">DESCRIPTION (field) <br/>
<ul>
<li id="sec-11-1-1-23-1">Documentation <br/>
A description of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-24">UNKNOWN-NAME (field) <br/>
<ul>
<li id="sec-11-1-1-24-1">Documentation <br/>
The name of this cell, when it is unknown.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-25">UNKNOWN-DESCRIPTION (field) <br/>
<ul>
<li id="sec-11-1-1-25-1">Documentation <br/>
A description of the cell, when it is unknown.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-26">EQUIPMENT (field) <br/>
<ul>
<li id="sec-11-1-1-26-1">Documentation <br/>
Property list of :slot -&gt; cell pairs.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-27">EQUIPMENT-SLOTS (field) <br/>
<ul>
<li id="sec-11-1-1-27-1">Documentation <br/>
List of keyword symbols identifying available equipment slots.
</li>
</ul>
<ul>
<li id="sec-11-1-1-27-2">Initialization form <br/>
<pre class="example">
'(:HEAD :NECK :LEFT-HAND :RIGHT-HAND :HANDS :FEET :LEGS :TORSO :ARMS :PACK
</pre>

<p>    :BELT)
</p></li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-28">USING-SLOT (field) <br/>
<ul>
<li id="sec-11-1-1-28-1">Documentation <br/>
Keyword symbol of the currently selected equipment slot.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-29">ATTACKING-WITH (field) <br/>
<ul>
<li id="sec-11-1-1-29-1">Documentation <br/>
Keyword symbol of the currently selected weapon slot.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-30">FIRING-WITH (field) <br/>
<ul>
<li id="sec-11-1-1-30-1">Documentation <br/>
Keyword symbol of the currently selected firing weapon slot.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-31">EQUIP-FOR (field) <br/>
<ul>
<li id="sec-11-1-1-31-1">Documentation <br/>
List of keyword symbols showing where this item may be equipped.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-32">EQUIPPER (field) <br/>
<ul>
<li id="sec-11-1-1-32-1">Documentation <br/>
When non-nil, the character currently equipping this item.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-33">INVENTORY (field) <br/>
<ul>
<li id="sec-11-1-1-33-1">Documentation <br/>
The contents (if any) of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-34">MAX-WEIGHT (field) <br/>
<ul>
<li id="sec-11-1-1-34-1">Documentation <br/>
Maximum weight this container can hold.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-35">MAX-ITEMS (field) <br/>
<ul>
<li id="sec-11-1-1-35-1">Documentation <br/>
Maximum number of items this container can hold.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-36">PARENT-CONTAINER (field) <br/>
<ul>
<li id="sec-11-1-1-36-1">Documentation <br/>
Link to containing cell, if any.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-37">LABEL (field) <br/>
<ul>
<li id="sec-11-1-1-37-1">Documentation <br/>
Label (string or formatted line) to be used as display in forms.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-38">OCCUPANT (field) <br/>
<ul>
<li id="sec-11-1-1-38-1">Documentation <br/>
Occupant cell, used to implement drivable vehicles.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-39">PROXY (field) <br/>
<ul>
<li id="sec-11-1-1-39-1">Documentation <br/>
Make this cell a proxy for OCCUPANT.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-40">COMBINATION-AMOUNT (field) <br/>
<ul>
<li id="sec-11-1-1-40-1">Documentation <br/>
Amount of item this cell represents.
</li>
</ul>
<ul>
<li id="sec-11-1-1-40-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-41">COMBINATION-KEY (field) <br/>
<ul>
<li id="sec-11-1-1-41-1">Documentation <br/>
Only items matching this key will be combined.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-11-1-1-42">EXCLUDED-FIELDS (field) <br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2">COMPUTE [EVENT-CELL] (method) </h3>
<div class="outline-text-3" id="text-11-2">


</div>

<div id="outline-container-11-2-1" class="outline-4">
<h4 id="sec-11-2-1">Arguments </h4>
<div class="outline-text-4" id="text-11-2-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-11-3" class="outline-3">
<h3 id="sec-11-3">GET [EVENT-CELL] (method) </h3>
<div class="outline-text-3" id="text-11-3">


</div>

<div id="outline-container-11-3-1" class="outline-4">
<h4 id="sec-11-3-1">Arguments </h4>
<div class="outline-text-4" id="text-11-3-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-11-4" class="outline-3">
<h3 id="sec-11-4">HANDLE-KEY [EVENT-CELL] (method) </h3>
<div class="outline-text-3" id="text-11-4">


</div>

<div id="outline-container-11-4-1" class="outline-4">
<h4 id="sec-11-4-1">Arguments </h4>
<div class="outline-text-4" id="text-11-4-1">

<p>(EVENT)
</p></div>
</div>

</div>

<div id="outline-container-11-5" class="outline-3">
<h3 id="sec-11-5">SELECT [EVENT-CELL] (method) </h3>
<div class="outline-text-3" id="text-11-5">


</div>

<div id="outline-container-11-5-1" class="outline-4">
<h4 id="sec-11-5-1">Arguments </h4>
<div class="outline-text-4" id="text-11-5-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-11-6" class="outline-3">
<h3 id="sec-11-6">SET [EVENT-CELL] (method) </h3>
<div class="outline-text-3" id="text-11-6">


</div>

<div id="outline-container-11-6-1" class="outline-4">
<h4 id="sec-11-6-1">Arguments </h4>
<div class="outline-text-4" id="text-11-6-1">

<p>(EVENT)
</p></div>
</div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">=FORM= (prototype) </h2>
<div class="outline-text-2" id="text-12">


</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1">Parent prototype </h3>
<div class="outline-text-3" id="text-12-1">

<pre class="example">
=WIDGET=
</pre>

</div>

</div>

<div id="outline-container-12-2" class="outline-3">
<h3 id="sec-12-2">Documentation </h3>
<div class="outline-text-3" id="text-12-2">

<p>An interactive graphical spreadsheet.
</p>
</div>

<div id="outline-container-12-2-1" class="outline-4">
<h4 id="sec-12-2-1">Fields </h4>
<div class="outline-text-4" id="text-12-2-1">

<ul>
<li id="sec-12-2-1-1">PAGE-NAME (field) <br/>
</li>
</ul>
<ul>
<li id="sec-12-2-1-2">WORLD (field) <br/>
<ul>
<li id="sec-12-2-1-2-1">Documentation <br/>
The xe2:=world= of objects to be displayed.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-3">ROWS (field) <br/>
</li>
</ul>
<ul>
<li id="sec-12-2-1-4">COLUMNS (field) <br/>
</li>
</ul>
<ul>
<li id="sec-12-2-1-5">ENTERED (field) <br/>
<ul>
<li id="sec-12-2-1-5-1">Documentation <br/>
When non-nil, forward key events to the entry and/or any attached widget.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-6">CURSOR-ROW (field) <br/>
</li>
</ul>
<ul>
<li id="sec-12-2-1-7">CURSOR-COLUMN (field) <br/>
</li>
</ul>
<ul>
<li id="sec-12-2-1-8">CURSOR-COLOR (field) <br/>
</li>
</ul>
<ul>
<li id="sec-12-2-1-9">ORIGIN-ROW (field) <br/>
<ul>
<li id="sec-12-2-1-9-1">Documentation <br/>
