notebook/xe2-reference.org
***** Documentation
Row number of top-left displayed cell.
***** Initialization form
: 0
**** ORIGIN-COLUMN (field)
***** Documentation
Column number of top-left displayed cell.
***** Initialization form
: 0
**** COLUMN-WIDTHS (field)
***** Documentation
A vector of integers where v[x] is the pixel width of form column x.
**** ROW-HEIGHTS (field)
***** Documentation
A vector of integers where v[x] is the pixel height of form row x.
**** COLUMN-STYLES (field)
***** Documentation
A vector of property lists used to customize the appearance of columns.
**** ROW-SPACING (field)
***** Documentation
Number of pixels to add between rows.
***** Initialization form
: 1
**** ZEBRA-STRIPES (field)
***** Documentation
When non-nil, zebra stripes are drawn.
**** ROW-STYLES (field)
***** Documentation
A vector of property lists used to customize the appearance of rows.
**** BORDER-STYLE (field)
***** Documentation
When non-nil, draw cell borders.
***** Initialization form
: T
**** DRAW-BLANKS (field)
***** Documentation
When non-nil, draw blank cells.
***** Initialization form
: T
**** HEADER-STYLE (field)
***** Documentation
When non-nil, draw row and column headers.
***** Initialization form
: T
**** HEADER-LINE (field)
***** Documentation
Formatted line to be displayed at top of window above spreadsheet.
**** STATUS-LINE (field)
***** Documentation
Formatted line to be displayed at top of window above spreadsheet.
**** SELECTED-TOOL (field)
***** Documentation
Keyword symbol identifying the method to be applied.
**** TOOL-DATA (field)
***** Documentation
Arguments for tool method invocation.
**** KEYMAP (field)
***** Documentation
A hash table mapping keylists to lambdas.
**** IMAGE (field)
***** Documentation
The offscreen image buffer containing the widget's rendered output.
**** WIDTH (field)
***** Documentation
The current allocated image width of the widget, in pixels.
**** HEIGHT (field)
***** Documentation
The current allocated image height of the widget, in pixels.
**** VISIBLE (field)
***** Documentation
The boolean visibility of the widget.
***** Initialization form
: T
**** X (field)
***** Documentation
The screen x-coordinate of the left side of the widget's display area.
**** Y (field)
***** Documentation
The screen y-coordinate of the top of the widget's display area.
** CELL-AT [FORM] (method)
*** Arguments
(ROW COLUMN)
** COLUMN-WIDTH [FORM] (method)
*** Arguments
(COLUMN)
** COMPUTE [FORM] (method)
*** Arguments
NIL
** COMPUTE-GEOMETRY [FORM] (method)
*** Arguments
NIL
** CURRENT-CELL [FORM] (method)
*** Arguments
NIL
** DRAW-CURSOR [FORM] (method)
*** Arguments
(X Y WIDTH HEIGHT)
** ENTER [FORM] (method)
*** Arguments
NIL
** EXIT [FORM] (method)
*** Arguments
NIL
** HANDLE-KEY [FORM] (method)
*** Arguments
(EVENT)
** INITIALIZE [FORM] (method)
*** Arguments
(&OPTIONAL (PAGE *DEFAULT-PAGE-NAME*))
** INSTALL-KEYBINDINGS [FORM] (method)
*** Arguments
NIL
** MOVE-CURSOR [FORM] (method)
*** Arguments
(DIRECTION)
** MOVE-CURSOR-DOWN [FORM] (method)
*** Arguments
NIL
** MOVE-CURSOR-LEFT [FORM] (method)
*** Arguments
NIL
** MOVE-CURSOR-RIGHT [FORM] (method)
*** Arguments
NIL
** MOVE-CURSOR-UP [FORM] (method)
*** Arguments
NIL
** RENDER [FORM] (method)
*** Arguments
NIL
** ROW-HEIGHT [FORM] (method)
*** Arguments
(ROW)
** SAY [FORM] (method)
*** Arguments
(TEXT)
** SELECT [FORM] (method)
*** Arguments
NIL
** VISIT [FORM] (method)
*** Arguments
(&OPTIONAL (PAGE *DEFAULT-PAGE-NAME*))
*** Documentation
Visit the page PAGE with the current form.
* =FORMATTER= (prototype)
** Parent prototype
: =WIDGET=
