notebook/xe2-reference.html
Row number of top-left displayed cell.
</li>
</ul>
<ul>
<li id="sec-12-2-1-9-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-10">ORIGIN-COLUMN (field) <br/>
<ul>
<li id="sec-12-2-1-10-1">Documentation <br/>
Column number of top-left displayed cell.
</li>
</ul>
<ul>
<li id="sec-12-2-1-10-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-11">COLUMN-WIDTHS (field) <br/>
<ul>
<li id="sec-12-2-1-11-1">Documentation <br/>
A vector of integers where v[x] is the pixel width of form column x.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-12">ROW-HEIGHTS (field) <br/>
<ul>
<li id="sec-12-2-1-12-1">Documentation <br/>
A vector of integers where v[x] is the pixel height of form row x.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-13">COLUMN-STYLES (field) <br/>
<ul>
<li id="sec-12-2-1-13-1">Documentation <br/>
A vector of property lists used to customize the appearance of columns.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-14">ROW-SPACING (field) <br/>
<ul>
<li id="sec-12-2-1-14-1">Documentation <br/>
Number of pixels to add between rows.
</li>
</ul>
<ul>
<li id="sec-12-2-1-14-2">Initialization form <br/>
<pre class="example">
1
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-15">ZEBRA-STRIPES (field) <br/>
<ul>
<li id="sec-12-2-1-15-1">Documentation <br/>
When non-nil, zebra stripes are drawn.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-16">ROW-STYLES (field) <br/>
<ul>
<li id="sec-12-2-1-16-1">Documentation <br/>
A vector of property lists used to customize the appearance of rows.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-17">BORDER-STYLE (field) <br/>
<ul>
<li id="sec-12-2-1-17-1">Documentation <br/>
When non-nil, draw cell borders.
</li>
</ul>
<ul>
<li id="sec-12-2-1-17-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-18">DRAW-BLANKS (field) <br/>
<ul>
<li id="sec-12-2-1-18-1">Documentation <br/>
When non-nil, draw blank cells.
</li>
</ul>
<ul>
<li id="sec-12-2-1-18-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-19">HEADER-STYLE (field) <br/>
<ul>
<li id="sec-12-2-1-19-1">Documentation <br/>
When non-nil, draw row and column headers.
</li>
</ul>
<ul>
<li id="sec-12-2-1-19-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-20">HEADER-LINE (field) <br/>
<ul>
<li id="sec-12-2-1-20-1">Documentation <br/>
Formatted line to be displayed at top of window above spreadsheet.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-21">STATUS-LINE (field) <br/>
<ul>
<li id="sec-12-2-1-21-1">Documentation <br/>
Formatted line to be displayed at top of window above spreadsheet.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-22">SELECTED-TOOL (field) <br/>
<ul>
<li id="sec-12-2-1-22-1">Documentation <br/>
Keyword symbol identifying the method to be applied.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-23">TOOL-DATA (field) <br/>
<ul>
<li id="sec-12-2-1-23-1">Documentation <br/>
Arguments for tool method invocation.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-24">KEYMAP (field) <br/>
<ul>
<li id="sec-12-2-1-24-1">Documentation <br/>
A hash table mapping keylists to lambdas.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-25">IMAGE (field) <br/>
<ul>
<li id="sec-12-2-1-25-1">Documentation <br/>
The offscreen image buffer containing the widget's rendered output.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-26">WIDTH (field) <br/>
<ul>
<li id="sec-12-2-1-26-1">Documentation <br/>
The current allocated image width of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-27">HEIGHT (field) <br/>
<ul>
<li id="sec-12-2-1-27-1">Documentation <br/>
The current allocated image height of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-28">VISIBLE (field) <br/>
<ul>
<li id="sec-12-2-1-28-1">Documentation <br/>
The boolean visibility of the widget.
</li>
</ul>
<ul>
<li id="sec-12-2-1-28-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-29">X (field) <br/>
<ul>
<li id="sec-12-2-1-29-1">Documentation <br/>
The screen x-coordinate of the left side of the widget's display area.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-12-2-1-30">Y (field) <br/>
<ul>
<li id="sec-12-2-1-30-1">Documentation <br/>
The screen y-coordinate of the top of the widget's display area.
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-12-3" class="outline-3">
<h3 id="sec-12-3">CELL-AT [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-3">


</div>

<div id="outline-container-12-3-1" class="outline-4">
<h4 id="sec-12-3-1">Arguments </h4>
<div class="outline-text-4" id="text-12-3-1">

<p>(ROW COLUMN)
</p></div>
</div>

</div>

<div id="outline-container-12-4" class="outline-3">
<h3 id="sec-12-4">COLUMN-WIDTH [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-4">


</div>

<div id="outline-container-12-4-1" class="outline-4">
<h4 id="sec-12-4-1">Arguments </h4>
<div class="outline-text-4" id="text-12-4-1">

<p>(COLUMN)
</p></div>
</div>

</div>

<div id="outline-container-12-5" class="outline-3">
<h3 id="sec-12-5">COMPUTE [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-5">


</div>

<div id="outline-container-12-5-1" class="outline-4">
<h4 id="sec-12-5-1">Arguments </h4>
<div class="outline-text-4" id="text-12-5-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-6" class="outline-3">
<h3 id="sec-12-6">COMPUTE-GEOMETRY [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-6">


</div>

<div id="outline-container-12-6-1" class="outline-4">
<h4 id="sec-12-6-1">Arguments </h4>
<div class="outline-text-4" id="text-12-6-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-7" class="outline-3">
<h3 id="sec-12-7">CURRENT-CELL [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-7">


</div>

<div id="outline-container-12-7-1" class="outline-4">
<h4 id="sec-12-7-1">Arguments </h4>
<div class="outline-text-4" id="text-12-7-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-8" class="outline-3">
<h3 id="sec-12-8">DRAW-CURSOR [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-8">


</div>

<div id="outline-container-12-8-1" class="outline-4">
<h4 id="sec-12-8-1">Arguments </h4>
<div class="outline-text-4" id="text-12-8-1">

<p>(X Y WIDTH HEIGHT)
</p></div>
</div>

</div>

<div id="outline-container-12-9" class="outline-3">
<h3 id="sec-12-9">ENTER [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-9">


</div>

<div id="outline-container-12-9-1" class="outline-4">
<h4 id="sec-12-9-1">Arguments </h4>
<div class="outline-text-4" id="text-12-9-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-10" class="outline-3">
<h3 id="sec-12-10">EXIT [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-10">


</div>

<div id="outline-container-12-10-1" class="outline-4">
<h4 id="sec-12-10-1">Arguments </h4>
<div class="outline-text-4" id="text-12-10-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-11" class="outline-3">
<h3 id="sec-12-11">HANDLE-KEY [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-11">


</div>

<div id="outline-container-12-11-1" class="outline-4">
<h4 id="sec-12-11-1">Arguments </h4>
<div class="outline-text-4" id="text-12-11-1">

<p>(EVENT)
</p></div>
</div>

</div>

<div id="outline-container-12-12" class="outline-3">
<h3 id="sec-12-12">INITIALIZE [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-12">


</div>

<div id="outline-container-12-12-1" class="outline-4">
<h4 id="sec-12-12-1">Arguments </h4>
<div class="outline-text-4" id="text-12-12-1">

<p>(&amp;OPTIONAL (PAGE *DEFAULT-PAGE-NAME*))
</p></div>
</div>

</div>

<div id="outline-container-12-13" class="outline-3">
<h3 id="sec-12-13">INSTALL-KEYBINDINGS [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-13">


</div>

<div id="outline-container-12-13-1" class="outline-4">
<h4 id="sec-12-13-1">Arguments </h4>
<div class="outline-text-4" id="text-12-13-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-14" class="outline-3">
<h3 id="sec-12-14">MOVE-CURSOR [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-14">


</div>

<div id="outline-container-12-14-1" class="outline-4">
<h4 id="sec-12-14-1">Arguments </h4>
<div class="outline-text-4" id="text-12-14-1">

<p>(DIRECTION)
</p></div>
</div>

</div>

<div id="outline-container-12-15" class="outline-3">
<h3 id="sec-12-15">MOVE-CURSOR-DOWN [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-15">


</div>

<div id="outline-container-12-15-1" class="outline-4">
<h4 id="sec-12-15-1">Arguments </h4>
<div class="outline-text-4" id="text-12-15-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-16" class="outline-3">
<h3 id="sec-12-16">MOVE-CURSOR-LEFT [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-16">


</div>

<div id="outline-container-12-16-1" class="outline-4">
<h4 id="sec-12-16-1">Arguments </h4>
<div class="outline-text-4" id="text-12-16-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-17" class="outline-3">
<h3 id="sec-12-17">MOVE-CURSOR-RIGHT [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-17">


</div>

<div id="outline-container-12-17-1" class="outline-4">
<h4 id="sec-12-17-1">Arguments </h4>
<div class="outline-text-4" id="text-12-17-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-18" class="outline-3">
<h3 id="sec-12-18">MOVE-CURSOR-UP [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-18">


</div>

<div id="outline-container-12-18-1" class="outline-4">
<h4 id="sec-12-18-1">Arguments </h4>
<div class="outline-text-4" id="text-12-18-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-19" class="outline-3">
<h3 id="sec-12-19">RENDER [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-19">


</div>

<div id="outline-container-12-19-1" class="outline-4">
<h4 id="sec-12-19-1">Arguments </h4>
<div class="outline-text-4" id="text-12-19-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-20" class="outline-3">
<h3 id="sec-12-20">ROW-HEIGHT [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-20">


</div>

<div id="outline-container-12-20-1" class="outline-4">
<h4 id="sec-12-20-1">Arguments </h4>
<div class="outline-text-4" id="text-12-20-1">

<p>(ROW)
</p></div>
</div>

</div>

<div id="outline-container-12-21" class="outline-3">
<h3 id="sec-12-21">SAY [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-21">


</div>

<div id="outline-container-12-21-1" class="outline-4">
<h4 id="sec-12-21-1">Arguments </h4>
<div class="outline-text-4" id="text-12-21-1">

<p>(TEXT)
</p></div>
</div>

</div>

<div id="outline-container-12-22" class="outline-3">
<h3 id="sec-12-22">SELECT [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-22">


</div>

<div id="outline-container-12-22-1" class="outline-4">
<h4 id="sec-12-22-1">Arguments </h4>
<div class="outline-text-4" id="text-12-22-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-12-23" class="outline-3">
<h3 id="sec-12-23">VISIT [FORM] (method) </h3>
<div class="outline-text-3" id="text-12-23">


</div>

<div id="outline-container-12-23-1" class="outline-4">
<h4 id="sec-12-23-1">Arguments </h4>
<div class="outline-text-4" id="text-12-23-1">

<p>(&amp;OPTIONAL (PAGE *DEFAULT-PAGE-NAME*))
</p></div>

</div>

<div id="outline-container-12-23-2" class="outline-4">
<h4 id="sec-12-23-2">Documentation </h4>
<div class="outline-text-4" id="text-12-23-2">

<p>Visit the page PAGE with the current form.
</p></div>
</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">=FORMATTER= (prototype) </h2>
<div class="outline-text-2" id="text-13">


</div>
