notebook/xe2-reference.html

<div id="outline-container-13-1" class="outline-3">
<h3 id="sec-13-1">Parent prototype </h3>
<div class="outline-text-3" id="text-13-1">

<pre class="example">
=WIDGET=
</pre>

</div>

</div>

<div id="outline-container-13-2" class="outline-3">
<h3 id="sec-13-2">Documentation </h3>
<div class="outline-text-3" id="text-13-2">

<p>=FORMATTER= is a simple output formatting widget for the
presentation of messages and other in-game data. Foreground and
background colors are supported, as well as displaying images
in-line with text of different fonts.
</p>
<p>
A formatted line is a list of formatted strings. A formatted 
string is a cons of (STRING . PROPERTIES), where the keys in
PROPERTIES are chosen from:
</p>
<ul>
<li>:FOREGROUND &mdash; Foreground color. A color resource name.
</li>
<li>:BACKGROUND &mdash; Background color. A color resource name.
</li>
<li>:IMAGE &mdash; Image to be displayed instead of STRING.
      If this is a string, the corresponding resource image is 
      found and displayed. If this is an image object, the image 
      itself is displayed.
</li>
<li>:WIDTH &mdash; Occupy this pixel width if set to an integer.
</li>
<li>:FONT &mdash;  Font name. Defaults to *default-font*.
</li>
</ul>


</div>

<div id="outline-container-13-2-1" class="outline-4">
<h4 id="sec-13-2-1">Fields </h4>
<div class="outline-text-4" id="text-13-2-1">

<ul>
<li id="sec-13-2-1-1">LINES (field) <br/>
<ul>
<li id="sec-13-2-1-1-1">Documentation <br/>
Vector of lines.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-13-2-1-2">CURRENT-LINE (field) <br/>
<ul>
<li id="sec-13-2-1-2-1">Documentation <br/>
Formatted line currently being composed.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-13-2-1-3">KEYMAP (field) <br/>
<ul>
<li id="sec-13-2-1-3-1">Documentation <br/>
A hash table mapping keylists to lambdas.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-13-2-1-4">IMAGE (field) <br/>
<ul>
<li id="sec-13-2-1-4-1">Documentation <br/>
The offscreen image buffer containing the widget's rendered output.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-13-2-1-5">WIDTH (field) <br/>
<ul>
<li id="sec-13-2-1-5-1">Documentation <br/>
The current allocated image width of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-13-2-1-6">HEIGHT (field) <br/>
<ul>
<li id="sec-13-2-1-6-1">Documentation <br/>
The current allocated image height of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-13-2-1-7">VISIBLE (field) <br/>
<ul>
<li id="sec-13-2-1-7-1">Documentation <br/>
The boolean visibility of the widget.
</li>
</ul>
<ul>
<li id="sec-13-2-1-7-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-13-2-1-8">X (field) <br/>
<ul>
<li id="sec-13-2-1-8-1">Documentation <br/>
The screen x-coordinate of the left side of the widget's display area.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-13-2-1-9">Y (field) <br/>
<ul>
<li id="sec-13-2-1-9-1">Documentation <br/>
The screen y-coordinate of the top of the widget's display area.
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-13-3" class="outline-3">
<h3 id="sec-13-3">DELETE-ALL-LINES [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-3">


</div>

<div id="outline-container-13-3-1" class="outline-4">
<h4 id="sec-13-3-1">Arguments </h4>
<div class="outline-text-4" id="text-13-3-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-13-4" class="outline-3">
<h3 id="sec-13-4">DELETE-LINE [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-4">


</div>

<div id="outline-container-13-4-1" class="outline-4">
<h4 id="sec-13-4-1">Arguments </h4>
<div class="outline-text-4" id="text-13-4-1">

<p>(&amp;OPTIONAL (NUM-LINES 1))
</p></div>
</div>

</div>

<div id="outline-container-13-5" class="outline-3">
<h3 id="sec-13-5">INITIALIZE [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-5">


</div>

<div id="outline-container-13-5-1" class="outline-4">
<h4 id="sec-13-5-1">Arguments </h4>
<div class="outline-text-4" id="text-13-5-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-13-6" class="outline-3">
<h3 id="sec-13-6">NEWLINE [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-6">


</div>

<div id="outline-container-13-6-1" class="outline-4">
<h4 id="sec-13-6-1">Arguments </h4>
<div class="outline-text-4" id="text-13-6-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-13-6-2" class="outline-4">
<h4 id="sec-13-6-2">Documentation </h4>
<div class="outline-text-4" id="text-13-6-2">

<p>Add the current line to the display, and start a fresh offscreen
line.
</p></div>
</div>

</div>

<div id="outline-container-13-7" class="outline-3">
<h3 id="sec-13-7">PRINT [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-7">


</div>

<div id="outline-container-13-7-1" class="outline-4">
<h4 id="sec-13-7-1">Arguments </h4>
<div class="outline-text-4" id="text-13-7-1">

<p>(STRING &amp;REST KEYS &amp;KEY IMAGE FOREGROUND BACKGROUND FONT)
</p></div>

</div>

<div id="outline-container-13-7-2" class="outline-4">
<h4 id="sec-13-7-2">Documentation </h4>
<div class="outline-text-4" id="text-13-7-2">

<p>Add a formatted STRING to the end of the current line.
Example: [print my-formatter "hello" :foreground "red"]
</p></div>
</div>

</div>

<div id="outline-container-13-8" class="outline-3">
<h3 id="sec-13-8">PRINT-FORMATTED-STRING [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-8">


</div>

<div id="outline-container-13-8-1" class="outline-4">
<h4 id="sec-13-8-1">Arguments </h4>
<div class="outline-text-4" id="text-13-8-1">

<p>(FORMATTED-STRING)
</p></div>
</div>

</div>

<div id="outline-container-13-9" class="outline-3">
<h3 id="sec-13-9">PRINT-IMAGE [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-9">


</div>

<div id="outline-container-13-9-1" class="outline-4">
<h4 id="sec-13-9-1">Arguments </h4>
<div class="outline-text-4" id="text-13-9-1">

<p>(IMAGE)
</p></div>
</div>

</div>

<div id="outline-container-13-10" class="outline-3">
<h3 id="sec-13-10">PRINT-OBJECT-TAG [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-10">


</div>

<div id="outline-container-13-10-1" class="outline-4">
<h4 id="sec-13-10-1">Arguments </h4>
<div class="outline-text-4" id="text-13-10-1">

<p>(OB)
</p></div>
</div>

</div>

<div id="outline-container-13-11" class="outline-3">
<h3 id="sec-13-11">PRINT-SEPARATOR [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-11">


</div>

<div id="outline-container-13-11-1" class="outline-4">
<h4 id="sec-13-11-1">Arguments </h4>
<div class="outline-text-4" id="text-13-11-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-13-12" class="outline-3">
<h3 id="sec-13-12">PRINTLN [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-12">


</div>

<div id="outline-container-13-12-1" class="outline-4">
<h4 id="sec-13-12-1">Arguments </h4>
<div class="outline-text-4" id="text-13-12-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-13-12-2" class="outline-4">
<h4 id="sec-13-12-2">Documentation </h4>
<div class="outline-text-4" id="text-13-12-2">

<p>Print the ARGS as a formatted string, following up with a newline.
</p></div>
</div>

</div>

<div id="outline-container-13-13" class="outline-3">
<h3 id="sec-13-13">RENDER [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-13">


</div>

<div id="outline-container-13-13-1" class="outline-4">
<h4 id="sec-13-13-1">Arguments </h4>
<div class="outline-text-4" id="text-13-13-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-13-14" class="outline-3">
<h3 id="sec-13-14">RESET-LINES [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-14">


</div>

<div id="outline-container-13-14-1" class="outline-4">
<h4 id="sec-13-14-1">Arguments </h4>
<div class="outline-text-4" id="text-13-14-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-13-15" class="outline-3">
<h3 id="sec-13-15">SPACE [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-15">


</div>

<div id="outline-container-13-15-1" class="outline-4">
<h4 id="sec-13-15-1">Arguments </h4>
<div class="outline-text-4" id="text-13-15-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-13-16" class="outline-3">
<h3 id="sec-13-16">UPDATE [FORMATTER] (method) </h3>
<div class="outline-text-3" id="text-13-16">


</div>

<div id="outline-container-13-16-1" class="outline-4">
<h4 id="sec-13-16-1">Arguments </h4>
<div class="outline-text-4" id="text-13-16-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-13-16-2" class="outline-4">
<h4 id="sec-13-16-2">Documentation </h4>
<div class="outline-text-4" id="text-13-16-2">

<p>Invoked before each render. Replace this method for custom
auto-updated displays.
</p></div>
</div>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14">=GATEWAY= (prototype) </h2>
<div class="outline-text-2" id="text-14">


</div>
