notebook/xe2-reference.org
**** STROKE-COLOR (field)
**** BACKGROUND-COLOR (field)
**** TIMEOUT (field)
**** TYPE (field)
**** AUTO-LOADOUT (field)
***** Documentation
When non-nil, the :loadout method is invoked upon entry into a world.
**** TEAM (field)
***** Documentation
Keyword symbol of team, if any.
**** WEIGHT (field)
***** Documentation
Recursively calculate the weight of this cell.
**** WIDGET (field)
***** Documentation
XE2 widget object, if any.
**** TILE (field)
***** Documentation
Resource name of image. 
When nil, the method DRAW is invoked instead of using a tile.
**** RENDER-CELL (field)
***** Documentation
Subcell to render. See load-sprite-sheet-resource.
**** ROW (field)
***** Documentation
When non-nil, the current row location of the cell.
**** COLUMN (field)
***** Documentation
When non-nil, the current column of the cell.
**** CATEGORIES (field)
***** Documentation
List of category keyword symbols
**** LIGHT-RADIUS (field)
***** Documentation
Strength of light cast by this object.
***** Initialization form
: 0
**** MENU (field)
***** Documentation
Menu objects.
**** SPEED (field)
***** Documentation
The number of action points alloted each phase.
***** Initialization form
: '(:BASE 10)
**** PHASE-NUMBER (field)
***** Documentation
An integer giving the last phase this cell has completed.
***** Initialization form
: 0
**** ACTION-POINTS (field)
***** Documentation
An integer giving the ability of a cell to take turns on a given round.
***** Initialization form
: 0
**** DEFAULT-COST (field)
***** Documentation
Cost for basic actions.
***** Initialization form
: '(:BASE 5 :MIN NIL :MAX NIL :DELTA NIL)
**** STEPPING (field)
***** Documentation
Whether to generate step events where you walk.
**** MOVEMENT-COST (field)
***** Documentation
Base cost of moving one square.
***** Initialization form
: '(:BASE 10 :MIN NIL :MAX NIL :DELTA NIL)
**** TOOLTIP (field)
***** Documentation
A formatted line giving dev help or information about the cell.
**** NAME (field)
***** Documentation
The name of this cell.
**** DESCRIPTION (field)
***** Documentation
A description of the cell.
**** UNKNOWN-NAME (field)
***** Documentation
The name of this cell, when it is unknown.
**** UNKNOWN-DESCRIPTION (field)
***** Documentation
A description of the cell, when it is unknown.
**** EQUIPMENT (field)
***** Documentation
Property list of :slot -> cell pairs.
**** EQUIPMENT-SLOTS (field)
***** Documentation
List of keyword symbols identifying available equipment slots.
***** Initialization form
: '(:HEAD :NECK :LEFT-HAND :RIGHT-HAND :HANDS :FEET :LEGS :TORSO :ARMS :PACK
    :BELT)
**** USING-SLOT (field)
***** Documentation
Keyword symbol of the currently selected equipment slot.
**** ATTACKING-WITH (field)
***** Documentation
Keyword symbol of the currently selected weapon slot.
**** FIRING-WITH (field)
***** Documentation
Keyword symbol of the currently selected firing weapon slot.
**** EQUIP-FOR (field)
***** Documentation
List of keyword symbols showing where this item may be equipped.
**** EQUIPPER (field)
***** Documentation
When non-nil, the character currently equipping this item.
**** INVENTORY (field)
***** Documentation
The contents (if any) of the cell.
**** MAX-WEIGHT (field)
***** Documentation
Maximum weight this container can hold.
**** MAX-ITEMS (field)
***** Documentation
Maximum number of items this container can hold.
**** PARENT-CONTAINER (field)
***** Documentation
Link to containing cell, if any.
**** LABEL (field)
***** Documentation
Label (string or formatted line) to be used as display in forms.
**** OCCUPANT (field)
***** Documentation
Occupant cell, used to implement drivable vehicles.
**** PROXY (field)
***** Documentation
Make this cell a proxy for OCCUPANT.
**** COMBINATION-AMOUNT (field)
***** Documentation
Amount of item this cell represents.
***** Initialization form
: 0
**** COMBINATION-KEY (field)
***** Documentation
Only items matching this key will be combined.
**** EXCLUDED-FIELDS (field)
** DRAW [LABEL] (method)
*** Arguments
(X Y IMAGE)
** INITIALIZE [LABEL] (method)
*** Arguments
(&KEY TEXT (STROKE-COLOR .white) (BACKGROUND-COLOR .gray30) (STYLE LABEL)
 (TIMEOUT NIL) NAME TILE DESCRIPTION)
** RUN [LABEL] (method)
*** Arguments
NIL
* =LAUNCHPAD= (prototype)
** Parent prototype
: =GATEWAY=
*** Fields
**** TILE (field)
**** CATEGORIES (field)
**** DESCRIPTION (field)
**** TILE (field)
**** NAME (field)
**** CATEGORIES (field)
**** ADDRESS (field)
**** TYPE (field)
**** AUTO-LOADOUT (field)
***** Documentation
When non-nil, the :loadout method is invoked upon entry into a world.
**** TEAM (field)
***** Documentation
Keyword symbol of team, if any.
**** WEIGHT (field)
***** Documentation
Recursively calculate the weight of this cell.
**** WIDGET (field)
***** Documentation
XE2 widget object, if any.
**** TILE (field)
***** Documentation
Resource name of image. 
When nil, the method DRAW is invoked instead of using a tile.
**** RENDER-CELL (field)
***** Documentation
Subcell to render. See load-sprite-sheet-resource.
**** ROW (field)
***** Documentation
When non-nil, the current row location of the cell.
**** COLUMN (field)
***** Documentation
When non-nil, the current column of the cell.
**** CATEGORIES (field)
***** Documentation
List of category keyword symbols
**** LIGHT-RADIUS (field)
***** Documentation
Strength of light cast by this object.
***** Initialization form
: 0
**** MENU (field)
***** Documentation
Menu objects.
**** SPEED (field)
***** Documentation
The number of action points alloted each phase.
***** Initialization form
: '(:BASE 10)
**** PHASE-NUMBER (field)
***** Documentation
An integer giving the last phase this cell has completed.
***** Initialization form
: 0
**** ACTION-POINTS (field)
***** Documentation
An integer giving the ability of a cell to take turns on a given round.
***** Initialization form
: 0
**** DEFAULT-COST (field)
***** Documentation
Cost for basic actions.
***** Initialization form
: '(:BASE 5 :MIN NIL :MAX NIL :DELTA NIL)
**** STEPPING (field)
***** Documentation
Whether to generate step events where you walk.
**** MOVEMENT-COST (field)
***** Documentation
Base cost of moving one square.
***** Initialization form
: '(:BASE 10 :MIN NIL :MAX NIL :DELTA NIL)
**** TOOLTIP (field)
***** Documentation
A formatted line giving dev help or information about the cell.
**** NAME (field)
***** Documentation
The name of this cell.
