notebook/xe2-reference.org
**** BORDER-COLOR (field)
**** WORLD (field)
***** Documentation
The world object to be displayed.
**** OVERLAYS (field)
***** Documentation
List of closures.
**** USE-OVERLAYS (field)
**** PENDING-DRAWS (field)
**** MARGIN (field)
***** Documentation
Scroll margin.
***** Initialization form
: 6
**** ORIGIN-X (field)
***** Documentation
The world x-coordinate of the tile at the viewport's origin.
***** Initialization form
: 0
**** ORIGIN-Y (field)
***** Documentation
The world y-coordinate of the tile at the viewport's origin.
***** Initialization form
: 0
**** ORIGIN-WIDTH (field)
***** Documentation
The width in tiles of the viewport.
***** Initialization form
: 10
**** ORIGIN-HEIGHT (field)
***** Documentation
The height in tiles of the viewport.
***** Initialization form
: 10
**** TILE-SIZE (field)
***** Documentation
Size in pixels of a tile. They must be square.
***** Initialization form
: 16
**** EXCLUDED-FIELDS (field)
**** KEYMAP (field)
***** Documentation
A hash table mapping keylists to lambdas.
**** IMAGE (field)
***** Documentation
The offscreen image buffer containing the widget's rendered output.
**** WIDTH (field)
***** Documentation
The current allocated image width of the widget, in pixels.
**** HEIGHT (field)
***** Documentation
The current allocated image height of the widget, in pixels.
**** VISIBLE (field)
***** Documentation
The boolean visibility of the widget.
***** Initialization form
: T
**** X (field)
***** Documentation
The screen x-coordinate of the left side of the widget's display area.
**** Y (field)
***** Documentation
The screen y-coordinate of the top of the widget's display area.
** HIT [MINIMAP] (method)
*** Arguments
(X Y)
** RENDER [MINIMAP] (method)
*** Arguments
NIL
** SELECT [MINIMAP] (method)
*** Arguments
NIL
* =NARRATOR= (prototype)
** Parent prototype
: =FORMATTER=
*** Fields
**** VERBOSITY (field)
***** Documentation
Integer between 0 and 3 (inclusive).
***** Initialization form
: 0
**** PASSIVE-VOICE-ACTIONS (field)
***** Documentation
List of action words to use passive voice in narrating.
http://en.wikipedia.org/wiki/Passive_voice
**** REPEAT-COUNT (field)
**** LAST-LINE (field)
**** LINE-NUMBER (field)
**** LINES (field)
***** Documentation
Vector of lines.
**** CURRENT-LINE (field)
***** Documentation
Formatted line currently being composed.
**** KEYMAP (field)
***** Documentation
A hash table mapping keylists to lambdas.
**** IMAGE (field)
***** Documentation
The offscreen image buffer containing the widget's rendered output.
**** WIDTH (field)
***** Documentation
The current allocated image width of the widget, in pixels.
**** HEIGHT (field)
***** Documentation
The current allocated image height of the widget, in pixels.
**** VISIBLE (field)
***** Documentation
The boolean visibility of the widget.
***** Initialization form
: T
**** X (field)
***** Documentation
The screen x-coordinate of the left side of the widget's display area.
**** Y (field)
***** Documentation
The screen y-coordinate of the top of the widget's display area.
** NARRATE [NARRATOR] (method)
*** Arguments
(CONTROL-STRING &REST ARGS)
** NARRATE-MESSAGE [NARRATOR] (method)
*** Arguments
(SENDER ACTION RECEIVER ARGS &OPTIONAL FORCE)
** NARRATELN [NARRATOR] (method)
*** Arguments
(CONTROL-STRING &REST ARGS)
** SAY [NARRATOR] (method)
*** Arguments
(CONTROL-STRING &REST ARGS)
** SET-VERBOSITY [NARRATOR] (method)
*** Arguments
(&OPTIONAL (VALUE 1))
* =PAGER= (prototype)
** Parent prototype
: =WIDGET=
*** Fields
**** PAGES (field)
**** CURRENT-PAGE (field)
***** Documentation
Keyword name of current page.
**** PAGER-MESSAGE (field)
***** Documentation
Formatted string to be displayed to right of tabs.
**** PAGER-HEIGHT (field)
***** Documentation
Height in pixels of the pager
***** Initialization form
: 20
**** BACKGROUND-COLOR (field)
**** PREFIX-STRING (field)
**** NUMBER-SEPARATOR-STRING (field)
**** SEPARATOR-STRING (field)
**** STYLE (field)
***** Documentation
Text style properties for pager display
***** Initialization form
: '(:FOREGROUND ".gray60")
**** HIGHLIGHTED-STYLE (field)
