notebook/xe2-reference.html
<li id="sec-18-1-1-3">BORDER-COLOR (field) <br/>
</li>
</ul>
<ul>
<li id="sec-18-1-1-4">WORLD (field) <br/>
<ul>
<li id="sec-18-1-1-4-1">Documentation <br/>
The world object to be displayed.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-5">OVERLAYS (field) <br/>
<ul>
<li id="sec-18-1-1-5-1">Documentation <br/>
List of closures.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-6">USE-OVERLAYS (field) <br/>
</li>
</ul>
<ul>
<li id="sec-18-1-1-7">PENDING-DRAWS (field) <br/>
</li>
</ul>
<ul>
<li id="sec-18-1-1-8">MARGIN (field) <br/>
<ul>
<li id="sec-18-1-1-8-1">Documentation <br/>
Scroll margin.
</li>
</ul>
<ul>
<li id="sec-18-1-1-8-2">Initialization form <br/>
<pre class="example">
6
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-9">ORIGIN-X (field) <br/>
<ul>
<li id="sec-18-1-1-9-1">Documentation <br/>
The world x-coordinate of the tile at the viewport's origin.
</li>
</ul>
<ul>
<li id="sec-18-1-1-9-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-10">ORIGIN-Y (field) <br/>
<ul>
<li id="sec-18-1-1-10-1">Documentation <br/>
The world y-coordinate of the tile at the viewport's origin.
</li>
</ul>
<ul>
<li id="sec-18-1-1-10-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-11">ORIGIN-WIDTH (field) <br/>
<ul>
<li id="sec-18-1-1-11-1">Documentation <br/>
The width in tiles of the viewport.
</li>
</ul>
<ul>
<li id="sec-18-1-1-11-2">Initialization form <br/>
<pre class="example">
10
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-12">ORIGIN-HEIGHT (field) <br/>
<ul>
<li id="sec-18-1-1-12-1">Documentation <br/>
The height in tiles of the viewport.
</li>
</ul>
<ul>
<li id="sec-18-1-1-12-2">Initialization form <br/>
<pre class="example">
10
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-13">TILE-SIZE (field) <br/>
<ul>
<li id="sec-18-1-1-13-1">Documentation <br/>
Size in pixels of a tile. They must be square.
</li>
</ul>
<ul>
<li id="sec-18-1-1-13-2">Initialization form <br/>
<pre class="example">
16
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-14">EXCLUDED-FIELDS (field) <br/>
</li>
</ul>
<ul>
<li id="sec-18-1-1-15">KEYMAP (field) <br/>
<ul>
<li id="sec-18-1-1-15-1">Documentation <br/>
A hash table mapping keylists to lambdas.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-16">IMAGE (field) <br/>
<ul>
<li id="sec-18-1-1-16-1">Documentation <br/>
The offscreen image buffer containing the widget's rendered output.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-17">WIDTH (field) <br/>
<ul>
<li id="sec-18-1-1-17-1">Documentation <br/>
The current allocated image width of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-18">HEIGHT (field) <br/>
<ul>
<li id="sec-18-1-1-18-1">Documentation <br/>
The current allocated image height of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-19">VISIBLE (field) <br/>
<ul>
<li id="sec-18-1-1-19-1">Documentation <br/>
The boolean visibility of the widget.
</li>
</ul>
<ul>
<li id="sec-18-1-1-19-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-20">X (field) <br/>
<ul>
<li id="sec-18-1-1-20-1">Documentation <br/>
The screen x-coordinate of the left side of the widget's display area.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-18-1-1-21">Y (field) <br/>
<ul>
<li id="sec-18-1-1-21-1">Documentation <br/>
The screen y-coordinate of the top of the widget's display area.
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-18-2" class="outline-3">
<h3 id="sec-18-2">HIT [MINIMAP] (method) </h3>
<div class="outline-text-3" id="text-18-2">


</div>

<div id="outline-container-18-2-1" class="outline-4">
<h4 id="sec-18-2-1">Arguments </h4>
<div class="outline-text-4" id="text-18-2-1">

<p>(X Y)
</p></div>
</div>

</div>

<div id="outline-container-18-3" class="outline-3">
<h3 id="sec-18-3">RENDER [MINIMAP] (method) </h3>
<div class="outline-text-3" id="text-18-3">


</div>

<div id="outline-container-18-3-1" class="outline-4">
<h4 id="sec-18-3-1">Arguments </h4>
<div class="outline-text-4" id="text-18-3-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-18-4" class="outline-3">
<h3 id="sec-18-4">SELECT [MINIMAP] (method) </h3>
<div class="outline-text-3" id="text-18-4">


</div>

<div id="outline-container-18-4-1" class="outline-4">
<h4 id="sec-18-4-1">Arguments </h4>
<div class="outline-text-4" id="text-18-4-1">

<p>NIL
</p></div>
</div>
</div>

</div>

<div id="outline-container-19" class="outline-2">
<h2 id="sec-19">=NARRATOR= (prototype) </h2>
<div class="outline-text-2" id="text-19">


</div>

<div id="outline-container-19-1" class="outline-3">
<h3 id="sec-19-1">Parent prototype </h3>
<div class="outline-text-3" id="text-19-1">

<pre class="example">
=FORMATTER=
</pre>


</div>

<div id="outline-container-19-1-1" class="outline-4">
<h4 id="sec-19-1-1">Fields </h4>
<div class="outline-text-4" id="text-19-1-1">

<ul>
<li id="sec-19-1-1-1">VERBOSITY (field) <br/>
<ul>
<li id="sec-19-1-1-1-1">Documentation <br/>
Integer between 0 and 3 (inclusive).
</li>
</ul>
<ul>
<li id="sec-19-1-1-1-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-19-1-1-2">PASSIVE-VOICE-ACTIONS (field) <br/>
<ul>
<li id="sec-19-1-1-2-1">Documentation <br/>
List of action words to use passive voice in narrating.
<a href="http://en.wikipedia.org/wiki/Passive_voice">http://en.wikipedia.org/wiki/Passive_voice</a>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-19-1-1-3">REPEAT-COUNT (field) <br/>
</li>
</ul>
<ul>
<li id="sec-19-1-1-4">LAST-LINE (field) <br/>
</li>
</ul>
<ul>
<li id="sec-19-1-1-5">LINE-NUMBER (field) <br/>
</li>
</ul>
<ul>
<li id="sec-19-1-1-6">LINES (field) <br/>
<ul>
<li id="sec-19-1-1-6-1">Documentation <br/>
Vector of lines.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-19-1-1-7">CURRENT-LINE (field) <br/>
<ul>
<li id="sec-19-1-1-7-1">Documentation <br/>
Formatted line currently being composed.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-19-1-1-8">KEYMAP (field) <br/>
<ul>
<li id="sec-19-1-1-8-1">Documentation <br/>
A hash table mapping keylists to lambdas.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-19-1-1-9">IMAGE (field) <br/>
<ul>
<li id="sec-19-1-1-9-1">Documentation <br/>
The offscreen image buffer containing the widget's rendered output.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-19-1-1-10">WIDTH (field) <br/>
<ul>
<li id="sec-19-1-1-10-1">Documentation <br/>
The current allocated image width of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-19-1-1-11">HEIGHT (field) <br/>
<ul>
<li id="sec-19-1-1-11-1">Documentation <br/>
The current allocated image height of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-19-1-1-12">VISIBLE (field) <br/>
<ul>
<li id="sec-19-1-1-12-1">Documentation <br/>
The boolean visibility of the widget.
</li>
</ul>
<ul>
<li id="sec-19-1-1-12-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-19-1-1-13">X (field) <br/>
<ul>
<li id="sec-19-1-1-13-1">Documentation <br/>
The screen x-coordinate of the left side of the widget's display area.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-19-1-1-14">Y (field) <br/>
<ul>
<li id="sec-19-1-1-14-1">Documentation <br/>
The screen y-coordinate of the top of the widget's display area.
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-19-2" class="outline-3">
<h3 id="sec-19-2">NARRATE [NARRATOR] (method) </h3>
<div class="outline-text-3" id="text-19-2">


</div>

<div id="outline-container-19-2-1" class="outline-4">
<h4 id="sec-19-2-1">Arguments </h4>
<div class="outline-text-4" id="text-19-2-1">

<p>(CONTROL-STRING &amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-19-3" class="outline-3">
<h3 id="sec-19-3">NARRATE-MESSAGE [NARRATOR] (method) </h3>
<div class="outline-text-3" id="text-19-3">


</div>

<div id="outline-container-19-3-1" class="outline-4">
<h4 id="sec-19-3-1">Arguments </h4>
<div class="outline-text-4" id="text-19-3-1">

<p>(SENDER ACTION RECEIVER ARGS &amp;OPTIONAL FORCE)
</p></div>
</div>

</div>

<div id="outline-container-19-4" class="outline-3">
<h3 id="sec-19-4">NARRATELN [NARRATOR] (method) </h3>
<div class="outline-text-3" id="text-19-4">


</div>

<div id="outline-container-19-4-1" class="outline-4">
<h4 id="sec-19-4-1">Arguments </h4>
<div class="outline-text-4" id="text-19-4-1">

<p>(CONTROL-STRING &amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-19-5" class="outline-3">
<h3 id="sec-19-5">SAY [NARRATOR] (method) </h3>
<div class="outline-text-3" id="text-19-5">


</div>

<div id="outline-container-19-5-1" class="outline-4">
<h4 id="sec-19-5-1">Arguments </h4>
<div class="outline-text-4" id="text-19-5-1">

<p>(CONTROL-STRING &amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-19-6" class="outline-3">
<h3 id="sec-19-6">SET-VERBOSITY [NARRATOR] (method) </h3>
<div class="outline-text-3" id="text-19-6">


</div>

<div id="outline-container-19-6-1" class="outline-4">
<h4 id="sec-19-6-1">Arguments </h4>
<div class="outline-text-4" id="text-19-6-1">

<p>(&amp;OPTIONAL (VALUE 1))
</p></div>
</div>
</div>

</div>

<div id="outline-container-20" class="outline-2">
<h2 id="sec-20">=PAGER= (prototype) </h2>
<div class="outline-text-2" id="text-20">


</div>

<div id="outline-container-20-1" class="outline-3">
<h3 id="sec-20-1">Parent prototype </h3>
<div class="outline-text-3" id="text-20-1">

<pre class="example">
=WIDGET=
</pre>


</div>

<div id="outline-container-20-1-1" class="outline-4">
<h4 id="sec-20-1-1">Fields </h4>
<div class="outline-text-4" id="text-20-1-1">

<ul>
<li id="sec-20-1-1-1">PAGES (field) <br/>
</li>
</ul>
<ul>
<li id="sec-20-1-1-2">CURRENT-PAGE (field) <br/>
<ul>
<li id="sec-20-1-1-2-1">Documentation <br/>
Keyword name of current page.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-20-1-1-3">PAGER-MESSAGE (field) <br/>
<ul>
<li id="sec-20-1-1-3-1">Documentation <br/>
Formatted string to be displayed to right of tabs.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-20-1-1-4">PAGER-HEIGHT (field) <br/>
<ul>
<li id="sec-20-1-1-4-1">Documentation <br/>
Height in pixels of the pager
</li>
</ul>
<ul>
<li id="sec-20-1-1-4-2">Initialization form <br/>
<pre class="example">
20
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-20-1-1-5">BACKGROUND-COLOR (field) <br/>
</li>
</ul>
<ul>
<li id="sec-20-1-1-6">PREFIX-STRING (field) <br/>
</li>
</ul>
<ul>
<li id="sec-20-1-1-7">NUMBER-SEPARATOR-STRING (field) <br/>
</li>
</ul>
<ul>
<li id="sec-20-1-1-8">SEPARATOR-STRING (field) <br/>
</li>
</ul>
<ul>
<li id="sec-20-1-1-9">STYLE (field) <br/>
<ul>
<li id="sec-20-1-1-9-1">Documentation <br/>
Text style properties for pager display
</li>
</ul>
<ul>
<li id="sec-20-1-1-9-2">Initialization form <br/>
<pre class="example">
'(:FOREGROUND ".gray60")
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-20-1-1-10">HIGHLIGHTED-STYLE (field) <br/>
</li>
</ul>
<ul>
