notebook/xe2-reference.org
**** PROPERTIES (field)
**** KEYMAP (field)
***** Documentation
A hash table mapping keylists to lambdas.
**** IMAGE (field)
***** Documentation
The offscreen image buffer containing the widget's rendered output.
**** WIDTH (field)
***** Documentation
The current allocated image width of the widget, in pixels.
**** HEIGHT (field)
***** Documentation
The current allocated image height of the widget, in pixels.
**** VISIBLE (field)
***** Documentation
The boolean visibility of the widget.
***** Initialization form
: T
**** X (field)
***** Documentation
The screen x-coordinate of the left side of the widget's display area.
**** Y (field)
***** Documentation
The screen y-coordinate of the top of the widget's display area.
** ADD-PAGE [PAGER] (method)
*** Arguments
(KEYWORD WIDGETS &REST PROPERTIES)
** AUTO-POSITION [PAGER] (method)
*** Arguments
(&KEY (WIDTH *SCREEN-WIDTH*))
** GET-PAGE-NAMES [PAGER] (method)
*** Arguments
NIL
** INITIALIZE [PAGER] (method)
*** Arguments
NIL
** MESSAGE [PAGER] (method)
*** Arguments
(FORMATTED-STRING)
** PAGE-PROPERTY [PAGER] (method)
*** Arguments
(PAGE-NAME PROPERTY-KEYWORD)
** RENDER [PAGER] (method)
*** Arguments
NIL
** SELECT [PAGER] (method)
*** Arguments
(PAGE)
** SET-PAGE-PROPERTY [PAGER] (method)
*** Arguments
(PAGE-NAME PROPERTY-KEYWORD VALUE)
* =PROMPT= (prototype)
** Parent prototype
: =WIDGET=
** Documentation
The command prompt widget is a text input area with Emacs-like
keybindings. It is used to send messages to objects. (For ease of
use, prompt commands may also be bound to single keystrokes.)

 The command syntax is:

:  command-name arg1 arg2 ...

All tokens must be Lisp-readable symbols, strings, or numbers.

The command prompt will change its commands into message sends, and
send them to a designated command receiver:

:  yes             -->   [yes <receiver>]
:  move :north     -->   [move <receiver> :north]
:  attack :west :with :left-hand  --> [attack <receiver> :west 
:                                             :with :left-hand]

So the commands are just the receiver's methods. The command
line's HELP system is just a method documentation browser
 (i.e. SLOT-DESCRIPTORS.) 

The prompt can bind single keystrokes (i.e. one or more modifiers
and a keypress code) to the insertion of an arbitrary string at
point in the prompt. A string that ends in a period is a
"terminating" keybinding; a terminating keybinding also completes
the command input, causing the resulting command to be executed.

Examples: 

:   <up>      -->    move :north .
:  shift-<up> -->    push :north .
:    C-q      -->    quaff         ;; also shows potion list as output
:    M-1      -->    choose 1 .    ;; choose option 1 from output

The prompt has two input modes; direct mode and forward mode. In
direct mode, the prompt widget's own keymap is used. In forward
mode, all keypresses (except for the mode escape key) are rejected
by returning `nil' from `handle-key'.

In the typical setup, the first widget to receive the keypress
would be the default command prompt; a customized prompt, with
game-specific keybindings, would come second. During play, the
command prompt would reject all keypresses, which would pass on to
the next widget in the frame (the customized prompt.) To 'escape'
this and enter commands, hit ESCAPE (and again to return to forward
mode.)

The modes can be toggled with the ESCAPE key.
*** Fields
**** MODE (field)
***** Documentation
Either :direct or :forward.
***** Initialization form
: :DIRECT
**** DEFAULT-KEYBINDINGS (field)
***** Documentation
Default keybindings bound during initialization.
These are the arguments to `bind-key-to-prompt-insertion', which see.
**** VISIBLE (field)
***** Documentation
When non-nil, the prompt is drawn.
***** Initialization form
: T
**** RECEIVER (field)
***** Documentation
The object to send command messages to when in :forward mode.
**** POINT (field)
***** Documentation
Integer index of cursor within prompt line.
***** Initialization form
: 0
**** LINE (field)
***** Documentation
Currently edited command line.
***** Initialization form
: ""
**** HISTORY (field)
***** Documentation
A queue of strings containing the command history.
***** Initialization form
: (MAKE-QUEUE :MAX *DEFAULT-PROMPT-HISTORY-SIZE*)
**** HISTORY-POSITION (field)
**** KEYMAP (field)
***** Documentation
A hash table mapping keylists to lambdas.
**** IMAGE (field)
***** Documentation
The offscreen image buffer containing the widget's rendered output.
**** WIDTH (field)
***** Documentation
The current allocated image width of the widget, in pixels.
**** HEIGHT (field)
***** Documentation
The current allocated image height of the widget, in pixels.
**** VISIBLE (field)
***** Documentation
The boolean visibility of the widget.
***** Initialization form
: T
**** X (field)
***** Documentation
The screen x-coordinate of the left side of the widget's display area.
**** Y (field)
***** Documentation
The screen y-coordinate of the top of the widget's display area.
** BACKWARD-CHAR [PROMPT] (method)
*** Arguments
NIL
** BACKWARD-DELETE-CHAR [PROMPT] (method)
*** Arguments
NIL
