notebook/xe2-reference.html
<li id="sec-20-1-1-11">PROPERTIES (field) <br/>
</li>
</ul>
<ul>
<li id="sec-20-1-1-12">KEYMAP (field) <br/>
<ul>
<li id="sec-20-1-1-12-1">Documentation <br/>
A hash table mapping keylists to lambdas.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-20-1-1-13">IMAGE (field) <br/>
<ul>
<li id="sec-20-1-1-13-1">Documentation <br/>
The offscreen image buffer containing the widget's rendered output.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-20-1-1-14">WIDTH (field) <br/>
<ul>
<li id="sec-20-1-1-14-1">Documentation <br/>
The current allocated image width of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-20-1-1-15">HEIGHT (field) <br/>
<ul>
<li id="sec-20-1-1-15-1">Documentation <br/>
The current allocated image height of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-20-1-1-16">VISIBLE (field) <br/>
<ul>
<li id="sec-20-1-1-16-1">Documentation <br/>
The boolean visibility of the widget.
</li>
</ul>
<ul>
<li id="sec-20-1-1-16-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-20-1-1-17">X (field) <br/>
<ul>
<li id="sec-20-1-1-17-1">Documentation <br/>
The screen x-coordinate of the left side of the widget's display area.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-20-1-1-18">Y (field) <br/>
<ul>
<li id="sec-20-1-1-18-1">Documentation <br/>
The screen y-coordinate of the top of the widget's display area.
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-20-2" class="outline-3">
<h3 id="sec-20-2">ADD-PAGE [PAGER] (method) </h3>
<div class="outline-text-3" id="text-20-2">


</div>

<div id="outline-container-20-2-1" class="outline-4">
<h4 id="sec-20-2-1">Arguments </h4>
<div class="outline-text-4" id="text-20-2-1">

<p>(KEYWORD WIDGETS &amp;REST PROPERTIES)
</p></div>
</div>

</div>

<div id="outline-container-20-3" class="outline-3">
<h3 id="sec-20-3">AUTO-POSITION [PAGER] (method) </h3>
<div class="outline-text-3" id="text-20-3">


</div>

<div id="outline-container-20-3-1" class="outline-4">
<h4 id="sec-20-3-1">Arguments </h4>
<div class="outline-text-4" id="text-20-3-1">

<p>(&amp;KEY (WIDTH *SCREEN-WIDTH*))
</p></div>
</div>

</div>

<div id="outline-container-20-4" class="outline-3">
<h3 id="sec-20-4">GET-PAGE-NAMES [PAGER] (method) </h3>
<div class="outline-text-3" id="text-20-4">


</div>

<div id="outline-container-20-4-1" class="outline-4">
<h4 id="sec-20-4-1">Arguments </h4>
<div class="outline-text-4" id="text-20-4-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-20-5" class="outline-3">
<h3 id="sec-20-5">INITIALIZE [PAGER] (method) </h3>
<div class="outline-text-3" id="text-20-5">


</div>

<div id="outline-container-20-5-1" class="outline-4">
<h4 id="sec-20-5-1">Arguments </h4>
<div class="outline-text-4" id="text-20-5-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-20-6" class="outline-3">
<h3 id="sec-20-6">MESSAGE [PAGER] (method) </h3>
<div class="outline-text-3" id="text-20-6">


</div>

<div id="outline-container-20-6-1" class="outline-4">
<h4 id="sec-20-6-1">Arguments </h4>
<div class="outline-text-4" id="text-20-6-1">

<p>(FORMATTED-STRING)
</p></div>
</div>

</div>

<div id="outline-container-20-7" class="outline-3">
<h3 id="sec-20-7">PAGE-PROPERTY [PAGER] (method) </h3>
<div class="outline-text-3" id="text-20-7">


</div>

<div id="outline-container-20-7-1" class="outline-4">
<h4 id="sec-20-7-1">Arguments </h4>
<div class="outline-text-4" id="text-20-7-1">

<p>(PAGE-NAME PROPERTY-KEYWORD)
</p></div>
</div>

</div>

<div id="outline-container-20-8" class="outline-3">
<h3 id="sec-20-8">RENDER [PAGER] (method) </h3>
<div class="outline-text-3" id="text-20-8">


</div>

<div id="outline-container-20-8-1" class="outline-4">
<h4 id="sec-20-8-1">Arguments </h4>
<div class="outline-text-4" id="text-20-8-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-20-9" class="outline-3">
<h3 id="sec-20-9">SELECT [PAGER] (method) </h3>
<div class="outline-text-3" id="text-20-9">


</div>

<div id="outline-container-20-9-1" class="outline-4">
<h4 id="sec-20-9-1">Arguments </h4>
<div class="outline-text-4" id="text-20-9-1">

<p>(PAGE)
</p></div>
</div>

</div>

<div id="outline-container-20-10" class="outline-3">
<h3 id="sec-20-10">SET-PAGE-PROPERTY [PAGER] (method) </h3>
<div class="outline-text-3" id="text-20-10">


</div>

<div id="outline-container-20-10-1" class="outline-4">
<h4 id="sec-20-10-1">Arguments </h4>
<div class="outline-text-4" id="text-20-10-1">

<p>(PAGE-NAME PROPERTY-KEYWORD VALUE)
</p></div>
</div>
</div>

</div>

<div id="outline-container-21" class="outline-2">
<h2 id="sec-21">=PROMPT= (prototype) </h2>
<div class="outline-text-2" id="text-21">


</div>

<div id="outline-container-21-1" class="outline-3">
<h3 id="sec-21-1">Parent prototype </h3>
<div class="outline-text-3" id="text-21-1">

<pre class="example">
=WIDGET=
</pre>

</div>

</div>

<div id="outline-container-21-2" class="outline-3">
<h3 id="sec-21-2">Documentation </h3>
<div class="outline-text-3" id="text-21-2">

<p>The command prompt widget is a text input area with Emacs-like
keybindings. It is used to send messages to objects. (For ease of
use, prompt commands may also be bound to single keystrokes.)
</p>
<p>
 The command syntax is:
</p>
<pre class="example">
 command-name arg1 arg2 ...
</pre>


<p>
All tokens must be Lisp-readable symbols, strings, or numbers.
</p>
<p>
The command prompt will change its commands into message sends, and
send them to a designated command receiver:
</p>
<pre class="example">
 yes             --&gt;   [yes &lt;receiver&gt;]
 move :north     --&gt;   [move &lt;receiver&gt; :north]
 attack :west :with :left-hand  --&gt; [attack &lt;receiver&gt; :west 
                                            :with :left-hand]
</pre>


<p>
So the commands are just the receiver's methods. The command
line's HELP system is just a method documentation browser
 (i.e. SLOT-DESCRIPTORS.) 
</p>
<p>
The prompt can bind single keystrokes (i.e. one or more modifiers
and a keypress code) to the insertion of an arbitrary string at
point in the prompt. A string that ends in a period is a
"terminating" keybinding; a terminating keybinding also completes
the command input, causing the resulting command to be executed.
</p>
<p>
Examples: 
</p>
<pre class="example">
  &lt;up&gt;      --&gt;    move :north .
 shift-&lt;up&gt; --&gt;    push :north .
   C-q      --&gt;    quaff         ;; also shows potion list as output
   M-1      --&gt;    choose 1 .    ;; choose option 1 from output
</pre>


<p>
The prompt has two input modes; direct mode and forward mode. In
direct mode, the prompt widget's own keymap is used. In forward
mode, all keypresses (except for the mode escape key) are rejected
by returning `nil' from `handle-key'.
</p>
<p>
In the typical setup, the first widget to receive the keypress
would be the default command prompt; a customized prompt, with
game-specific keybindings, would come second. During play, the
command prompt would reject all keypresses, which would pass on to
the next widget in the frame (the customized prompt.) To 'escape'
this and enter commands, hit ESCAPE (and again to return to forward
mode.)
</p>
<p>
The modes can be toggled with the ESCAPE key.
</p>
</div>

<div id="outline-container-21-2-1" class="outline-4">
<h4 id="sec-21-2-1">Fields </h4>
<div class="outline-text-4" id="text-21-2-1">

<ul>
<li id="sec-21-2-1-1">MODE (field) <br/>
<ul>
<li id="sec-21-2-1-1-1">Documentation <br/>
Either :direct or :forward.
</li>
</ul>
<ul>
<li id="sec-21-2-1-1-2">Initialization form <br/>
<pre class="example">
:DIRECT
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-2">DEFAULT-KEYBINDINGS (field) <br/>
<ul>
<li id="sec-21-2-1-2-1">Documentation <br/>
Default keybindings bound during initialization.
These are the arguments to `bind-key-to-prompt-insertion', which see.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-3">VISIBLE (field) <br/>
<ul>
<li id="sec-21-2-1-3-1">Documentation <br/>
When non-nil, the prompt is drawn.
</li>
</ul>
<ul>
<li id="sec-21-2-1-3-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-4">RECEIVER (field) <br/>
<ul>
<li id="sec-21-2-1-4-1">Documentation <br/>
The object to send command messages to when in :forward mode.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-5">POINT (field) <br/>
<ul>
<li id="sec-21-2-1-5-1">Documentation <br/>
Integer index of cursor within prompt line.
</li>
</ul>
<ul>
<li id="sec-21-2-1-5-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-6">LINE (field) <br/>
<ul>
<li id="sec-21-2-1-6-1">Documentation <br/>
Currently edited command line.
</li>
</ul>
<ul>
<li id="sec-21-2-1-6-2">Initialization form <br/>
<pre class="example">
""
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-7">HISTORY (field) <br/>
<ul>
<li id="sec-21-2-1-7-1">Documentation <br/>
A queue of strings containing the command history.
</li>
</ul>
<ul>
<li id="sec-21-2-1-7-2">Initialization form <br/>
<pre class="example">
(MAKE-QUEUE :MAX *DEFAULT-PROMPT-HISTORY-SIZE*)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-8">HISTORY-POSITION (field) <br/>
</li>
</ul>
<ul>
<li id="sec-21-2-1-9">KEYMAP (field) <br/>
<ul>
<li id="sec-21-2-1-9-1">Documentation <br/>
A hash table mapping keylists to lambdas.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-10">IMAGE (field) <br/>
<ul>
<li id="sec-21-2-1-10-1">Documentation <br/>
The offscreen image buffer containing the widget's rendered output.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-11">WIDTH (field) <br/>
<ul>
<li id="sec-21-2-1-11-1">Documentation <br/>
The current allocated image width of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-12">HEIGHT (field) <br/>
<ul>
<li id="sec-21-2-1-12-1">Documentation <br/>
The current allocated image height of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-13">VISIBLE (field) <br/>
<ul>
<li id="sec-21-2-1-13-1">Documentation <br/>
The boolean visibility of the widget.
</li>
</ul>
<ul>
<li id="sec-21-2-1-13-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-14">X (field) <br/>
<ul>
<li id="sec-21-2-1-14-1">Documentation <br/>
The screen x-coordinate of the left side of the widget's display area.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-21-2-1-15">Y (field) <br/>
<ul>
<li id="sec-21-2-1-15-1">Documentation <br/>
The screen y-coordinate of the top of the widget's display area.
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-21-3" class="outline-3">
<h3 id="sec-21-3">BACKWARD-CHAR [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-3">


</div>
