notebook/xe2-reference.org
** BACKWARD-HISTORY [PROMPT] (method)
*** Arguments
NIL
** CLEAR [PROMPT] (method)
*** Arguments
NIL
** ESCAPE [PROMPT] (method)
*** Arguments
NIL
** EXECUTE [PROMPT] (method)
*** Arguments
NIL
** FORWARD-CHAR [PROMPT] (method)
*** Arguments
NIL
** FORWARD-HISTORY [PROMPT] (method)
*** Arguments
NIL
** HANDLE-KEY [PROMPT] (method)
*** Arguments
(KEYLIST)
*** Documentation
Reject all keypresses when in :forward mode; otherwise handle them
normally.
** HISTORY-ITEM [PROMPT] (method)
*** Arguments
(N)
** INITIALIZE [PROMPT] (method)
*** Arguments
NIL
** INSERT [PROMPT] (method)
*** Arguments
(STRING)
** INSTALL-DEFAULT-KEYBINDINGS [PROMPT] (method)
*** Arguments
NIL
** INSTALL-KEYBINDINGS [PROMPT] (method)
*** Arguments
NIL
** MOVE-BEGINNING-OF-LINE [PROMPT] (method)
*** Arguments
NIL
** MOVE-END-OF-LINE [PROMPT] (method)
*** Arguments
NIL
** RENDER [PROMPT] (method)
*** Arguments
NIL
** SET-MODE [PROMPT] (method)
*** Arguments
(MODE)
** SET-RECEIVER [PROMPT] (method)
*** Arguments
(RECEIVER)
* =SPRITE= (prototype)
** Parent prototype
: =CELL=
** Documentation
Sprites are XE2 game objects derived from cells. Although most
behaviors are compatible, sprites can take any pixel location in the
world, and collision detection is performed between sprites and cells.
*** Fields
**** X (field)
***** Documentation
The world x-coordinate of the sprite.
**** Y (field)
***** Documentation
The world y-coordinate of the sprite.
**** SAVED-X (field)
***** Documentation
Saved x-coordinate used to jump back from a collision.
**** SAVED-Y (field)
***** Documentation
Saved y-coordinate used to jump back from a collision.
**** IMAGE (field)
***** Documentation
The arbitrarily sized image
  resource. This determines the bounding box.
**** WIDTH (field)
***** Documentation
The cached width of the bounding box.
**** HEIGHT (field)
