notebook/xe2-reference.html

<div id="outline-container-21-3-1" class="outline-4">
<h4 id="sec-21-3-1">Arguments </h4>
<div class="outline-text-4" id="text-21-3-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-4" class="outline-3">
<h3 id="sec-21-4">BACKWARD-DELETE-CHAR [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-4">


</div>

<div id="outline-container-21-4-1" class="outline-4">
<h4 id="sec-21-4-1">Arguments </h4>
<div class="outline-text-4" id="text-21-4-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-5" class="outline-3">
<h3 id="sec-21-5">BACKWARD-HISTORY [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-5">


</div>

<div id="outline-container-21-5-1" class="outline-4">
<h4 id="sec-21-5-1">Arguments </h4>
<div class="outline-text-4" id="text-21-5-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-6" class="outline-3">
<h3 id="sec-21-6">CLEAR [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-6">


</div>

<div id="outline-container-21-6-1" class="outline-4">
<h4 id="sec-21-6-1">Arguments </h4>
<div class="outline-text-4" id="text-21-6-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-7" class="outline-3">
<h3 id="sec-21-7">ESCAPE [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-7">


</div>

<div id="outline-container-21-7-1" class="outline-4">
<h4 id="sec-21-7-1">Arguments </h4>
<div class="outline-text-4" id="text-21-7-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-8" class="outline-3">
<h3 id="sec-21-8">EXECUTE [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-8">


</div>

<div id="outline-container-21-8-1" class="outline-4">
<h4 id="sec-21-8-1">Arguments </h4>
<div class="outline-text-4" id="text-21-8-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-9" class="outline-3">
<h3 id="sec-21-9">FORWARD-CHAR [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-9">


</div>

<div id="outline-container-21-9-1" class="outline-4">
<h4 id="sec-21-9-1">Arguments </h4>
<div class="outline-text-4" id="text-21-9-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-10" class="outline-3">
<h3 id="sec-21-10">FORWARD-HISTORY [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-10">


</div>

<div id="outline-container-21-10-1" class="outline-4">
<h4 id="sec-21-10-1">Arguments </h4>
<div class="outline-text-4" id="text-21-10-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-11" class="outline-3">
<h3 id="sec-21-11">HANDLE-KEY [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-11">


</div>

<div id="outline-container-21-11-1" class="outline-4">
<h4 id="sec-21-11-1">Arguments </h4>
<div class="outline-text-4" id="text-21-11-1">

<p>(KEYLIST)
</p></div>

</div>

<div id="outline-container-21-11-2" class="outline-4">
<h4 id="sec-21-11-2">Documentation </h4>
<div class="outline-text-4" id="text-21-11-2">

<p>Reject all keypresses when in :forward mode; otherwise handle them
normally.
</p></div>
</div>

</div>

<div id="outline-container-21-12" class="outline-3">
<h3 id="sec-21-12">HISTORY-ITEM [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-12">


</div>

<div id="outline-container-21-12-1" class="outline-4">
<h4 id="sec-21-12-1">Arguments </h4>
<div class="outline-text-4" id="text-21-12-1">

<p>(N)
</p></div>
</div>

</div>

<div id="outline-container-21-13" class="outline-3">
<h3 id="sec-21-13">INITIALIZE [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-13">


</div>

<div id="outline-container-21-13-1" class="outline-4">
<h4 id="sec-21-13-1">Arguments </h4>
<div class="outline-text-4" id="text-21-13-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-14" class="outline-3">
<h3 id="sec-21-14">INSERT [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-14">


</div>

<div id="outline-container-21-14-1" class="outline-4">
<h4 id="sec-21-14-1">Arguments </h4>
<div class="outline-text-4" id="text-21-14-1">

<p>(STRING)
</p></div>
</div>

</div>

<div id="outline-container-21-15" class="outline-3">
<h3 id="sec-21-15">INSTALL-DEFAULT-KEYBINDINGS [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-15">


</div>

<div id="outline-container-21-15-1" class="outline-4">
<h4 id="sec-21-15-1">Arguments </h4>
<div class="outline-text-4" id="text-21-15-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-16" class="outline-3">
<h3 id="sec-21-16">INSTALL-KEYBINDINGS [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-16">


</div>

<div id="outline-container-21-16-1" class="outline-4">
<h4 id="sec-21-16-1">Arguments </h4>
<div class="outline-text-4" id="text-21-16-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-17" class="outline-3">
<h3 id="sec-21-17">MOVE-BEGINNING-OF-LINE [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-17">


</div>

<div id="outline-container-21-17-1" class="outline-4">
<h4 id="sec-21-17-1">Arguments </h4>
<div class="outline-text-4" id="text-21-17-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-18" class="outline-3">
<h3 id="sec-21-18">MOVE-END-OF-LINE [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-18">


</div>

<div id="outline-container-21-18-1" class="outline-4">
<h4 id="sec-21-18-1">Arguments </h4>
<div class="outline-text-4" id="text-21-18-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-19" class="outline-3">
<h3 id="sec-21-19">RENDER [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-19">


</div>

<div id="outline-container-21-19-1" class="outline-4">
<h4 id="sec-21-19-1">Arguments </h4>
<div class="outline-text-4" id="text-21-19-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-21-20" class="outline-3">
<h3 id="sec-21-20">SET-MODE [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-20">


</div>

<div id="outline-container-21-20-1" class="outline-4">
<h4 id="sec-21-20-1">Arguments </h4>
<div class="outline-text-4" id="text-21-20-1">

<p>(MODE)
</p></div>
</div>

</div>

<div id="outline-container-21-21" class="outline-3">
<h3 id="sec-21-21">SET-RECEIVER [PROMPT] (method) </h3>
<div class="outline-text-3" id="text-21-21">


</div>

<div id="outline-container-21-21-1" class="outline-4">
<h4 id="sec-21-21-1">Arguments </h4>
<div class="outline-text-4" id="text-21-21-1">

<p>(RECEIVER)
</p></div>
</div>
</div>

</div>

<div id="outline-container-22" class="outline-2">
<h2 id="sec-22">=SPRITE= (prototype) </h2>
<div class="outline-text-2" id="text-22">


</div>

<div id="outline-container-22-1" class="outline-3">
<h3 id="sec-22-1">Parent prototype </h3>
<div class="outline-text-3" id="text-22-1">

<pre class="example">
=CELL=
</pre>

</div>

</div>

<div id="outline-container-22-2" class="outline-3">
<h3 id="sec-22-2">Documentation </h3>
<div class="outline-text-3" id="text-22-2">

<p>Sprites are XE2 game objects derived from cells. Although most
behaviors are compatible, sprites can take any pixel location in the
world, and collision detection is performed between sprites and cells.
</p>
</div>

<div id="outline-container-22-2-1" class="outline-4">
<h4 id="sec-22-2-1">Fields </h4>
<div class="outline-text-4" id="text-22-2-1">

<ul>
<li id="sec-22-2-1-1">X (field) <br/>
<ul>
<li id="sec-22-2-1-1-1">Documentation <br/>
The world x-coordinate of the sprite.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-2">Y (field) <br/>
<ul>
<li id="sec-22-2-1-2-1">Documentation <br/>
The world y-coordinate of the sprite.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-3">SAVED-X (field) <br/>
<ul>
<li id="sec-22-2-1-3-1">Documentation <br/>
Saved x-coordinate used to jump back from a collision.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-4">SAVED-Y (field) <br/>
<ul>
<li id="sec-22-2-1-4-1">Documentation <br/>
Saved y-coordinate used to jump back from a collision.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-5">IMAGE (field) <br/>
<ul>
<li id="sec-22-2-1-5-1">Documentation <br/>
The arbitrarily sized image
  resource. This determines the bounding box.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-6">WIDTH (field) <br/>
<ul>
<li id="sec-22-2-1-6-1">Documentation <br/>
The cached width of the bounding box.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-7">HEIGHT (field) <br/>
<ul>
<li id="sec-22-2-1-7-1">Documentation <br/>
