notebook/xe2-reference.html
The cached height of the bounding box.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-8">TYPE (field) <br/>
</li>
</ul>
<ul>
<li id="sec-22-2-1-9">TYPE (field) <br/>
</li>
</ul>
<ul>
<li id="sec-22-2-1-10">AUTO-LOADOUT (field) <br/>
<ul>
<li id="sec-22-2-1-10-1">Documentation <br/>
When non-nil, the :loadout method is invoked upon entry into a world.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-11">TEAM (field) <br/>
<ul>
<li id="sec-22-2-1-11-1">Documentation <br/>
Keyword symbol of team, if any.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-12">WEIGHT (field) <br/>
<ul>
<li id="sec-22-2-1-12-1">Documentation <br/>
Recursively calculate the weight of this cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-13">WIDGET (field) <br/>
<ul>
<li id="sec-22-2-1-13-1">Documentation <br/>
XE2 widget object, if any.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-14">TILE (field) <br/>
<ul>
<li id="sec-22-2-1-14-1">Documentation <br/>
Resource name of image. 
When nil, the method DRAW is invoked instead of using a tile.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-15">RENDER-CELL (field) <br/>
<ul>
<li id="sec-22-2-1-15-1">Documentation <br/>
Subcell to render. See load-sprite-sheet-resource.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-16">ROW (field) <br/>
<ul>
<li id="sec-22-2-1-16-1">Documentation <br/>
When non-nil, the current row location of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-17">COLUMN (field) <br/>
<ul>
<li id="sec-22-2-1-17-1">Documentation <br/>
When non-nil, the current column of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-18">CATEGORIES (field) <br/>
<ul>
<li id="sec-22-2-1-18-1">Documentation <br/>
List of category keyword symbols
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-19">LIGHT-RADIUS (field) <br/>
<ul>
<li id="sec-22-2-1-19-1">Documentation <br/>
Strength of light cast by this object.
</li>
</ul>
<ul>
<li id="sec-22-2-1-19-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-20">MENU (field) <br/>
<ul>
<li id="sec-22-2-1-20-1">Documentation <br/>
Menu objects.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-21">SPEED (field) <br/>
<ul>
<li id="sec-22-2-1-21-1">Documentation <br/>
The number of action points alloted each phase.
</li>
</ul>
<ul>
<li id="sec-22-2-1-21-2">Initialization form <br/>
<pre class="example">
'(:BASE 10)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-22">PHASE-NUMBER (field) <br/>
<ul>
<li id="sec-22-2-1-22-1">Documentation <br/>
An integer giving the last phase this cell has completed.
</li>
</ul>
<ul>
<li id="sec-22-2-1-22-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-23">ACTION-POINTS (field) <br/>
<ul>
<li id="sec-22-2-1-23-1">Documentation <br/>
An integer giving the ability of a cell to take turns on a given round.
</li>
</ul>
<ul>
<li id="sec-22-2-1-23-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-24">DEFAULT-COST (field) <br/>
<ul>
<li id="sec-22-2-1-24-1">Documentation <br/>
Cost for basic actions.
</li>
</ul>
<ul>
<li id="sec-22-2-1-24-2">Initialization form <br/>
<pre class="example">
'(:BASE 5 :MIN NIL :MAX NIL :DELTA NIL)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-25">STEPPING (field) <br/>
<ul>
<li id="sec-22-2-1-25-1">Documentation <br/>
Whether to generate step events where you walk.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-26">MOVEMENT-COST (field) <br/>
<ul>
<li id="sec-22-2-1-26-1">Documentation <br/>
Base cost of moving one square.
</li>
</ul>
<ul>
<li id="sec-22-2-1-26-2">Initialization form <br/>
<pre class="example">
'(:BASE 10 :MIN NIL :MAX NIL :DELTA NIL)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-27">TOOLTIP (field) <br/>
<ul>
<li id="sec-22-2-1-27-1">Documentation <br/>
A formatted line giving dev help or information about the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-28">NAME (field) <br/>
<ul>
<li id="sec-22-2-1-28-1">Documentation <br/>
The name of this cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-29">DESCRIPTION (field) <br/>
<ul>
<li id="sec-22-2-1-29-1">Documentation <br/>
A description of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-30">UNKNOWN-NAME (field) <br/>
<ul>
<li id="sec-22-2-1-30-1">Documentation <br/>
The name of this cell, when it is unknown.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-31">UNKNOWN-DESCRIPTION (field) <br/>
<ul>
<li id="sec-22-2-1-31-1">Documentation <br/>
A description of the cell, when it is unknown.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-32">EQUIPMENT (field) <br/>
<ul>
<li id="sec-22-2-1-32-1">Documentation <br/>
Property list of :slot -&gt; cell pairs.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-33">EQUIPMENT-SLOTS (field) <br/>
<ul>
<li id="sec-22-2-1-33-1">Documentation <br/>
List of keyword symbols identifying available equipment slots.
</li>
</ul>
<ul>
<li id="sec-22-2-1-33-2">Initialization form <br/>
<pre class="example">
'(:HEAD :NECK :LEFT-HAND :RIGHT-HAND :HANDS :FEET :LEGS :TORSO :ARMS :PACK
</pre>

<p>    :BELT)
</p></li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-34">USING-SLOT (field) <br/>
<ul>
<li id="sec-22-2-1-34-1">Documentation <br/>
Keyword symbol of the currently selected equipment slot.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-35">ATTACKING-WITH (field) <br/>
<ul>
<li id="sec-22-2-1-35-1">Documentation <br/>
Keyword symbol of the currently selected weapon slot.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-36">FIRING-WITH (field) <br/>
<ul>
<li id="sec-22-2-1-36-1">Documentation <br/>
Keyword symbol of the currently selected firing weapon slot.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-37">EQUIP-FOR (field) <br/>
<ul>
<li id="sec-22-2-1-37-1">Documentation <br/>
List of keyword symbols showing where this item may be equipped.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-38">EQUIPPER (field) <br/>
<ul>
<li id="sec-22-2-1-38-1">Documentation <br/>
When non-nil, the character currently equipping this item.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-39">INVENTORY (field) <br/>
<ul>
<li id="sec-22-2-1-39-1">Documentation <br/>
The contents (if any) of the cell.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-40">MAX-WEIGHT (field) <br/>
<ul>
<li id="sec-22-2-1-40-1">Documentation <br/>
Maximum weight this container can hold.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-41">MAX-ITEMS (field) <br/>
<ul>
<li id="sec-22-2-1-41-1">Documentation <br/>
Maximum number of items this container can hold.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-42">PARENT-CONTAINER (field) <br/>
<ul>
<li id="sec-22-2-1-42-1">Documentation <br/>
Link to containing cell, if any.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-43">LABEL (field) <br/>
<ul>
<li id="sec-22-2-1-43-1">Documentation <br/>
Label (string or formatted line) to be used as display in forms.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-44">OCCUPANT (field) <br/>
<ul>
<li id="sec-22-2-1-44-1">Documentation <br/>
Occupant cell, used to implement drivable vehicles.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-45">PROXY (field) <br/>
<ul>
<li id="sec-22-2-1-45-1">Documentation <br/>
Make this cell a proxy for OCCUPANT.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-46">COMBINATION-AMOUNT (field) <br/>
<ul>
<li id="sec-22-2-1-46-1">Documentation <br/>
Amount of item this cell represents.
</li>
</ul>
<ul>
<li id="sec-22-2-1-46-2">Initialization form <br/>
<pre class="example">
0
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-47">COMBINATION-KEY (field) <br/>
<ul>
<li id="sec-22-2-1-47-1">Documentation <br/>
Only items matching this key will be combined.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-22-2-1-48">EXCLUDED-FIELDS (field) <br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-22-3" class="outline-3">
<h3 id="sec-22-3">COLLIDE [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-3">


</div>

<div id="outline-container-22-3-1" class="outline-4">
<h4 id="sec-22-3-1">Arguments </h4>
<div class="outline-text-4" id="text-22-3-1">

<p>(SPRITE)
</p></div>
</div>

</div>

<div id="outline-container-22-4" class="outline-3">
<h3 id="sec-22-4">COLLIDE-* [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-4">


</div>

<div id="outline-container-22-4-1" class="outline-4">
<h4 id="sec-22-4-1">Arguments </h4>
<div class="outline-text-4" id="text-22-4-1">

<p>(O-TOP O-LEFT O-WIDTH O-HEIGHT)
</p></div>
</div>

</div>

<div id="outline-container-22-5" class="outline-3">
<h3 id="sec-22-5">DIE [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-5">


</div>

<div id="outline-container-22-5-1" class="outline-4">
<h4 id="sec-22-5-1">Arguments </h4>
<div class="outline-text-4" id="text-22-5-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-22-6" class="outline-3">
<h3 id="sec-22-6">DISTANCE-TO-PLAYER [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-6">


</div>

<div id="outline-container-22-6-1" class="outline-4">
<h4 id="sec-22-6-1">Arguments </h4>
<div class="outline-text-4" id="text-22-6-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-22-6-2" class="outline-4">
<h4 id="sec-22-6-2">Documentation </h4>
<div class="outline-text-4" id="text-22-6-2">

<p>Calculate the distance from the current location to the player.
</p></div>
</div>

</div>

<div id="outline-container-22-7" class="outline-3">
<h3 id="sec-22-7">DO-COLLISION [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-7">


</div>

<div id="outline-container-22-7-1" class="outline-4">
<h4 id="sec-22-7-1">Arguments </h4>
<div class="outline-text-4" id="text-22-7-1">

<p>(OBJECT)
</p></div>

</div>

<div id="outline-container-22-7-2" class="outline-4">
<h4 id="sec-22-7-2">Documentation </h4>
<div class="outline-text-4" id="text-22-7-2">

<p>Respond to a collision detected with OBJECT.
</p></div>
</div>

</div>

<div id="outline-container-22-8" class="outline-3">
<h3 id="sec-22-8">DROP [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-8">


</div>

<div id="outline-container-22-8-1" class="outline-4">
<h4 id="sec-22-8-1">Arguments </h4>
<div class="outline-text-4" id="text-22-8-1">

<p>(CELL &amp;OPTIONAL (DELTA-ROW 0) (DELTA-COLUMN 0))
</p></div>
</div>

</div>

<div id="outline-container-22-9" class="outline-3">
<h3 id="sec-22-9">GRID-COORDINATES [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-9">


</div>

<div id="outline-container-22-9-1" class="outline-4">
<h4 id="sec-22-9-1">Arguments </h4>
<div class="outline-text-4" id="text-22-9-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-22-10" class="outline-3">
<h3 id="sec-22-10">IMAGE-COORDINATES [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-10">


</div>

<div id="outline-container-22-10-1" class="outline-4">
<h4 id="sec-22-10-1">Arguments </h4>
<div class="outline-text-4" id="text-22-10-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-22-11" class="outline-3">
<h3 id="sec-22-11">INITIALIZE [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-11">


</div>
