notebook/xe2-reference.org
** MOVE [SPRITE] (method)
*** Arguments
(DIRECTION &OPTIONAL MOVEMENT-DISTANCE)
** SAVE-EXCURSION [SPRITE] (method)
*** Arguments
NIL
** UNDO-EXCURSION [SPRITE] (method)
*** Arguments
NIL
** UPDATE-DIMENSIONS [SPRITE] (method)
*** Arguments
NIL
** UPDATE-IMAGE [SPRITE] (method)
*** Arguments
(IMAGE)
** UPDATE-POSITION [SPRITE] (method)
*** Arguments
(X Y &OPTIONAL IGNORE-OBSTACLES)
** VIEWPORT-COORDINATES [SPRITE] (method)
*** Arguments
NIL
** WOULD-COLLIDE [SPRITE] (method)
*** Arguments
(X0 Y0)
** XY-COORDINATES [SPRITE] (method)
*** Arguments
NIL
* =STACK= (prototype)
** Parent prototype
: =WIDGET=
** Documentation
Stack all the child widgets on top of one another in a column.
*** Fields
**** CHILDREN (field)
***** Documentation
The widgets in the stack.
**** KEYMAP (field)
***** Documentation
A hash table mapping keylists to lambdas.
**** IMAGE (field)
***** Documentation
The offscreen image buffer containing the widget's rendered output.
**** WIDTH (field)
***** Documentation
The current allocated image width of the widget, in pixels.
**** HEIGHT (field)
***** Documentation
The current allocated image height of the widget, in pixels.
**** VISIBLE (field)
***** Documentation
The boolean visibility of the widget.
***** Initialization form
: T
**** X (field)
***** Documentation
The screen x-coordinate of the left side of the widget's display area.
**** Y (field)
***** Documentation
The screen y-coordinate of the top of the widget's display area.
** HIT [STACK] (method)
*** Arguments
(X Y)
** INITIALIZE [STACK] (method)
*** Arguments
(&REST CHILDREN)
** RENDER [STACK] (method)
*** Arguments
NIL
** SET-CHILDREN [STACK] (method)
*** Arguments
(CHILDREN)
* =TEXTBOX= (prototype)
** Parent prototype
: =WIDGET=
*** Fields
**** FONT (field)
**** BUFFER (field)
**** BORDERED (field)
**** MAX-DISPLAYED-ROWS (field)
***** Documentation
An integer when scrolling is enabled.
**** MAX-DISPLAYED-COLUMNS (field)
**** BACKGROUND-COLOR (field)
**** FOREGROUND-COLOR (field)
**** CURSOR-COLOR (field)
**** POINT-ROW (field)
**** POINT-COLUMN (field)
**** VISIBLE (field)
**** KEYMAP (field)
***** Documentation
A hash table mapping keylists to lambdas.
**** IMAGE (field)
***** Documentation
The offscreen image buffer containing the widget's rendered output.
**** WIDTH (field)
***** Documentation
The current allocated image width of the widget, in pixels.
**** HEIGHT (field)
***** Documentation
The current allocated image height of the widget, in pixels.
**** VISIBLE (field)
***** Documentation
The boolean visibility of the widget.
***** Initialization form
: T
**** X (field)
***** Documentation
The screen x-coordinate of the left side of the widget's display area.
**** Y (field)
***** Documentation
The screen y-coordinate of the top of the widget's display area.
** AUTO-CENTER [TEXTBOX] (method)
*** Arguments
NIL
*** Documentation
Automatically center the textbox on the screen.
** BACKWARD-CHAR [TEXTBOX] (method)
*** Arguments
NIL
** BACKWARD-DELETE-CHAR [TEXTBOX] (method)
*** Arguments
NIL
** FORWARD-CHAR [TEXTBOX] (method)
*** Arguments
NIL
** GET-BUFFER-AS-STRING [TEXTBOX] (method)
*** Arguments
NIL
** INITIALIZE [TEXTBOX] (method)
*** Arguments
NIL
** INSERT [TEXTBOX] (method)
*** Arguments
(KEY)
** INSTALL-KEYBINDINGS [TEXTBOX] (method)
*** Arguments
NIL
** MOVE-BEGINNING-OF-LINE [TEXTBOX] (method)
*** Arguments
NIL
