notebook/xe2-reference.html

<div id="outline-container-22-11-1" class="outline-4">
<h4 id="sec-22-11-1">Arguments </h4>
<div class="outline-text-4" id="text-22-11-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-22-12" class="outline-3">
<h3 id="sec-22-12">MOVE [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-12">


</div>

<div id="outline-container-22-12-1" class="outline-4">
<h4 id="sec-22-12-1">Arguments </h4>
<div class="outline-text-4" id="text-22-12-1">

<p>(DIRECTION &amp;OPTIONAL MOVEMENT-DISTANCE)
</p></div>
</div>

</div>

<div id="outline-container-22-13" class="outline-3">
<h3 id="sec-22-13">SAVE-EXCURSION [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-13">


</div>

<div id="outline-container-22-13-1" class="outline-4">
<h4 id="sec-22-13-1">Arguments </h4>
<div class="outline-text-4" id="text-22-13-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-22-14" class="outline-3">
<h3 id="sec-22-14">UNDO-EXCURSION [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-14">


</div>

<div id="outline-container-22-14-1" class="outline-4">
<h4 id="sec-22-14-1">Arguments </h4>
<div class="outline-text-4" id="text-22-14-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-22-15" class="outline-3">
<h3 id="sec-22-15">UPDATE-DIMENSIONS [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-15">


</div>

<div id="outline-container-22-15-1" class="outline-4">
<h4 id="sec-22-15-1">Arguments </h4>
<div class="outline-text-4" id="text-22-15-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-22-16" class="outline-3">
<h3 id="sec-22-16">UPDATE-IMAGE [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-16">


</div>

<div id="outline-container-22-16-1" class="outline-4">
<h4 id="sec-22-16-1">Arguments </h4>
<div class="outline-text-4" id="text-22-16-1">

<p>(IMAGE)
</p></div>
</div>

</div>

<div id="outline-container-22-17" class="outline-3">
<h3 id="sec-22-17">UPDATE-POSITION [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-17">


</div>

<div id="outline-container-22-17-1" class="outline-4">
<h4 id="sec-22-17-1">Arguments </h4>
<div class="outline-text-4" id="text-22-17-1">

<p>(X Y &amp;OPTIONAL IGNORE-OBSTACLES)
</p></div>
</div>

</div>

<div id="outline-container-22-18" class="outline-3">
<h3 id="sec-22-18">VIEWPORT-COORDINATES [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-18">


</div>

<div id="outline-container-22-18-1" class="outline-4">
<h4 id="sec-22-18-1">Arguments </h4>
<div class="outline-text-4" id="text-22-18-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-22-19" class="outline-3">
<h3 id="sec-22-19">WOULD-COLLIDE [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-19">


</div>

<div id="outline-container-22-19-1" class="outline-4">
<h4 id="sec-22-19-1">Arguments </h4>
<div class="outline-text-4" id="text-22-19-1">

<p>(X0 Y0)
</p></div>
</div>

</div>

<div id="outline-container-22-20" class="outline-3">
<h3 id="sec-22-20">XY-COORDINATES [SPRITE] (method) </h3>
<div class="outline-text-3" id="text-22-20">


</div>

<div id="outline-container-22-20-1" class="outline-4">
<h4 id="sec-22-20-1">Arguments </h4>
<div class="outline-text-4" id="text-22-20-1">

<p>NIL
</p></div>
</div>
</div>

</div>

<div id="outline-container-23" class="outline-2">
<h2 id="sec-23">=STACK= (prototype) </h2>
<div class="outline-text-2" id="text-23">


</div>

<div id="outline-container-23-1" class="outline-3">
<h3 id="sec-23-1">Parent prototype </h3>
<div class="outline-text-3" id="text-23-1">

<pre class="example">
=WIDGET=
</pre>

</div>

</div>

<div id="outline-container-23-2" class="outline-3">
<h3 id="sec-23-2">Documentation </h3>
<div class="outline-text-3" id="text-23-2">

<p>Stack all the child widgets on top of one another in a column.
</p>
</div>

<div id="outline-container-23-2-1" class="outline-4">
<h4 id="sec-23-2-1">Fields </h4>
<div class="outline-text-4" id="text-23-2-1">

<ul>
<li id="sec-23-2-1-1">CHILDREN (field) <br/>
<ul>
<li id="sec-23-2-1-1-1">Documentation <br/>
The widgets in the stack.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-23-2-1-2">KEYMAP (field) <br/>
<ul>
<li id="sec-23-2-1-2-1">Documentation <br/>
A hash table mapping keylists to lambdas.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-23-2-1-3">IMAGE (field) <br/>
<ul>
<li id="sec-23-2-1-3-1">Documentation <br/>
The offscreen image buffer containing the widget's rendered output.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-23-2-1-4">WIDTH (field) <br/>
<ul>
<li id="sec-23-2-1-4-1">Documentation <br/>
The current allocated image width of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-23-2-1-5">HEIGHT (field) <br/>
<ul>
<li id="sec-23-2-1-5-1">Documentation <br/>
The current allocated image height of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-23-2-1-6">VISIBLE (field) <br/>
<ul>
<li id="sec-23-2-1-6-1">Documentation <br/>
The boolean visibility of the widget.
</li>
</ul>
<ul>
<li id="sec-23-2-1-6-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-23-2-1-7">X (field) <br/>
<ul>
<li id="sec-23-2-1-7-1">Documentation <br/>
The screen x-coordinate of the left side of the widget's display area.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-23-2-1-8">Y (field) <br/>
<ul>
<li id="sec-23-2-1-8-1">Documentation <br/>
The screen y-coordinate of the top of the widget's display area.
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-23-3" class="outline-3">
<h3 id="sec-23-3">HIT [STACK] (method) </h3>
<div class="outline-text-3" id="text-23-3">


</div>

<div id="outline-container-23-3-1" class="outline-4">
<h4 id="sec-23-3-1">Arguments </h4>
<div class="outline-text-4" id="text-23-3-1">

<p>(X Y)
</p></div>
</div>

</div>

<div id="outline-container-23-4" class="outline-3">
<h3 id="sec-23-4">INITIALIZE [STACK] (method) </h3>
<div class="outline-text-3" id="text-23-4">


</div>

<div id="outline-container-23-4-1" class="outline-4">
<h4 id="sec-23-4-1">Arguments </h4>
<div class="outline-text-4" id="text-23-4-1">

<p>(&amp;REST CHILDREN)
</p></div>
</div>

</div>

<div id="outline-container-23-5" class="outline-3">
<h3 id="sec-23-5">RENDER [STACK] (method) </h3>
<div class="outline-text-3" id="text-23-5">


</div>

<div id="outline-container-23-5-1" class="outline-4">
<h4 id="sec-23-5-1">Arguments </h4>
<div class="outline-text-4" id="text-23-5-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-23-6" class="outline-3">
<h3 id="sec-23-6">SET-CHILDREN [STACK] (method) </h3>
<div class="outline-text-3" id="text-23-6">


</div>

<div id="outline-container-23-6-1" class="outline-4">
<h4 id="sec-23-6-1">Arguments </h4>
<div class="outline-text-4" id="text-23-6-1">

<p>(CHILDREN)
</p></div>
</div>
</div>

</div>

<div id="outline-container-24" class="outline-2">
<h2 id="sec-24">=TEXTBOX= (prototype) </h2>
<div class="outline-text-2" id="text-24">


</div>

<div id="outline-container-24-1" class="outline-3">
<h3 id="sec-24-1">Parent prototype </h3>
<div class="outline-text-3" id="text-24-1">

<pre class="example">
=WIDGET=
</pre>


</div>

<div id="outline-container-24-1-1" class="outline-4">
<h4 id="sec-24-1-1">Fields </h4>
<div class="outline-text-4" id="text-24-1-1">

<ul>
<li id="sec-24-1-1-1">FONT (field) <br/>
</li>
</ul>
<ul>
<li id="sec-24-1-1-2">BUFFER (field) <br/>
</li>
</ul>
<ul>
<li id="sec-24-1-1-3">BORDERED (field) <br/>
</li>
</ul>
<ul>
<li id="sec-24-1-1-4">MAX-DISPLAYED-ROWS (field) <br/>
<ul>
<li id="sec-24-1-1-4-1">Documentation <br/>
An integer when scrolling is enabled.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-24-1-1-5">MAX-DISPLAYED-COLUMNS (field) <br/>
</li>
</ul>
<ul>
<li id="sec-24-1-1-6">BACKGROUND-COLOR (field) <br/>
</li>
</ul>
<ul>
<li id="sec-24-1-1-7">FOREGROUND-COLOR (field) <br/>
</li>
</ul>
<ul>
<li id="sec-24-1-1-8">CURSOR-COLOR (field) <br/>
</li>
</ul>
<ul>
<li id="sec-24-1-1-9">POINT-ROW (field) <br/>
</li>
</ul>
<ul>
<li id="sec-24-1-1-10">POINT-COLUMN (field) <br/>
</li>
</ul>
<ul>
<li id="sec-24-1-1-11">VISIBLE (field) <br/>
</li>
</ul>
<ul>
<li id="sec-24-1-1-12">KEYMAP (field) <br/>
<ul>
<li id="sec-24-1-1-12-1">Documentation <br/>
A hash table mapping keylists to lambdas.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-24-1-1-13">IMAGE (field) <br/>
<ul>
<li id="sec-24-1-1-13-1">Documentation <br/>
The offscreen image buffer containing the widget's rendered output.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-24-1-1-14">WIDTH (field) <br/>
<ul>
<li id="sec-24-1-1-14-1">Documentation <br/>
The current allocated image width of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-24-1-1-15">HEIGHT (field) <br/>
<ul>
<li id="sec-24-1-1-15-1">Documentation <br/>
The current allocated image height of the widget, in pixels.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-24-1-1-16">VISIBLE (field) <br/>
<ul>
<li id="sec-24-1-1-16-1">Documentation <br/>
The boolean visibility of the widget.
</li>
</ul>
<ul>
<li id="sec-24-1-1-16-2">Initialization form <br/>
<pre class="example">
T
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-24-1-1-17">X (field) <br/>
<ul>
<li id="sec-24-1-1-17-1">Documentation <br/>
The screen x-coordinate of the left side of the widget's display area.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-24-1-1-18">Y (field) <br/>
<ul>
<li id="sec-24-1-1-18-1">Documentation <br/>
The screen y-coordinate of the top of the widget's display area.
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-24-2" class="outline-3">
<h3 id="sec-24-2">AUTO-CENTER [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-2">


</div>

<div id="outline-container-24-2-1" class="outline-4">
<h4 id="sec-24-2-1">Arguments </h4>
<div class="outline-text-4" id="text-24-2-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-24-2-2" class="outline-4">
<h4 id="sec-24-2-2">Documentation </h4>
<div class="outline-text-4" id="text-24-2-2">

<p>Automatically center the textbox on the screen.
</p></div>
</div>

</div>

<div id="outline-container-24-3" class="outline-3">
<h3 id="sec-24-3">BACKWARD-CHAR [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-3">


</div>

<div id="outline-container-24-3-1" class="outline-4">
<h4 id="sec-24-3-1">Arguments </h4>
<div class="outline-text-4" id="text-24-3-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-4" class="outline-3">
<h3 id="sec-24-4">BACKWARD-DELETE-CHAR [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-4">


</div>

<div id="outline-container-24-4-1" class="outline-4">
<h4 id="sec-24-4-1">Arguments </h4>
<div class="outline-text-4" id="text-24-4-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-5" class="outline-3">
<h3 id="sec-24-5">FORWARD-CHAR [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-5">


</div>

<div id="outline-container-24-5-1" class="outline-4">
<h4 id="sec-24-5-1">Arguments </h4>
<div class="outline-text-4" id="text-24-5-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-6" class="outline-3">
<h3 id="sec-24-6">GET-BUFFER-AS-STRING [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-6">


</div>

<div id="outline-container-24-6-1" class="outline-4">
<h4 id="sec-24-6-1">Arguments </h4>
<div class="outline-text-4" id="text-24-6-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-7" class="outline-3">
<h3 id="sec-24-7">INITIALIZE [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-7">


</div>

<div id="outline-container-24-7-1" class="outline-4">
<h4 id="sec-24-7-1">Arguments </h4>
<div class="outline-text-4" id="text-24-7-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-8" class="outline-3">
<h3 id="sec-24-8">INSERT [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-8">


</div>

<div id="outline-container-24-8-1" class="outline-4">
<h4 id="sec-24-8-1">Arguments </h4>
<div class="outline-text-4" id="text-24-8-1">

<p>(KEY)
</p></div>
</div>

</div>

<div id="outline-container-24-9" class="outline-3">
<h3 id="sec-24-9">INSTALL-KEYBINDINGS [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-9">


</div>
