notebook/xe2-reference.org
** MOVE-END-OF-LINE [TEXTBOX] (method)
*** Arguments
NIL
** NEWLINE [TEXTBOX] (method)
*** Arguments
NIL
** NEXT-LINE [TEXTBOX] (method)
*** Arguments
NIL
** PAGE-DOWN [TEXTBOX] (method)
*** Arguments
NIL
*** Documentation
Scroll down one page, only when <max-displayed-rows> is set.
** PAGE-UP [TEXTBOX] (method)
*** Arguments
NIL
*** Documentation
Scroll up one page, only when <max-displayed-rows> is set.
** PREVIOUS-LINE [TEXTBOX] (method)
*** Arguments
NIL
** RENDER [TEXTBOX] (method)
*** Arguments
NIL
** RESIZE-TO-FIT [TEXTBOX] (method)
*** Arguments
NIL
*** Documentation
Automatically resize the textbox to fit the text, and disable scrolling.
This method allocates a new SDL surface when necessary.
** RESIZE-TO-SCROLL [TEXTBOX] (method)
*** Arguments
(&KEY WIDTH HEIGHT)
*** Documentation
Resize the textbox to WIDTH * HEIGHT and enable scrolling of contents.
This method allocates a new SDL surface.
** SET-BUFFER [TEXTBOX] (method)
*** Arguments
(BUFFER)
* =UNIVERSE= (prototype)
** Documentation
A collection of connected worlds.
*** Fields
**** WORLDS (field)
***** Documentation
Address-to-world mapping.
***** Initialization form
: (MAKE-HASH-TABLE :TEST 'EQUAL)
**** PROMPT (field)
**** VIEWPORT (field)
**** CURRENT-ADDRESS (field)
**** PLAYER (field)
**** STACK (field)
**** SPACE (field)
***** Documentation
When non-nil, this vector of worlds
represents the z-axis of a euclidean 3-D space.
** ADD-WORLD [UNIVERSE] (method)
*** Arguments
(ADDRESS WORLD)
** DESTROY [UNIVERSE] (method)
*** Arguments
NIL
** EXIT [UNIVERSE] (method)
*** Arguments
(&KEY PLAYER)
*** Documentation
Return the player to the previous world on the stack.
** FIND-WORLD [UNIVERSE] (method)
*** Arguments
(ADDRESS)
** GENERATE-WORLD [UNIVERSE] (method)
*** Arguments
(ADDRESS)
** GET-CURRENT-ADDRESS [UNIVERSE] (method)
*** Arguments
NIL
** GET-CURRENT-WORLD [UNIVERSE] (method)
*** Arguments
NIL
** GET-NEXT-SPACE [UNIVERSE] (method)
*** Arguments
(INDEX)
** GET-PLAYER [UNIVERSE] (method)
*** Arguments
NIL
** GET-PREVIOUS-SPACE [UNIVERSE] (method)
*** Arguments
(INDEX)
** GET-SPACE-AT [UNIVERSE] (method)
*** Arguments
(INDEX)
** GET-WORLD [UNIVERSE] (method)
*** Arguments
(ADDRESS)
** MAKE-EUCLIDEAN [UNIVERSE] (method)
*** Arguments
NIL
** PLAY [UNIVERSE] (method)
*** Arguments
(&KEY ADDRESS PLAYER PROMPT NARRATOR VIEWPORT)
*** Documentation
Prepare a universe for play at the world identified by ADDRESS with
PLAYER as the player, PROMPT as the prompt, NARRATOR as the
narrator, and VIEWPORT as the viewport.
** REMOVE-WORLD [UNIVERSE] (method)
*** Arguments
(ADDRESS)
** SET-PLAYER [UNIVERSE] (method)
*** Arguments
(PLAYER)
** SET-SPACE-AT [UNIVERSE] (method)
*** Arguments
(INDEX WORLD)
* =VAR-CELL= (prototype)
** Parent prototype
: =CELL=
*** Fields
**** VARIABLE (field)
**** TYPE (field)
**** AUTO-LOADOUT (field)
***** Documentation
When non-nil, the :loadout method is invoked upon entry into a world.
**** TEAM (field)
***** Documentation
Keyword symbol of team, if any.
**** WEIGHT (field)
***** Documentation
Recursively calculate the weight of this cell.
**** WIDGET (field)
***** Documentation
XE2 widget object, if any.
**** TILE (field)
