notebook/xe2-reference.html

<div id="outline-container-24-9-1" class="outline-4">
<h4 id="sec-24-9-1">Arguments </h4>
<div class="outline-text-4" id="text-24-9-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-10" class="outline-3">
<h3 id="sec-24-10">MOVE-BEGINNING-OF-LINE [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-10">


</div>

<div id="outline-container-24-10-1" class="outline-4">
<h4 id="sec-24-10-1">Arguments </h4>
<div class="outline-text-4" id="text-24-10-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-11" class="outline-3">
<h3 id="sec-24-11">MOVE-END-OF-LINE [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-11">


</div>

<div id="outline-container-24-11-1" class="outline-4">
<h4 id="sec-24-11-1">Arguments </h4>
<div class="outline-text-4" id="text-24-11-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-12" class="outline-3">
<h3 id="sec-24-12">NEWLINE [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-12">


</div>

<div id="outline-container-24-12-1" class="outline-4">
<h4 id="sec-24-12-1">Arguments </h4>
<div class="outline-text-4" id="text-24-12-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-13" class="outline-3">
<h3 id="sec-24-13">NEXT-LINE [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-13">


</div>

<div id="outline-container-24-13-1" class="outline-4">
<h4 id="sec-24-13-1">Arguments </h4>
<div class="outline-text-4" id="text-24-13-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-14" class="outline-3">
<h3 id="sec-24-14">PAGE-DOWN [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-14">


</div>

<div id="outline-container-24-14-1" class="outline-4">
<h4 id="sec-24-14-1">Arguments </h4>
<div class="outline-text-4" id="text-24-14-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-24-14-2" class="outline-4">
<h4 id="sec-24-14-2">Documentation </h4>
<div class="outline-text-4" id="text-24-14-2">

<p>Scroll down one page, only when &lt;max-displayed-rows&gt; is set.
</p></div>
</div>

</div>

<div id="outline-container-24-15" class="outline-3">
<h3 id="sec-24-15">PAGE-UP [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-15">


</div>

<div id="outline-container-24-15-1" class="outline-4">
<h4 id="sec-24-15-1">Arguments </h4>
<div class="outline-text-4" id="text-24-15-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-24-15-2" class="outline-4">
<h4 id="sec-24-15-2">Documentation </h4>
<div class="outline-text-4" id="text-24-15-2">

<p>Scroll up one page, only when &lt;max-displayed-rows&gt; is set.
</p></div>
</div>

</div>

<div id="outline-container-24-16" class="outline-3">
<h3 id="sec-24-16">PREVIOUS-LINE [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-16">


</div>

<div id="outline-container-24-16-1" class="outline-4">
<h4 id="sec-24-16-1">Arguments </h4>
<div class="outline-text-4" id="text-24-16-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-17" class="outline-3">
<h3 id="sec-24-17">RENDER [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-17">


</div>

<div id="outline-container-24-17-1" class="outline-4">
<h4 id="sec-24-17-1">Arguments </h4>
<div class="outline-text-4" id="text-24-17-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-24-18" class="outline-3">
<h3 id="sec-24-18">RESIZE-TO-FIT [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-18">


</div>

<div id="outline-container-24-18-1" class="outline-4">
<h4 id="sec-24-18-1">Arguments </h4>
<div class="outline-text-4" id="text-24-18-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-24-18-2" class="outline-4">
<h4 id="sec-24-18-2">Documentation </h4>
<div class="outline-text-4" id="text-24-18-2">

<p>Automatically resize the textbox to fit the text, and disable scrolling.
This method allocates a new SDL surface when necessary.
</p></div>
</div>

</div>

<div id="outline-container-24-19" class="outline-3">
<h3 id="sec-24-19">RESIZE-TO-SCROLL [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-19">


</div>

<div id="outline-container-24-19-1" class="outline-4">
<h4 id="sec-24-19-1">Arguments </h4>
<div class="outline-text-4" id="text-24-19-1">

<p>(&amp;KEY WIDTH HEIGHT)
</p></div>

</div>

<div id="outline-container-24-19-2" class="outline-4">
<h4 id="sec-24-19-2">Documentation </h4>
<div class="outline-text-4" id="text-24-19-2">

<p>Resize the textbox to WIDTH * HEIGHT and enable scrolling of contents.
This method allocates a new SDL surface.
</p></div>
</div>

</div>

<div id="outline-container-24-20" class="outline-3">
<h3 id="sec-24-20">SET-BUFFER [TEXTBOX] (method) </h3>
<div class="outline-text-3" id="text-24-20">


</div>

<div id="outline-container-24-20-1" class="outline-4">
<h4 id="sec-24-20-1">Arguments </h4>
<div class="outline-text-4" id="text-24-20-1">

<p>(BUFFER)
</p></div>
</div>
</div>

</div>

<div id="outline-container-25" class="outline-2">
<h2 id="sec-25">=UNIVERSE= (prototype) </h2>
<div class="outline-text-2" id="text-25">


</div>

<div id="outline-container-25-1" class="outline-3">
<h3 id="sec-25-1">Documentation </h3>
<div class="outline-text-3" id="text-25-1">

<p>A collection of connected worlds.
</p>
</div>

<div id="outline-container-25-1-1" class="outline-4">
<h4 id="sec-25-1-1">Fields </h4>
<div class="outline-text-4" id="text-25-1-1">

<ul>
<li id="sec-25-1-1-1">WORLDS (field) <br/>
<ul>
<li id="sec-25-1-1-1-1">Documentation <br/>
Address-to-world mapping.
</li>
</ul>
<ul>
<li id="sec-25-1-1-1-2">Initialization form <br/>
<pre class="example">
(MAKE-HASH-TABLE :TEST 'EQUAL)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-25-1-1-2">PROMPT (field) <br/>
</li>
</ul>
<ul>
<li id="sec-25-1-1-3">VIEWPORT (field) <br/>
</li>
</ul>
<ul>
<li id="sec-25-1-1-4">CURRENT-ADDRESS (field) <br/>
</li>
</ul>
<ul>
<li id="sec-25-1-1-5">PLAYER (field) <br/>
</li>
</ul>
<ul>
<li id="sec-25-1-1-6">STACK (field) <br/>
</li>
</ul>
<ul>
<li id="sec-25-1-1-7">SPACE (field) <br/>
<ul>
<li id="sec-25-1-1-7-1">Documentation <br/>
When non-nil, this vector of worlds
represents the z-axis of a euclidean 3-D space.
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-25-2" class="outline-3">
<h3 id="sec-25-2">ADD-WORLD [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-2">


</div>

<div id="outline-container-25-2-1" class="outline-4">
<h4 id="sec-25-2-1">Arguments </h4>
<div class="outline-text-4" id="text-25-2-1">

<p>(ADDRESS WORLD)
</p></div>
</div>

</div>

<div id="outline-container-25-3" class="outline-3">
<h3 id="sec-25-3">DESTROY [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-3">


</div>

<div id="outline-container-25-3-1" class="outline-4">
<h4 id="sec-25-3-1">Arguments </h4>
<div class="outline-text-4" id="text-25-3-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-25-4" class="outline-3">
<h3 id="sec-25-4">EXIT [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-4">


</div>

<div id="outline-container-25-4-1" class="outline-4">
<h4 id="sec-25-4-1">Arguments </h4>
<div class="outline-text-4" id="text-25-4-1">

<p>(&amp;KEY PLAYER)
</p></div>

</div>

<div id="outline-container-25-4-2" class="outline-4">
<h4 id="sec-25-4-2">Documentation </h4>
<div class="outline-text-4" id="text-25-4-2">

<p>Return the player to the previous world on the stack.
</p></div>
</div>

</div>

<div id="outline-container-25-5" class="outline-3">
<h3 id="sec-25-5">FIND-WORLD [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-5">


</div>

<div id="outline-container-25-5-1" class="outline-4">
<h4 id="sec-25-5-1">Arguments </h4>
<div class="outline-text-4" id="text-25-5-1">

<p>(ADDRESS)
</p></div>
</div>

</div>

<div id="outline-container-25-6" class="outline-3">
<h3 id="sec-25-6">GENERATE-WORLD [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-6">


</div>

<div id="outline-container-25-6-1" class="outline-4">
<h4 id="sec-25-6-1">Arguments </h4>
<div class="outline-text-4" id="text-25-6-1">

<p>(ADDRESS)
</p></div>
</div>

</div>

<div id="outline-container-25-7" class="outline-3">
<h3 id="sec-25-7">GET-CURRENT-ADDRESS [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-7">


</div>

<div id="outline-container-25-7-1" class="outline-4">
<h4 id="sec-25-7-1">Arguments </h4>
<div class="outline-text-4" id="text-25-7-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-25-8" class="outline-3">
<h3 id="sec-25-8">GET-CURRENT-WORLD [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-8">


</div>

<div id="outline-container-25-8-1" class="outline-4">
<h4 id="sec-25-8-1">Arguments </h4>
<div class="outline-text-4" id="text-25-8-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-25-9" class="outline-3">
<h3 id="sec-25-9">GET-NEXT-SPACE [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-9">


</div>

<div id="outline-container-25-9-1" class="outline-4">
<h4 id="sec-25-9-1">Arguments </h4>
<div class="outline-text-4" id="text-25-9-1">

<p>(INDEX)
</p></div>
</div>

</div>

<div id="outline-container-25-10" class="outline-3">
<h3 id="sec-25-10">GET-PLAYER [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-10">


</div>

<div id="outline-container-25-10-1" class="outline-4">
<h4 id="sec-25-10-1">Arguments </h4>
<div class="outline-text-4" id="text-25-10-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-25-11" class="outline-3">
<h3 id="sec-25-11">GET-PREVIOUS-SPACE [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-11">


</div>

<div id="outline-container-25-11-1" class="outline-4">
<h4 id="sec-25-11-1">Arguments </h4>
<div class="outline-text-4" id="text-25-11-1">

<p>(INDEX)
</p></div>
</div>

</div>

<div id="outline-container-25-12" class="outline-3">
<h3 id="sec-25-12">GET-SPACE-AT [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-12">


</div>

<div id="outline-container-25-12-1" class="outline-4">
<h4 id="sec-25-12-1">Arguments </h4>
<div class="outline-text-4" id="text-25-12-1">

<p>(INDEX)
</p></div>
</div>

</div>

<div id="outline-container-25-13" class="outline-3">
<h3 id="sec-25-13">GET-WORLD [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-13">


</div>

<div id="outline-container-25-13-1" class="outline-4">
<h4 id="sec-25-13-1">Arguments </h4>
<div class="outline-text-4" id="text-25-13-1">

<p>(ADDRESS)
</p></div>
</div>

</div>

<div id="outline-container-25-14" class="outline-3">
<h3 id="sec-25-14">MAKE-EUCLIDEAN [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-14">


</div>

<div id="outline-container-25-14-1" class="outline-4">
<h4 id="sec-25-14-1">Arguments </h4>
<div class="outline-text-4" id="text-25-14-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-25-15" class="outline-3">
<h3 id="sec-25-15">PLAY [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-15">


</div>

<div id="outline-container-25-15-1" class="outline-4">
<h4 id="sec-25-15-1">Arguments </h4>
<div class="outline-text-4" id="text-25-15-1">

<p>(&amp;KEY ADDRESS PLAYER PROMPT NARRATOR VIEWPORT)
</p></div>

</div>

<div id="outline-container-25-15-2" class="outline-4">
<h4 id="sec-25-15-2">Documentation </h4>
<div class="outline-text-4" id="text-25-15-2">

<p>Prepare a universe for play at the world identified by ADDRESS with
PLAYER as the player, PROMPT as the prompt, NARRATOR as the
narrator, and VIEWPORT as the viewport.
</p></div>
</div>

</div>

<div id="outline-container-25-16" class="outline-3">
<h3 id="sec-25-16">REMOVE-WORLD [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-16">


</div>

<div id="outline-container-25-16-1" class="outline-4">
<h4 id="sec-25-16-1">Arguments </h4>
<div class="outline-text-4" id="text-25-16-1">

<p>(ADDRESS)
</p></div>
</div>

</div>

<div id="outline-container-25-17" class="outline-3">
<h3 id="sec-25-17">SET-PLAYER [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-17">


</div>

<div id="outline-container-25-17-1" class="outline-4">
<h4 id="sec-25-17-1">Arguments </h4>
<div class="outline-text-4" id="text-25-17-1">

<p>(PLAYER)
</p></div>
</div>

</div>

<div id="outline-container-25-18" class="outline-3">
<h3 id="sec-25-18">SET-SPACE-AT [UNIVERSE] (method) </h3>
<div class="outline-text-3" id="text-25-18">


</div>

<div id="outline-container-25-18-1" class="outline-4">
<h4 id="sec-25-18-1">Arguments </h4>
<div class="outline-text-4" id="text-25-18-1">

<p>(INDEX WORLD)
</p></div>
</div>
</div>

</div>

<div id="outline-container-26" class="outline-2">
<h2 id="sec-26">=VAR-CELL= (prototype) </h2>
<div class="outline-text-2" id="text-26">


</div>
