notebook/xe2-reference.org
*** Documentation
Return the widget's offscreen drawing image.
** HANDLE-KEY [WIDGET] (method)
*** Arguments
(KEYLIST)
*** Documentation
Look up and invoke the function (if any) bound to KEYLIST. Return t
if a binding was found, nil otherwise.
** HIDE [WIDGET] (method)
*** Arguments
NIL
** HIT [WIDGET] (method)
*** Arguments
(X Y)
*** Documentation
Find a widget by screen position. The default implementation
returns itself when the widget's own onscreen image is clicked.  Child
implementations may do subsequent hit-testing on child widgets, and
possibly return one of them.
** INITIALIZE [WIDGET] (method)
*** Arguments
NIL
** MOVE [WIDGET] (method)
*** Arguments
(&KEY X Y)
*** Documentation
Move the widget to the location X, Y.
** RENDER [WIDGET] (method)
*** Arguments
NIL
*** Documentation
Render the widget to its image. The default implementation leaves
the image blank.
** RESIZE [WIDGET] (method)
*** Arguments
(&KEY HEIGHT WIDTH)
*** Documentation
Allocate an image buffer of HEIGHT by WIDTH pixels.
** SHOW [WIDGET] (method)
*** Arguments
NIL
** TOGGLE-VISIBLE [WIDGET] (method)
*** Arguments
NIL
** UNDEFINE-KEY [WIDGET] (method)
*** Arguments
(KEY-NAME MODIFIERS)
*** Documentation
Remove the described keybinding.
* =WORLD= (prototype)
** Documentation
An XE2 game world filled with cells and sprites.
Worlds are the focus of the action in XE2. A world is a 3-D grid of
interacting cells. The world object performs the following tasks:

  - Keeps track of a single player in a world of cells
  - Receives command messages from the user
  - Handles some messages, forwards the rest on to the player cell.
  - Runs the CPU phase so that all non-player :actor cells get their turns
  - Keeps track of lit squares 
  - Performs collision detection for sprites and cells
*** Fields
**** NAME (field)
***** Documentation
Name of the world.
***** Initialization form
: "Unknown"
**** OVERWORLD (field)
**** PAUSED (field)
***** Documentation
Non-nil when the game is paused.
**** DESCRIPTION (field)
***** Documentation
Brief description of area.
***** Initialization form
: "Unknown area."
**** TILE-SIZE (field)
***** Documentation
Size in pixels of a grid tile.
***** Initialization form
: 16
**** REQUIRED-MODES (field)
***** Documentation
A list of keywords specifying which modes of transportation are
required for travel here.
**** CATEGORIES (field)
***** Documentation
The set of categories this world is in.
**** GRAMMAR (field)
***** Documentation
Context-free grammar for level generation.
***** Initialization form
: 'NIL
**** STACK (field)
***** Documentation
Stack for logo system.
***** Initialization form
: 'NIL
**** ROW (field)
**** COLUMN (field)
**** DIRECTION (field)
**** PAINT (field)
**** SCALE (field)
***** Documentation
Scale per square side in the form (N UNIT) where UNIT is m, km, ly etc.
***** Initialization form
: '(1 M)
**** PLAYER (field)
***** Documentation
The player cell (or sprite).
**** WIDTH (field)
***** Documentation
The width of the world map, measured in tiles.
***** Initialization form
: 16
**** HEIGHT (field)
***** Documentation
The height of the world map, measured in tiles.
***** Initialization form
: 16
**** GRID (field)
***** Documentation
A two-dimensional array of adjustable vectors of cells.
**** SERIALIZED-GRID (field)
***** Documentation
A serialized sexp version.
**** SPRITES (field)
***** Documentation
A list of sprites.
**** SPRITE-GRID (field)
***** Documentation
Grid for collecting sprite collision information.
**** SPRITE-TABLE (field)
***** Documentation
Hash table to prevent redundant collisions.
**** VARIABLES (field)
***** Documentation
Hash table mapping values to values, local to the form.
**** ENVIRONMENT-GRID (field)
***** Documentation
A two-dimensional array of environment data cells.
**** AUTOMAPPED (field)
***** Documentation
Show all previously lit squares.
**** LIGHT-GRID (field)
***** Documentation
A 2d array of integers giving the light level at that point in <grid>.
At the moment, only 0=off and 1=on are supported.
**** AMBIENT-LIGHT (field)
***** Documentation
Radius of ambient visibility. :total means that lighting is turned off.
***** Initialization form
: :TOTAL
**** PHASE-NUMBER (field)
***** Documentation
Integer number of current phase.
***** Initialization form
: 1
**** TURN-NUMBER (field)
