notebook/xe2-reference.html

<div id="outline-container-28-5-1" class="outline-4">
<h4 id="sec-28-5-1">Arguments </h4>
<div class="outline-text-4" id="text-28-5-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-28-5-2" class="outline-4">
<h4 id="sec-28-5-2">Documentation </h4>
<div class="outline-text-4" id="text-28-5-2">

<p>Return the widget's offscreen drawing image.
</p></div>
</div>

</div>

<div id="outline-container-28-6" class="outline-3">
<h3 id="sec-28-6">HANDLE-KEY [WIDGET] (method) </h3>
<div class="outline-text-3" id="text-28-6">


</div>

<div id="outline-container-28-6-1" class="outline-4">
<h4 id="sec-28-6-1">Arguments </h4>
<div class="outline-text-4" id="text-28-6-1">

<p>(KEYLIST)
</p></div>

</div>

<div id="outline-container-28-6-2" class="outline-4">
<h4 id="sec-28-6-2">Documentation </h4>
<div class="outline-text-4" id="text-28-6-2">

<p>Look up and invoke the function (if any) bound to KEYLIST. Return t
if a binding was found, nil otherwise.
</p></div>
</div>

</div>

<div id="outline-container-28-7" class="outline-3">
<h3 id="sec-28-7">HIDE [WIDGET] (method) </h3>
<div class="outline-text-3" id="text-28-7">


</div>

<div id="outline-container-28-7-1" class="outline-4">
<h4 id="sec-28-7-1">Arguments </h4>
<div class="outline-text-4" id="text-28-7-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-28-8" class="outline-3">
<h3 id="sec-28-8">HIT [WIDGET] (method) </h3>
<div class="outline-text-3" id="text-28-8">


</div>

<div id="outline-container-28-8-1" class="outline-4">
<h4 id="sec-28-8-1">Arguments </h4>
<div class="outline-text-4" id="text-28-8-1">

<p>(X Y)
</p></div>

</div>

<div id="outline-container-28-8-2" class="outline-4">
<h4 id="sec-28-8-2">Documentation </h4>
<div class="outline-text-4" id="text-28-8-2">

<p>Find a widget by screen position. The default implementation
returns itself when the widget's own onscreen image is clicked.  Child
implementations may do subsequent hit-testing on child widgets, and
possibly return one of them.
</p></div>
</div>

</div>

<div id="outline-container-28-9" class="outline-3">
<h3 id="sec-28-9">INITIALIZE [WIDGET] (method) </h3>
<div class="outline-text-3" id="text-28-9">


</div>

<div id="outline-container-28-9-1" class="outline-4">
<h4 id="sec-28-9-1">Arguments </h4>
<div class="outline-text-4" id="text-28-9-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-28-10" class="outline-3">
<h3 id="sec-28-10">MOVE [WIDGET] (method) </h3>
<div class="outline-text-3" id="text-28-10">


</div>

<div id="outline-container-28-10-1" class="outline-4">
<h4 id="sec-28-10-1">Arguments </h4>
<div class="outline-text-4" id="text-28-10-1">

<p>(&amp;KEY X Y)
</p></div>

</div>

<div id="outline-container-28-10-2" class="outline-4">
<h4 id="sec-28-10-2">Documentation </h4>
<div class="outline-text-4" id="text-28-10-2">

<p>Move the widget to the location X, Y.
</p></div>
</div>

</div>

<div id="outline-container-28-11" class="outline-3">
<h3 id="sec-28-11">RENDER [WIDGET] (method) </h3>
<div class="outline-text-3" id="text-28-11">


</div>

<div id="outline-container-28-11-1" class="outline-4">
<h4 id="sec-28-11-1">Arguments </h4>
<div class="outline-text-4" id="text-28-11-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-28-11-2" class="outline-4">
<h4 id="sec-28-11-2">Documentation </h4>
<div class="outline-text-4" id="text-28-11-2">

<p>Render the widget to its image. The default implementation leaves
the image blank.
</p></div>
</div>

</div>

<div id="outline-container-28-12" class="outline-3">
<h3 id="sec-28-12">RESIZE [WIDGET] (method) </h3>
<div class="outline-text-3" id="text-28-12">


</div>

<div id="outline-container-28-12-1" class="outline-4">
<h4 id="sec-28-12-1">Arguments </h4>
<div class="outline-text-4" id="text-28-12-1">

<p>(&amp;KEY HEIGHT WIDTH)
</p></div>

</div>

<div id="outline-container-28-12-2" class="outline-4">
<h4 id="sec-28-12-2">Documentation </h4>
<div class="outline-text-4" id="text-28-12-2">

<p>Allocate an image buffer of HEIGHT by WIDTH pixels.
</p></div>
</div>

</div>

<div id="outline-container-28-13" class="outline-3">
<h3 id="sec-28-13">SHOW [WIDGET] (method) </h3>
<div class="outline-text-3" id="text-28-13">


</div>

<div id="outline-container-28-13-1" class="outline-4">
<h4 id="sec-28-13-1">Arguments </h4>
<div class="outline-text-4" id="text-28-13-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-28-14" class="outline-3">
<h3 id="sec-28-14">TOGGLE-VISIBLE [WIDGET] (method) </h3>
<div class="outline-text-3" id="text-28-14">


</div>

<div id="outline-container-28-14-1" class="outline-4">
<h4 id="sec-28-14-1">Arguments </h4>
<div class="outline-text-4" id="text-28-14-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-28-15" class="outline-3">
<h3 id="sec-28-15">UNDEFINE-KEY [WIDGET] (method) </h3>
<div class="outline-text-3" id="text-28-15">


</div>

<div id="outline-container-28-15-1" class="outline-4">
<h4 id="sec-28-15-1">Arguments </h4>
<div class="outline-text-4" id="text-28-15-1">

<p>(KEY-NAME MODIFIERS)
</p></div>

</div>

<div id="outline-container-28-15-2" class="outline-4">
<h4 id="sec-28-15-2">Documentation </h4>
<div class="outline-text-4" id="text-28-15-2">

<p>Remove the described keybinding.
</p></div>
</div>
</div>

</div>

<div id="outline-container-29" class="outline-2">
<h2 id="sec-29">=WORLD= (prototype) </h2>
<div class="outline-text-2" id="text-29">


</div>

<div id="outline-container-29-1" class="outline-3">
<h3 id="sec-29-1">Documentation </h3>
<div class="outline-text-3" id="text-29-1">

<p>An XE2 game world filled with cells and sprites.
Worlds are the focus of the action in XE2. A world is a 3-D grid of
interacting cells. The world object performs the following tasks:
</p>
<ul>
<li>Keeps track of a single player in a world of cells
</li>
<li>Receives command messages from the user
</li>
<li>Handles some messages, forwards the rest on to the player cell.
</li>
<li>Runs the CPU phase so that all non-player :actor cells get their turns
</li>
<li>Keeps track of lit squares 
</li>
<li>Performs collision detection for sprites and cells
</li>
</ul>


</div>

<div id="outline-container-29-1-1" class="outline-4">
<h4 id="sec-29-1-1">Fields </h4>
<div class="outline-text-4" id="text-29-1-1">

<ul>
<li id="sec-29-1-1-1">NAME (field) <br/>
<ul>
<li id="sec-29-1-1-1-1">Documentation <br/>
Name of the world.
</li>
</ul>
<ul>
<li id="sec-29-1-1-1-2">Initialization form <br/>
<pre class="example">
"Unknown"
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-2">OVERWORLD (field) <br/>
</li>
</ul>
<ul>
<li id="sec-29-1-1-3">PAUSED (field) <br/>
<ul>
<li id="sec-29-1-1-3-1">Documentation <br/>
Non-nil when the game is paused.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-4">DESCRIPTION (field) <br/>
<ul>
<li id="sec-29-1-1-4-1">Documentation <br/>
Brief description of area.
</li>
</ul>
<ul>
<li id="sec-29-1-1-4-2">Initialization form <br/>
<pre class="example">
"Unknown area."
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-5">TILE-SIZE (field) <br/>
<ul>
<li id="sec-29-1-1-5-1">Documentation <br/>
Size in pixels of a grid tile.
</li>
</ul>
<ul>
<li id="sec-29-1-1-5-2">Initialization form <br/>
<pre class="example">
16
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-6">REQUIRED-MODES (field) <br/>
<ul>
<li id="sec-29-1-1-6-1">Documentation <br/>
A list of keywords specifying which modes of transportation are
required for travel here.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-7">CATEGORIES (field) <br/>
<ul>
<li id="sec-29-1-1-7-1">Documentation <br/>
The set of categories this world is in.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-8">GRAMMAR (field) <br/>
<ul>
<li id="sec-29-1-1-8-1">Documentation <br/>
Context-free grammar for level generation.
</li>
</ul>
<ul>
<li id="sec-29-1-1-8-2">Initialization form <br/>
<pre class="example">
'NIL
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-9">STACK (field) <br/>
<ul>
<li id="sec-29-1-1-9-1">Documentation <br/>
Stack for logo system.
</li>
</ul>
<ul>
<li id="sec-29-1-1-9-2">Initialization form <br/>
<pre class="example">
'NIL
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-10">ROW (field) <br/>
</li>
</ul>
<ul>
<li id="sec-29-1-1-11">COLUMN (field) <br/>
</li>
</ul>
<ul>
<li id="sec-29-1-1-12">DIRECTION (field) <br/>
</li>
</ul>
<ul>
<li id="sec-29-1-1-13">PAINT (field) <br/>
</li>
</ul>
<ul>
<li id="sec-29-1-1-14">SCALE (field) <br/>
<ul>
<li id="sec-29-1-1-14-1">Documentation <br/>
Scale per square side in the form (N UNIT) where UNIT is m, km, ly etc.
</li>
</ul>
<ul>
<li id="sec-29-1-1-14-2">Initialization form <br/>
<pre class="example">
'(1 M)
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-15">PLAYER (field) <br/>
<ul>
<li id="sec-29-1-1-15-1">Documentation <br/>
The player cell (or sprite).
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-16">WIDTH (field) <br/>
<ul>
<li id="sec-29-1-1-16-1">Documentation <br/>
The width of the world map, measured in tiles.
</li>
</ul>
<ul>
<li id="sec-29-1-1-16-2">Initialization form <br/>
<pre class="example">
16
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-17">HEIGHT (field) <br/>
<ul>
<li id="sec-29-1-1-17-1">Documentation <br/>
The height of the world map, measured in tiles.
</li>
</ul>
<ul>
<li id="sec-29-1-1-17-2">Initialization form <br/>
<pre class="example">
16
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-18">GRID (field) <br/>
<ul>
<li id="sec-29-1-1-18-1">Documentation <br/>
A two-dimensional array of adjustable vectors of cells.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-19">SERIALIZED-GRID (field) <br/>
<ul>
<li id="sec-29-1-1-19-1">Documentation <br/>
A serialized sexp version.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-20">SPRITES (field) <br/>
<ul>
<li id="sec-29-1-1-20-1">Documentation <br/>
A list of sprites.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-21">SPRITE-GRID (field) <br/>
<ul>
<li id="sec-29-1-1-21-1">Documentation <br/>
Grid for collecting sprite collision information.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-22">SPRITE-TABLE (field) <br/>
<ul>
<li id="sec-29-1-1-22-1">Documentation <br/>
Hash table to prevent redundant collisions.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-23">VARIABLES (field) <br/>
<ul>
<li id="sec-29-1-1-23-1">Documentation <br/>
Hash table mapping values to values, local to the form.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-24">ENVIRONMENT-GRID (field) <br/>
<ul>
<li id="sec-29-1-1-24-1">Documentation <br/>
A two-dimensional array of environment data cells.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-25">AUTOMAPPED (field) <br/>
<ul>
<li id="sec-29-1-1-25-1">Documentation <br/>
Show all previously lit squares.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-26">LIGHT-GRID (field) <br/>
<ul>
<li id="sec-29-1-1-26-1">Documentation <br/>
A 2d array of integers giving the light level at that point in &lt;grid&gt;.
At the moment, only 0=off and 1=on are supported.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-27">AMBIENT-LIGHT (field) <br/>
<ul>
<li id="sec-29-1-1-27-1">Documentation <br/>
Radius of ambient visibility. :total means that lighting is turned off.
</li>
</ul>
<ul>
<li id="sec-29-1-1-27-2">Initialization form <br/>
<pre class="example">
:TOTAL
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-28">PHASE-NUMBER (field) <br/>
<ul>
<li id="sec-29-1-1-28-1">Documentation <br/>
Integer number of current phase.
</li>
</ul>
<ul>
<li id="sec-29-1-1-28-2">Initialization form <br/>
<pre class="example">
1
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-29">TURN-NUMBER (field) <br/>
<ul>
<li id="sec-29-1-1-29-1">Documentation <br/>
