notebook/xe2-reference.org
***** Documentation
Integer number of elapsed user turns (actions).
***** Initialization form
: 1
**** MESSAGE-QUEUE (field)
**** NARRATOR (field)
***** Documentation
The narration widget object.
**** BROWSER (field)
***** Documentation
The browser object.
**** VIEWPORT (field)
***** Documentation
The viewport object.
**** EDGE-CONDITION (field)
***** Documentation
Either :block the player, :exit the world, or :wrap around.
***** Initialization form
: :EXIT
**** EXITED (field)
***** Documentation
Non-nil when the player has exited. See also `forward'.
**** PLAYER-EXIT-ROW (field)
**** PLAYER-EXIT-COLUMN (field)
**** EXCLUDED-FIELDS (field)
** ADD-SPRITE [WORLD] (method)
*** Arguments
(SPRITE)
** ADJACENT-TO-PLAYER [WORLD] (method)
*** Arguments
(ROW COLUMN)
*** Documentation
Return non-nil when ROW, COLUMN is adjacent to the player.
** AFTER-START-METHOD [WORLD] (method)
*** Arguments
NIL
** BEGIN-AMBIENT-LOOP [WORLD] (method)
*** Arguments
NIL
*** Documentation
Begin looping your music for this world here.
** CATEGORY-AT-P [WORLD] (method)
*** Arguments
(ROW COLUMN CATEGORY)
*** Documentation
Returns non-nil if there is any cell in CATEGORY at ROW, COLUMN.
CATEGORY may be a list of keyword symbols or one keyword symbol.
** CATEGORY-IN-DIRECTION-P [WORLD] (method)
*** Arguments
(ROW COLUMN DIRECTION CATEGORY)
*** Documentation
Return non-nil when there is a cell in CATEGORY one step in
DIRECTION from ROW, COLUMN. CATEGORY may be a list as well.
** CELLS-AT [WORLD] (method)
*** Arguments
(ROW COLUMN)
*** Documentation
Return the vector of cells at ROW, COLUMN in the world SELF.
** CLEAR-LIGHT-GRID [WORLD] (method)
*** Arguments
NIL
** CLEAR-SPRITE-GRID [WORLD] (method)
*** Arguments
NIL
** COLLIDE-SPRITES [WORLD] (method)
*** Arguments
(&OPTIONAL SPRITES)
*** Documentation
Perform collision detection between sprites and the grid.
Sends a :do-collision message for every detected collision.
** COLOR [WORLD] (method)
*** Arguments
NIL
*** Documentation
Set the color to =FOO= where FOO is the prototype symbol on top of
the stack.
** CREATE-DEFAULT-GRID [WORLD] (method)
*** Arguments
NIL
*** Documentation
If height and width have been set in a world's definition,
initialize the arrays for a world of the size specified there.
** CREATE-GRID [WORLD] (method)
*** Arguments
(&KEY WIDTH HEIGHT)
*** Documentation
Initialize all the arrays for a world of WIDTH by HEIGHT cells.
** DELETE-CATEGORY-AT [WORLD] (method)
*** Arguments
(ROW COLUMN CATEGORY)
*** Documentation
Delete all cells in CATEGORY at ROW, COLUMN in the grid.
The cells' :cancel method is invoked.
** DELETE-CELL [WORLD] (method)
*** Arguments
(CELL ROW COLUMN)
*** Documentation
Delete CELL from the grid at ROW, COLUMN.
** DESCRIBE [WORLD] (method)
*** Arguments
(&OPTIONAL DESCRIPTION)
** DESERIALIZE [WORLD] (method)
*** Arguments
(SEXP)
*** Documentation
Load a saved world from Lisp data.
** DIRECTION-TO-PLAYER [WORLD] (method)
*** Arguments
(ROW COLUMN)
*** Documentation
Return the general compass direction of the player from ROW, COLUMN.
** DISTANCE-TO-PLAYER [WORLD] (method)
*** Arguments
(ROW COLUMN)
*** Documentation
Return the straight-line distance to the player from ROW, COLUMN.
** DRAW [WORLD] (method)
*** Arguments
NIL
*** Documentation
Move N squares forward while painting cells. Clones N cells where N
is the integer on the top of the stack.
** DROP [WORLD] (method)
*** Arguments
NIL
