notebook/xe2-reference.html
Integer number of elapsed user turns (actions).
</li>
</ul>
<ul>
<li id="sec-29-1-1-29-2">Initialization form <br/>
<pre class="example">
1
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-30">MESSAGE-QUEUE (field) <br/>
</li>
</ul>
<ul>
<li id="sec-29-1-1-31">NARRATOR (field) <br/>
<ul>
<li id="sec-29-1-1-31-1">Documentation <br/>
The narration widget object.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-32">BROWSER (field) <br/>
<ul>
<li id="sec-29-1-1-32-1">Documentation <br/>
The browser object.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-33">VIEWPORT (field) <br/>
<ul>
<li id="sec-29-1-1-33-1">Documentation <br/>
The viewport object.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-34">EDGE-CONDITION (field) <br/>
<ul>
<li id="sec-29-1-1-34-1">Documentation <br/>
Either :block the player, :exit the world, or :wrap around.
</li>
</ul>
<ul>
<li id="sec-29-1-1-34-2">Initialization form <br/>
<pre class="example">
:EXIT
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-35">EXITED (field) <br/>
<ul>
<li id="sec-29-1-1-35-1">Documentation <br/>
Non-nil when the player has exited. See also `forward'.
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-29-1-1-36">PLAYER-EXIT-ROW (field) <br/>
</li>
</ul>
<ul>
<li id="sec-29-1-1-37">PLAYER-EXIT-COLUMN (field) <br/>
</li>
</ul>
<ul>
<li id="sec-29-1-1-38">EXCLUDED-FIELDS (field) <br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-29-2" class="outline-3">
<h3 id="sec-29-2">ADD-SPRITE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-2">


</div>

<div id="outline-container-29-2-1" class="outline-4">
<h4 id="sec-29-2-1">Arguments </h4>
<div class="outline-text-4" id="text-29-2-1">

<p>(SPRITE)
</p></div>
</div>

</div>

<div id="outline-container-29-3" class="outline-3">
<h3 id="sec-29-3">ADJACENT-TO-PLAYER [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-3">


</div>

<div id="outline-container-29-3-1" class="outline-4">
<h4 id="sec-29-3-1">Arguments </h4>
<div class="outline-text-4" id="text-29-3-1">

<p>(ROW COLUMN)
</p></div>

</div>

<div id="outline-container-29-3-2" class="outline-4">
<h4 id="sec-29-3-2">Documentation </h4>
<div class="outline-text-4" id="text-29-3-2">

<p>Return non-nil when ROW, COLUMN is adjacent to the player.
</p></div>
</div>

</div>

<div id="outline-container-29-4" class="outline-3">
<h3 id="sec-29-4">AFTER-START-METHOD [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-4">


</div>

<div id="outline-container-29-4-1" class="outline-4">
<h4 id="sec-29-4-1">Arguments </h4>
<div class="outline-text-4" id="text-29-4-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-29-5" class="outline-3">
<h3 id="sec-29-5">BEGIN-AMBIENT-LOOP [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-5">


</div>

<div id="outline-container-29-5-1" class="outline-4">
<h4 id="sec-29-5-1">Arguments </h4>
<div class="outline-text-4" id="text-29-5-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-5-2" class="outline-4">
<h4 id="sec-29-5-2">Documentation </h4>
<div class="outline-text-4" id="text-29-5-2">

<p>Begin looping your music for this world here.
</p></div>
</div>

</div>

<div id="outline-container-29-6" class="outline-3">
<h3 id="sec-29-6">CATEGORY-AT-P [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-6">


</div>

<div id="outline-container-29-6-1" class="outline-4">
<h4 id="sec-29-6-1">Arguments </h4>
<div class="outline-text-4" id="text-29-6-1">

<p>(ROW COLUMN CATEGORY)
</p></div>

</div>

<div id="outline-container-29-6-2" class="outline-4">
<h4 id="sec-29-6-2">Documentation </h4>
<div class="outline-text-4" id="text-29-6-2">

<p>Returns non-nil if there is any cell in CATEGORY at ROW, COLUMN.
CATEGORY may be a list of keyword symbols or one keyword symbol.
</p></div>
</div>

</div>

<div id="outline-container-29-7" class="outline-3">
<h3 id="sec-29-7">CATEGORY-IN-DIRECTION-P [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-7">


</div>

<div id="outline-container-29-7-1" class="outline-4">
<h4 id="sec-29-7-1">Arguments </h4>
<div class="outline-text-4" id="text-29-7-1">

<p>(ROW COLUMN DIRECTION CATEGORY)
</p></div>

</div>

<div id="outline-container-29-7-2" class="outline-4">
<h4 id="sec-29-7-2">Documentation </h4>
<div class="outline-text-4" id="text-29-7-2">

<p>Return non-nil when there is a cell in CATEGORY one step in
DIRECTION from ROW, COLUMN. CATEGORY may be a list as well.
</p></div>
</div>

</div>

<div id="outline-container-29-8" class="outline-3">
<h3 id="sec-29-8">CELLS-AT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-8">


</div>

<div id="outline-container-29-8-1" class="outline-4">
<h4 id="sec-29-8-1">Arguments </h4>
<div class="outline-text-4" id="text-29-8-1">

<p>(ROW COLUMN)
</p></div>

</div>

<div id="outline-container-29-8-2" class="outline-4">
<h4 id="sec-29-8-2">Documentation </h4>
<div class="outline-text-4" id="text-29-8-2">

<p>Return the vector of cells at ROW, COLUMN in the world SELF.
</p></div>
</div>

</div>

<div id="outline-container-29-9" class="outline-3">
<h3 id="sec-29-9">CLEAR-LIGHT-GRID [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-9">


</div>

<div id="outline-container-29-9-1" class="outline-4">
<h4 id="sec-29-9-1">Arguments </h4>
<div class="outline-text-4" id="text-29-9-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-29-10" class="outline-3">
<h3 id="sec-29-10">CLEAR-SPRITE-GRID [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-10">


</div>

<div id="outline-container-29-10-1" class="outline-4">
<h4 id="sec-29-10-1">Arguments </h4>
<div class="outline-text-4" id="text-29-10-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-29-11" class="outline-3">
<h3 id="sec-29-11">COLLIDE-SPRITES [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-11">


</div>

<div id="outline-container-29-11-1" class="outline-4">
<h4 id="sec-29-11-1">Arguments </h4>
<div class="outline-text-4" id="text-29-11-1">

<p>(&amp;OPTIONAL SPRITES)
</p></div>

</div>

<div id="outline-container-29-11-2" class="outline-4">
<h4 id="sec-29-11-2">Documentation </h4>
<div class="outline-text-4" id="text-29-11-2">

<p>Perform collision detection between sprites and the grid.
Sends a :do-collision message for every detected collision.
</p></div>
</div>

</div>

<div id="outline-container-29-12" class="outline-3">
<h3 id="sec-29-12">COLOR [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-12">


</div>

<div id="outline-container-29-12-1" class="outline-4">
<h4 id="sec-29-12-1">Arguments </h4>
<div class="outline-text-4" id="text-29-12-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-12-2" class="outline-4">
<h4 id="sec-29-12-2">Documentation </h4>
<div class="outline-text-4" id="text-29-12-2">

<p>Set the color to =FOO= where FOO is the prototype symbol on top of
the stack.
</p></div>
</div>

</div>

<div id="outline-container-29-13" class="outline-3">
<h3 id="sec-29-13">CREATE-DEFAULT-GRID [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-13">


</div>

<div id="outline-container-29-13-1" class="outline-4">
<h4 id="sec-29-13-1">Arguments </h4>
<div class="outline-text-4" id="text-29-13-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-13-2" class="outline-4">
<h4 id="sec-29-13-2">Documentation </h4>
<div class="outline-text-4" id="text-29-13-2">

<p>If height and width have been set in a world's definition,
initialize the arrays for a world of the size specified there.
</p></div>
</div>

</div>

<div id="outline-container-29-14" class="outline-3">
<h3 id="sec-29-14">CREATE-GRID [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-14">


</div>

<div id="outline-container-29-14-1" class="outline-4">
<h4 id="sec-29-14-1">Arguments </h4>
<div class="outline-text-4" id="text-29-14-1">

<p>(&amp;KEY WIDTH HEIGHT)
</p></div>

</div>

<div id="outline-container-29-14-2" class="outline-4">
<h4 id="sec-29-14-2">Documentation </h4>
<div class="outline-text-4" id="text-29-14-2">

<p>Initialize all the arrays for a world of WIDTH by HEIGHT cells.
</p></div>
</div>

</div>

<div id="outline-container-29-15" class="outline-3">
<h3 id="sec-29-15">DELETE-CATEGORY-AT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-15">


</div>

<div id="outline-container-29-15-1" class="outline-4">
<h4 id="sec-29-15-1">Arguments </h4>
<div class="outline-text-4" id="text-29-15-1">

<p>(ROW COLUMN CATEGORY)
</p></div>

</div>

<div id="outline-container-29-15-2" class="outline-4">
<h4 id="sec-29-15-2">Documentation </h4>
<div class="outline-text-4" id="text-29-15-2">

<p>Delete all cells in CATEGORY at ROW, COLUMN in the grid.
The cells' :cancel method is invoked.
</p></div>
</div>

</div>

<div id="outline-container-29-16" class="outline-3">
<h3 id="sec-29-16">DELETE-CELL [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-16">


</div>

<div id="outline-container-29-16-1" class="outline-4">
<h4 id="sec-29-16-1">Arguments </h4>
<div class="outline-text-4" id="text-29-16-1">

<p>(CELL ROW COLUMN)
</p></div>

</div>

<div id="outline-container-29-16-2" class="outline-4">
<h4 id="sec-29-16-2">Documentation </h4>
<div class="outline-text-4" id="text-29-16-2">

<p>Delete CELL from the grid at ROW, COLUMN.
</p></div>
</div>

</div>

<div id="outline-container-29-17" class="outline-3">
<h3 id="sec-29-17">DESCRIBE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-17">


</div>

<div id="outline-container-29-17-1" class="outline-4">
<h4 id="sec-29-17-1">Arguments </h4>
<div class="outline-text-4" id="text-29-17-1">

<p>(&amp;OPTIONAL DESCRIPTION)
</p></div>
</div>

</div>

<div id="outline-container-29-18" class="outline-3">
<h3 id="sec-29-18">DESERIALIZE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-18">


</div>

<div id="outline-container-29-18-1" class="outline-4">
<h4 id="sec-29-18-1">Arguments </h4>
<div class="outline-text-4" id="text-29-18-1">

<p>(SEXP)
</p></div>

</div>

<div id="outline-container-29-18-2" class="outline-4">
<h4 id="sec-29-18-2">Documentation </h4>
<div class="outline-text-4" id="text-29-18-2">

<p>Load a saved world from Lisp data.
</p></div>
</div>

</div>

<div id="outline-container-29-19" class="outline-3">
<h3 id="sec-29-19">DIRECTION-TO-PLAYER [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-19">


</div>

<div id="outline-container-29-19-1" class="outline-4">
<h4 id="sec-29-19-1">Arguments </h4>
<div class="outline-text-4" id="text-29-19-1">

<p>(ROW COLUMN)
</p></div>

</div>

<div id="outline-container-29-19-2" class="outline-4">
<h4 id="sec-29-19-2">Documentation </h4>
<div class="outline-text-4" id="text-29-19-2">

<p>Return the general compass direction of the player from ROW, COLUMN.
</p></div>
</div>

</div>

<div id="outline-container-29-20" class="outline-3">
<h3 id="sec-29-20">DISTANCE-TO-PLAYER [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-20">


</div>

<div id="outline-container-29-20-1" class="outline-4">
<h4 id="sec-29-20-1">Arguments </h4>
<div class="outline-text-4" id="text-29-20-1">

<p>(ROW COLUMN)
</p></div>

</div>

<div id="outline-container-29-20-2" class="outline-4">
<h4 id="sec-29-20-2">Documentation </h4>
<div class="outline-text-4" id="text-29-20-2">

<p>Return the straight-line distance to the player from ROW, COLUMN.
</p></div>
</div>

</div>

<div id="outline-container-29-21" class="outline-3">
<h3 id="sec-29-21">DRAW [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-21">


</div>

<div id="outline-container-29-21-1" class="outline-4">
<h4 id="sec-29-21-1">Arguments </h4>
<div class="outline-text-4" id="text-29-21-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-21-2" class="outline-4">
<h4 id="sec-29-21-2">Documentation </h4>
<div class="outline-text-4" id="text-29-21-2">

<p>Move N squares forward while painting cells. Clones N cells where N
is the integer on the top of the stack.
</p></div>
</div>

</div>

<div id="outline-container-29-22" class="outline-3">
<h3 id="sec-29-22">DROP [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-22">


</div>
