notebook/xe2-reference.org
*** Documentation
Clone the current <paint> object and drop it at the current turtle
location.
** DROP-CELL [WORLD] (method)
*** Arguments
(CELL ROW COLUMN &OPTIONAL &KEY LOADOUT NO-STEPPING NO-COLLISIONS (EXCLUSIVE T)
 (PROBE T))
*** Documentation
Put the cell CELL on top of the stack of cells at ROW,
COLUMN. If LOADOUT is non-nil, then the `loadout' method of the
dropped cell is invoked after dropping. If the field <auto-loadout> is
non-nil in the CELL, then the `loadout' method is invoked regardless
of the value of LOADOUT.

If NO-COLLISIONS is non-nil, then an object is not dropped on top of
an obstacle. If EXCLUSIVE is non-nil, then two objects with
category :exclusive will not be placed together. If PROBE is non-nil,
try to place the cell in the immediate neighborhood.  Return T if a
cell is placed; nil otherwise.
** DROP-ENTRY-POINT [WORLD] (method)
*** Arguments
(ROW COLUMN)
** DROP-PLAYER-AT-ENTRY [WORLD] (method)
*** Arguments
(PLAYER)
*** Documentation
Drop the PLAYER at the first entry point.
** DROP-PLAYER-AT-LAST-LOCATION [WORLD] (method)
*** Arguments
(PLAYER)
** DROP-SPRITE [WORLD] (method)
*** Arguments
(SPRITE X Y &KEY NO-COLLISIONS LOADOUT)
*** Documentation
Add a sprite to the world. When NO-COLLISIONS is non-nil, then the
object will not be dropped when there is an obstacle. When LOADOUT is
non-nil, the :loadout method is invoked on the sprite after
placement.
** ENVIRONMENT-AT [WORLD] (method)
*** Arguments
(ROW COLUMN)
** ENVIRONMENT-CONDITION-AT [WORLD] (method)
*** Arguments
(ROW COLUMN CONDITION)
** EXIT [WORLD] (method)
*** Arguments
NIL
*** Documentation
Leave the current world.
** FORWARD [WORLD] (method)
*** Arguments
(METHOD-KEY &REST ARGS)
*** Documentation
Send unhandled messages to the player object.
** GENERATE [WORLD] (method)
*** Arguments
(&REST PARAMETERS)
*** Documentation
Generate a world, reading generation parameters from the plist
PARAMETERS and interpreting the world's grammar field <GRAMMAR>.
** GENERATE-WITH [WORLD] (method)
*** Arguments
(PARAMETERS)
** GET-PHASE-NUMBER [WORLD] (method)
*** Arguments
NIL
** GET-PLAYER [WORLD] (method)
*** Arguments
NIL
** GET-VARIABLE [WORLD] (method)
*** Arguments
(VAR)
** IN-BOUNDS-P [WORLD] (method)
*** Arguments
(ROW COLUMN)
*** Documentation
Return non-nil if ROW and COLUMN are valid coordinates.
** IN-CATEGORY [WORLD] (method)
*** Arguments
(CATEGORY)
*** Documentation
Returns non-nil when the cell SELF is in the category CATEGORY.
** INITIALIZE [WORLD] (method)
*** Arguments
NIL
** JUMP [WORLD] (method)
*** Arguments
NIL
*** Documentation
Jump N squares forward where N is the integer on the top of the stack.
** LEFT [WORLD] (method)
*** Arguments
NIL
*** Documentation
Turn N degrees counter-clockwise, where N is 0, 45, or 90.
** LINE-OF-SIGHT [WORLD] (method)
*** Arguments
(R1 C1 R2 C2 &OPTIONAL (CATEGORY OBSTACLE))
*** Documentation
Return non-nil when there is a direct Bresenham's line of sight
along grid squares between R1,C1 and R2,C2.
** LOCATION-NAME [WORLD] (method)
*** Arguments
NIL
*** Documentation
Return the location name.
** MOVE-CELL [WORLD] (method)
*** Arguments
(CELL ROW COLUMN)
*** Documentation
Move CELL to ROW, COLUMN.
** NOOP [WORLD] (method)
*** Arguments
NIL
** NTH-CELL [WORLD] (method)
*** Arguments
(N ROW COLUMN)
** OBSTACLE-AT-P [WORLD] (method)
*** Arguments
(ROW COLUMN)
