notebook/xe2-reference.html

<div id="outline-container-29-22-1" class="outline-4">
<h4 id="sec-29-22-1">Arguments </h4>
<div class="outline-text-4" id="text-29-22-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-22-2" class="outline-4">
<h4 id="sec-29-22-2">Documentation </h4>
<div class="outline-text-4" id="text-29-22-2">

<p>Clone the current &lt;paint&gt; object and drop it at the current turtle
location.
</p></div>
</div>

</div>

<div id="outline-container-29-23" class="outline-3">
<h3 id="sec-29-23">DROP-CELL [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-23">


</div>

<div id="outline-container-29-23-1" class="outline-4">
<h4 id="sec-29-23-1">Arguments </h4>
<div class="outline-text-4" id="text-29-23-1">

<p>(CELL ROW COLUMN &amp;OPTIONAL &amp;KEY LOADOUT NO-STEPPING NO-COLLISIONS (EXCLUSIVE T)
 (PROBE T))
</p></div>

</div>

<div id="outline-container-29-23-2" class="outline-4">
<h4 id="sec-29-23-2">Documentation </h4>
<div class="outline-text-4" id="text-29-23-2">

<p>Put the cell CELL on top of the stack of cells at ROW,
COLUMN. If LOADOUT is non-nil, then the `loadout' method of the
dropped cell is invoked after dropping. If the field &lt;auto-loadout&gt; is
non-nil in the CELL, then the `loadout' method is invoked regardless
of the value of LOADOUT.
</p>
<p>
If NO-COLLISIONS is non-nil, then an object is not dropped on top of
an obstacle. If EXCLUSIVE is non-nil, then two objects with
category :exclusive will not be placed together. If PROBE is non-nil,
try to place the cell in the immediate neighborhood.  Return T if a
cell is placed; nil otherwise.
</p></div>
</div>

</div>

<div id="outline-container-29-24" class="outline-3">
<h3 id="sec-29-24">DROP-ENTRY-POINT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-24">


</div>

<div id="outline-container-29-24-1" class="outline-4">
<h4 id="sec-29-24-1">Arguments </h4>
<div class="outline-text-4" id="text-29-24-1">

<p>(ROW COLUMN)
</p></div>
</div>

</div>

<div id="outline-container-29-25" class="outline-3">
<h3 id="sec-29-25">DROP-PLAYER-AT-ENTRY [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-25">


</div>

<div id="outline-container-29-25-1" class="outline-4">
<h4 id="sec-29-25-1">Arguments </h4>
<div class="outline-text-4" id="text-29-25-1">

<p>(PLAYER)
</p></div>

</div>

<div id="outline-container-29-25-2" class="outline-4">
<h4 id="sec-29-25-2">Documentation </h4>
<div class="outline-text-4" id="text-29-25-2">

<p>Drop the PLAYER at the first entry point.
</p></div>
</div>

</div>

<div id="outline-container-29-26" class="outline-3">
<h3 id="sec-29-26">DROP-PLAYER-AT-LAST-LOCATION [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-26">


</div>

<div id="outline-container-29-26-1" class="outline-4">
<h4 id="sec-29-26-1">Arguments </h4>
<div class="outline-text-4" id="text-29-26-1">

<p>(PLAYER)
</p></div>
</div>

</div>

<div id="outline-container-29-27" class="outline-3">
<h3 id="sec-29-27">DROP-SPRITE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-27">


</div>

<div id="outline-container-29-27-1" class="outline-4">
<h4 id="sec-29-27-1">Arguments </h4>
<div class="outline-text-4" id="text-29-27-1">

<p>(SPRITE X Y &amp;KEY NO-COLLISIONS LOADOUT)
</p></div>

</div>

<div id="outline-container-29-27-2" class="outline-4">
<h4 id="sec-29-27-2">Documentation </h4>
<div class="outline-text-4" id="text-29-27-2">

<p>Add a sprite to the world. When NO-COLLISIONS is non-nil, then the
object will not be dropped when there is an obstacle. When LOADOUT is
non-nil, the :loadout method is invoked on the sprite after
placement.
</p></div>
</div>

</div>

<div id="outline-container-29-28" class="outline-3">
<h3 id="sec-29-28">ENVIRONMENT-AT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-28">


</div>

<div id="outline-container-29-28-1" class="outline-4">
<h4 id="sec-29-28-1">Arguments </h4>
<div class="outline-text-4" id="text-29-28-1">

<p>(ROW COLUMN)
</p></div>
</div>

</div>

<div id="outline-container-29-29" class="outline-3">
<h3 id="sec-29-29">ENVIRONMENT-CONDITION-AT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-29">


</div>

<div id="outline-container-29-29-1" class="outline-4">
<h4 id="sec-29-29-1">Arguments </h4>
<div class="outline-text-4" id="text-29-29-1">

<p>(ROW COLUMN CONDITION)
</p></div>
</div>

</div>

<div id="outline-container-29-30" class="outline-3">
<h3 id="sec-29-30">EXIT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-30">


</div>

<div id="outline-container-29-30-1" class="outline-4">
<h4 id="sec-29-30-1">Arguments </h4>
<div class="outline-text-4" id="text-29-30-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-30-2" class="outline-4">
<h4 id="sec-29-30-2">Documentation </h4>
<div class="outline-text-4" id="text-29-30-2">

<p>Leave the current world.
</p></div>
</div>

</div>

<div id="outline-container-29-31" class="outline-3">
<h3 id="sec-29-31">FORWARD [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-31">


</div>

<div id="outline-container-29-31-1" class="outline-4">
<h4 id="sec-29-31-1">Arguments </h4>
<div class="outline-text-4" id="text-29-31-1">

<p>(METHOD-KEY &amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-29-31-2" class="outline-4">
<h4 id="sec-29-31-2">Documentation </h4>
<div class="outline-text-4" id="text-29-31-2">

<p>Send unhandled messages to the player object.
</p></div>
</div>

</div>

<div id="outline-container-29-32" class="outline-3">
<h3 id="sec-29-32">GENERATE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-32">


</div>

<div id="outline-container-29-32-1" class="outline-4">
<h4 id="sec-29-32-1">Arguments </h4>
<div class="outline-text-4" id="text-29-32-1">

<p>(&amp;REST PARAMETERS)
</p></div>

</div>

<div id="outline-container-29-32-2" class="outline-4">
<h4 id="sec-29-32-2">Documentation </h4>
<div class="outline-text-4" id="text-29-32-2">

<p>Generate a world, reading generation parameters from the plist
PARAMETERS and interpreting the world's grammar field &lt;GRAMMAR&gt;.
</p></div>
</div>

</div>

<div id="outline-container-29-33" class="outline-3">
<h3 id="sec-29-33">GENERATE-WITH [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-33">


</div>

<div id="outline-container-29-33-1" class="outline-4">
<h4 id="sec-29-33-1">Arguments </h4>
<div class="outline-text-4" id="text-29-33-1">

<p>(PARAMETERS)
</p></div>
</div>

</div>

<div id="outline-container-29-34" class="outline-3">
<h3 id="sec-29-34">GET-PHASE-NUMBER [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-34">


</div>

<div id="outline-container-29-34-1" class="outline-4">
<h4 id="sec-29-34-1">Arguments </h4>
<div class="outline-text-4" id="text-29-34-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-29-35" class="outline-3">
<h3 id="sec-29-35">GET-PLAYER [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-35">


</div>

<div id="outline-container-29-35-1" class="outline-4">
<h4 id="sec-29-35-1">Arguments </h4>
<div class="outline-text-4" id="text-29-35-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-29-36" class="outline-3">
<h3 id="sec-29-36">GET-VARIABLE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-36">


</div>

<div id="outline-container-29-36-1" class="outline-4">
<h4 id="sec-29-36-1">Arguments </h4>
<div class="outline-text-4" id="text-29-36-1">

<p>(VAR)
</p></div>
</div>

</div>

<div id="outline-container-29-37" class="outline-3">
<h3 id="sec-29-37">IN-BOUNDS-P [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-37">


</div>

<div id="outline-container-29-37-1" class="outline-4">
<h4 id="sec-29-37-1">Arguments </h4>
<div class="outline-text-4" id="text-29-37-1">

<p>(ROW COLUMN)
</p></div>

</div>

<div id="outline-container-29-37-2" class="outline-4">
<h4 id="sec-29-37-2">Documentation </h4>
<div class="outline-text-4" id="text-29-37-2">

<p>Return non-nil if ROW and COLUMN are valid coordinates.
</p></div>
</div>

</div>

<div id="outline-container-29-38" class="outline-3">
<h3 id="sec-29-38">IN-CATEGORY [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-38">


</div>

<div id="outline-container-29-38-1" class="outline-4">
<h4 id="sec-29-38-1">Arguments </h4>
<div class="outline-text-4" id="text-29-38-1">

<p>(CATEGORY)
</p></div>

</div>

<div id="outline-container-29-38-2" class="outline-4">
<h4 id="sec-29-38-2">Documentation </h4>
<div class="outline-text-4" id="text-29-38-2">

<p>Returns non-nil when the cell SELF is in the category CATEGORY.
</p></div>
</div>

</div>

<div id="outline-container-29-39" class="outline-3">
<h3 id="sec-29-39">INITIALIZE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-39">


</div>

<div id="outline-container-29-39-1" class="outline-4">
<h4 id="sec-29-39-1">Arguments </h4>
<div class="outline-text-4" id="text-29-39-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-29-40" class="outline-3">
<h3 id="sec-29-40">JUMP [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-40">


</div>

<div id="outline-container-29-40-1" class="outline-4">
<h4 id="sec-29-40-1">Arguments </h4>
<div class="outline-text-4" id="text-29-40-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-40-2" class="outline-4">
<h4 id="sec-29-40-2">Documentation </h4>
<div class="outline-text-4" id="text-29-40-2">

<p>Jump N squares forward where N is the integer on the top of the stack.
</p></div>
</div>

</div>

<div id="outline-container-29-41" class="outline-3">
<h3 id="sec-29-41">LEFT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-41">


</div>

<div id="outline-container-29-41-1" class="outline-4">
<h4 id="sec-29-41-1">Arguments </h4>
<div class="outline-text-4" id="text-29-41-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-41-2" class="outline-4">
<h4 id="sec-29-41-2">Documentation </h4>
<div class="outline-text-4" id="text-29-41-2">

<p>Turn N degrees counter-clockwise, where N is 0, 45, or 90.
</p></div>
</div>

</div>

<div id="outline-container-29-42" class="outline-3">
<h3 id="sec-29-42">LINE-OF-SIGHT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-42">


</div>

<div id="outline-container-29-42-1" class="outline-4">
<h4 id="sec-29-42-1">Arguments </h4>
<div class="outline-text-4" id="text-29-42-1">

<p>(R1 C1 R2 C2 &amp;OPTIONAL (CATEGORY OBSTACLE))
</p></div>

</div>

<div id="outline-container-29-42-2" class="outline-4">
<h4 id="sec-29-42-2">Documentation </h4>
<div class="outline-text-4" id="text-29-42-2">

<p>Return non-nil when there is a direct Bresenham's line of sight
along grid squares between R1,C1 and R2,C2.
</p></div>
</div>

</div>

<div id="outline-container-29-43" class="outline-3">
<h3 id="sec-29-43">LOCATION-NAME [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-43">


</div>

<div id="outline-container-29-43-1" class="outline-4">
<h4 id="sec-29-43-1">Arguments </h4>
<div class="outline-text-4" id="text-29-43-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-43-2" class="outline-4">
<h4 id="sec-29-43-2">Documentation </h4>
<div class="outline-text-4" id="text-29-43-2">

<p>Return the location name.
</p></div>
</div>

</div>

<div id="outline-container-29-44" class="outline-3">
<h3 id="sec-29-44">MOVE-CELL [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-44">


</div>

<div id="outline-container-29-44-1" class="outline-4">
<h4 id="sec-29-44-1">Arguments </h4>
<div class="outline-text-4" id="text-29-44-1">

<p>(CELL ROW COLUMN)
</p></div>

</div>

<div id="outline-container-29-44-2" class="outline-4">
<h4 id="sec-29-44-2">Documentation </h4>
<div class="outline-text-4" id="text-29-44-2">

<p>Move CELL to ROW, COLUMN.
</p></div>
</div>

</div>

<div id="outline-container-29-45" class="outline-3">
<h3 id="sec-29-45">NOOP [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-45">


</div>

<div id="outline-container-29-45-1" class="outline-4">
<h4 id="sec-29-45-1">Arguments </h4>
<div class="outline-text-4" id="text-29-45-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-29-46" class="outline-3">
<h3 id="sec-29-46">NTH-CELL [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-46">


</div>

<div id="outline-container-29-46-1" class="outline-4">
<h4 id="sec-29-46-1">Arguments </h4>
<div class="outline-text-4" id="text-29-46-1">

<p>(N ROW COLUMN)
</p></div>
</div>

</div>

<div id="outline-container-29-47" class="outline-3">
<h3 id="sec-29-47">OBSTACLE-AT-P [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-47">


</div>
