notebook/xe2-reference.org
*** Documentation
Returns non-nil if there is any obstacle in the grid at ROW, COLUMN.
** OBSTACLE-IN-DIRECTION-P [WORLD] (method)
*** Arguments
(ROW COLUMN DIRECTION)
*** Documentation
Return non-nil when there is an obstacle one step in DIRECTION from ROW, COLUMN.
** ORIGIN [WORLD] (method)
*** Arguments
NIL
*** Documentation
Move the turtle to its default location (0,0) and orientation (east).
** PAUSE [WORLD] (method)
*** Arguments
(&OPTIONAL ALWAYS)
*** Documentation
Toggle the pause state of the world.
** PLAYER-COLUMN [WORLD] (method)
*** Arguments
NIL
*** Documentation
Return the grid column the player is on.
** PLAYER-ROW [WORLD] (method)
*** Arguments
NIL
*** Documentation
Return the grid row the player is on.
** POPLOC [WORLD] (method)
*** Arguments
NIL
*** Documentation
Jump to the location on the top of the stack, and pop the stack.
** PROCESS-MESSAGES [WORLD] (method)
*** Arguments
NIL
*** Documentation
Process, narrate, and send all the messages in the queue.
The processing step allows the sender to specify the receiver
indirectly as a keyword symbol (like `:world', `:player', or
`:output'.) Any resulting queued messages are processed and sent, and
so on, until no more messages are generated.
** PUSH-COLOR [WORLD] (method)
*** Arguments
NIL
*** Documentation
Push the symbol name of the current <paint> object onto the stack.
** PUSHLOC [WORLD] (method)
*** Arguments
NIL
*** Documentation
Push the current row,col location (and direction) onto the stack.
** RANDOM-PLACE [WORLD] (method)
*** Arguments
(&OPTIONAL &KEY AVOIDING DISTANCE)
** REMOVE-SPRITE [WORLD] (method)
*** Arguments
(SPRITE)
** RENDER-LIGHTING [WORLD] (method)
*** Arguments
(CELL)
*** Documentation
When lighting is activated, calculate lit squares using light
sources and ray casting.
** REPLACE-CELL [WORLD] (method)
*** Arguments
(CELL NEW-CELL ROW COLUMN &OPTIONAL &KEY LOADOUT NO-COLLISIONS)
*** Documentation
Replace the CELL with NEW-CELL at ROW, COLUMN in this world.
** REPLACE-CELLS-AT [WORLD] (method)
*** Arguments
(ROW COLUMN DATA)
*** Documentation
Destroy the cells at ROW, COLUMN, invoking CANCEL on each,
replacing them with the single cell (or vector of cells) DATA.
** RESOLVE-RECEIVER [WORLD] (method)
*** Arguments
(RECEIVER)
** RIGHT [WORLD] (method)
*** Arguments
NIL
*** Documentation
Turn N degrees clockwise, where N is 0, 45, or 90.
** RUN-CPU-PHASE [WORLD] (method)
*** Arguments
(&OPTIONAL TIMER-P)
*** Documentation
Run all non-player actor cells.
** RUN-CPU-PHASE-MAYBE [WORLD] (method)
*** Arguments
NIL
*** Documentation
If this is the player's last turn, run the cpu phase. otherwise,
stay in player phase and exit. Always runs cpu when the engine is in
realtime mode.
** SERIALIZE [WORLD] (method)
*** Arguments
NIL
** SET-BROWSER [WORLD] (method)
*** Arguments
(BROWSER)
** SET-ENVIRONMENT-CONDITION-AT [WORLD] (method)
*** Arguments
(ROW COLUMN CONDITION VALUE)
** SET-NARRATOR [WORLD] (method)
*** Arguments
(NARRATOR)
** SET-PLAYER [WORLD] (method)
*** Arguments
(PLAYER)
*** Documentation
Set PLAYER as the player object to which the World will forward
most user command messages. (See also the method `forward'.)
** SET-VARIABLE [WORLD] (method)
*** Arguments
(VAR VALUE)
