notebook/xe2-reference.html

<div id="outline-container-29-47-1" class="outline-4">
<h4 id="sec-29-47-1">Arguments </h4>
<div class="outline-text-4" id="text-29-47-1">

<p>(ROW COLUMN)
</p></div>

</div>

<div id="outline-container-29-47-2" class="outline-4">
<h4 id="sec-29-47-2">Documentation </h4>
<div class="outline-text-4" id="text-29-47-2">

<p>Returns non-nil if there is any obstacle in the grid at ROW, COLUMN.
</p></div>
</div>

</div>

<div id="outline-container-29-48" class="outline-3">
<h3 id="sec-29-48">OBSTACLE-IN-DIRECTION-P [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-48">


</div>

<div id="outline-container-29-48-1" class="outline-4">
<h4 id="sec-29-48-1">Arguments </h4>
<div class="outline-text-4" id="text-29-48-1">

<p>(ROW COLUMN DIRECTION)
</p></div>

</div>

<div id="outline-container-29-48-2" class="outline-4">
<h4 id="sec-29-48-2">Documentation </h4>
<div class="outline-text-4" id="text-29-48-2">

<p>Return non-nil when there is an obstacle one step in DIRECTION from ROW, COLUMN.
</p></div>
</div>

</div>

<div id="outline-container-29-49" class="outline-3">
<h3 id="sec-29-49">ORIGIN [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-49">


</div>

<div id="outline-container-29-49-1" class="outline-4">
<h4 id="sec-29-49-1">Arguments </h4>
<div class="outline-text-4" id="text-29-49-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-49-2" class="outline-4">
<h4 id="sec-29-49-2">Documentation </h4>
<div class="outline-text-4" id="text-29-49-2">

<p>Move the turtle to its default location (0,0) and orientation (east).
</p></div>
</div>

</div>

<div id="outline-container-29-50" class="outline-3">
<h3 id="sec-29-50">PAUSE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-50">


</div>

<div id="outline-container-29-50-1" class="outline-4">
<h4 id="sec-29-50-1">Arguments </h4>
<div class="outline-text-4" id="text-29-50-1">

<p>(&amp;OPTIONAL ALWAYS)
</p></div>

</div>

<div id="outline-container-29-50-2" class="outline-4">
<h4 id="sec-29-50-2">Documentation </h4>
<div class="outline-text-4" id="text-29-50-2">

<p>Toggle the pause state of the world.
</p></div>
</div>

</div>

<div id="outline-container-29-51" class="outline-3">
<h3 id="sec-29-51">PLAYER-COLUMN [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-51">


</div>

<div id="outline-container-29-51-1" class="outline-4">
<h4 id="sec-29-51-1">Arguments </h4>
<div class="outline-text-4" id="text-29-51-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-51-2" class="outline-4">
<h4 id="sec-29-51-2">Documentation </h4>
<div class="outline-text-4" id="text-29-51-2">

<p>Return the grid column the player is on.
</p></div>
</div>

</div>

<div id="outline-container-29-52" class="outline-3">
<h3 id="sec-29-52">PLAYER-ROW [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-52">


</div>

<div id="outline-container-29-52-1" class="outline-4">
<h4 id="sec-29-52-1">Arguments </h4>
<div class="outline-text-4" id="text-29-52-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-52-2" class="outline-4">
<h4 id="sec-29-52-2">Documentation </h4>
<div class="outline-text-4" id="text-29-52-2">

<p>Return the grid row the player is on.
</p></div>
</div>

</div>

<div id="outline-container-29-53" class="outline-3">
<h3 id="sec-29-53">POPLOC [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-53">


</div>

<div id="outline-container-29-53-1" class="outline-4">
<h4 id="sec-29-53-1">Arguments </h4>
<div class="outline-text-4" id="text-29-53-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-53-2" class="outline-4">
<h4 id="sec-29-53-2">Documentation </h4>
<div class="outline-text-4" id="text-29-53-2">

<p>Jump to the location on the top of the stack, and pop the stack.
</p></div>
</div>

</div>

<div id="outline-container-29-54" class="outline-3">
<h3 id="sec-29-54">PROCESS-MESSAGES [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-54">


</div>

<div id="outline-container-29-54-1" class="outline-4">
<h4 id="sec-29-54-1">Arguments </h4>
<div class="outline-text-4" id="text-29-54-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-54-2" class="outline-4">
<h4 id="sec-29-54-2">Documentation </h4>
<div class="outline-text-4" id="text-29-54-2">

<p>Process, narrate, and send all the messages in the queue.
The processing step allows the sender to specify the receiver
indirectly as a keyword symbol (like `:world', `:player', or
`:output'.) Any resulting queued messages are processed and sent, and
so on, until no more messages are generated.
</p></div>
</div>

</div>

<div id="outline-container-29-55" class="outline-3">
<h3 id="sec-29-55">PUSH-COLOR [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-55">


</div>

<div id="outline-container-29-55-1" class="outline-4">
<h4 id="sec-29-55-1">Arguments </h4>
<div class="outline-text-4" id="text-29-55-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-55-2" class="outline-4">
<h4 id="sec-29-55-2">Documentation </h4>
<div class="outline-text-4" id="text-29-55-2">

<p>Push the symbol name of the current &lt;paint&gt; object onto the stack.
</p></div>
</div>

</div>

<div id="outline-container-29-56" class="outline-3">
<h3 id="sec-29-56">PUSHLOC [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-56">


</div>

<div id="outline-container-29-56-1" class="outline-4">
<h4 id="sec-29-56-1">Arguments </h4>
<div class="outline-text-4" id="text-29-56-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-56-2" class="outline-4">
<h4 id="sec-29-56-2">Documentation </h4>
<div class="outline-text-4" id="text-29-56-2">

<p>Push the current row,col location (and direction) onto the stack.
</p></div>
</div>

</div>

<div id="outline-container-29-57" class="outline-3">
<h3 id="sec-29-57">RANDOM-PLACE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-57">


</div>

<div id="outline-container-29-57-1" class="outline-4">
<h4 id="sec-29-57-1">Arguments </h4>
<div class="outline-text-4" id="text-29-57-1">

<p>(&amp;OPTIONAL &amp;KEY AVOIDING DISTANCE)
</p></div>
</div>

</div>

<div id="outline-container-29-58" class="outline-3">
<h3 id="sec-29-58">REMOVE-SPRITE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-58">


</div>

<div id="outline-container-29-58-1" class="outline-4">
<h4 id="sec-29-58-1">Arguments </h4>
<div class="outline-text-4" id="text-29-58-1">

<p>(SPRITE)
</p></div>
</div>

</div>

<div id="outline-container-29-59" class="outline-3">
<h3 id="sec-29-59">RENDER-LIGHTING [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-59">


</div>

<div id="outline-container-29-59-1" class="outline-4">
<h4 id="sec-29-59-1">Arguments </h4>
<div class="outline-text-4" id="text-29-59-1">

<p>(CELL)
</p></div>

</div>

<div id="outline-container-29-59-2" class="outline-4">
<h4 id="sec-29-59-2">Documentation </h4>
<div class="outline-text-4" id="text-29-59-2">

<p>When lighting is activated, calculate lit squares using light
sources and ray casting.
</p></div>
</div>

</div>

<div id="outline-container-29-60" class="outline-3">
<h3 id="sec-29-60">REPLACE-CELL [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-60">


</div>

<div id="outline-container-29-60-1" class="outline-4">
<h4 id="sec-29-60-1">Arguments </h4>
<div class="outline-text-4" id="text-29-60-1">

<p>(CELL NEW-CELL ROW COLUMN &amp;OPTIONAL &amp;KEY LOADOUT NO-COLLISIONS)
</p></div>

</div>

<div id="outline-container-29-60-2" class="outline-4">
<h4 id="sec-29-60-2">Documentation </h4>
<div class="outline-text-4" id="text-29-60-2">

<p>Replace the CELL with NEW-CELL at ROW, COLUMN in this world.
</p></div>
</div>

</div>

<div id="outline-container-29-61" class="outline-3">
<h3 id="sec-29-61">REPLACE-CELLS-AT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-61">


</div>

<div id="outline-container-29-61-1" class="outline-4">
<h4 id="sec-29-61-1">Arguments </h4>
<div class="outline-text-4" id="text-29-61-1">

<p>(ROW COLUMN DATA)
</p></div>

</div>

<div id="outline-container-29-61-2" class="outline-4">
<h4 id="sec-29-61-2">Documentation </h4>
<div class="outline-text-4" id="text-29-61-2">

<p>Destroy the cells at ROW, COLUMN, invoking CANCEL on each,
replacing them with the single cell (or vector of cells) DATA.
</p></div>
</div>

</div>

<div id="outline-container-29-62" class="outline-3">
<h3 id="sec-29-62">RESOLVE-RECEIVER [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-62">


</div>

<div id="outline-container-29-62-1" class="outline-4">
<h4 id="sec-29-62-1">Arguments </h4>
<div class="outline-text-4" id="text-29-62-1">

<p>(RECEIVER)
</p></div>
</div>

</div>

<div id="outline-container-29-63" class="outline-3">
<h3 id="sec-29-63">RIGHT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-63">


</div>

<div id="outline-container-29-63-1" class="outline-4">
<h4 id="sec-29-63-1">Arguments </h4>
<div class="outline-text-4" id="text-29-63-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-63-2" class="outline-4">
<h4 id="sec-29-63-2">Documentation </h4>
<div class="outline-text-4" id="text-29-63-2">

<p>Turn N degrees clockwise, where N is 0, 45, or 90.
</p></div>
</div>

</div>

<div id="outline-container-29-64" class="outline-3">
<h3 id="sec-29-64">RUN-CPU-PHASE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-64">


</div>

<div id="outline-container-29-64-1" class="outline-4">
<h4 id="sec-29-64-1">Arguments </h4>
<div class="outline-text-4" id="text-29-64-1">

<p>(&amp;OPTIONAL TIMER-P)
</p></div>

</div>

<div id="outline-container-29-64-2" class="outline-4">
<h4 id="sec-29-64-2">Documentation </h4>
<div class="outline-text-4" id="text-29-64-2">

<p>Run all non-player actor cells.
</p></div>
</div>

</div>

<div id="outline-container-29-65" class="outline-3">
<h3 id="sec-29-65">RUN-CPU-PHASE-MAYBE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-65">


</div>

<div id="outline-container-29-65-1" class="outline-4">
<h4 id="sec-29-65-1">Arguments </h4>
<div class="outline-text-4" id="text-29-65-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-65-2" class="outline-4">
<h4 id="sec-29-65-2">Documentation </h4>
<div class="outline-text-4" id="text-29-65-2">

<p>If this is the player's last turn, run the cpu phase. otherwise,
stay in player phase and exit. Always runs cpu when the engine is in
realtime mode.
</p></div>
</div>

</div>

<div id="outline-container-29-66" class="outline-3">
<h3 id="sec-29-66">SERIALIZE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-66">


</div>

<div id="outline-container-29-66-1" class="outline-4">
<h4 id="sec-29-66-1">Arguments </h4>
<div class="outline-text-4" id="text-29-66-1">

<p>NIL
</p></div>
</div>

</div>

<div id="outline-container-29-67" class="outline-3">
<h3 id="sec-29-67">SET-BROWSER [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-67">


</div>

<div id="outline-container-29-67-1" class="outline-4">
<h4 id="sec-29-67-1">Arguments </h4>
<div class="outline-text-4" id="text-29-67-1">

<p>(BROWSER)
</p></div>
</div>

</div>

<div id="outline-container-29-68" class="outline-3">
<h3 id="sec-29-68">SET-ENVIRONMENT-CONDITION-AT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-68">


</div>

<div id="outline-container-29-68-1" class="outline-4">
<h4 id="sec-29-68-1">Arguments </h4>
<div class="outline-text-4" id="text-29-68-1">

<p>(ROW COLUMN CONDITION VALUE)
</p></div>
</div>

</div>

<div id="outline-container-29-69" class="outline-3">
<h3 id="sec-29-69">SET-NARRATOR [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-69">


</div>

<div id="outline-container-29-69-1" class="outline-4">
<h4 id="sec-29-69-1">Arguments </h4>
<div class="outline-text-4" id="text-29-69-1">

<p>(NARRATOR)
</p></div>
</div>

</div>

<div id="outline-container-29-70" class="outline-3">
<h3 id="sec-29-70">SET-PLAYER [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-70">


</div>

<div id="outline-container-29-70-1" class="outline-4">
<h4 id="sec-29-70-1">Arguments </h4>
<div class="outline-text-4" id="text-29-70-1">

<p>(PLAYER)
</p></div>

</div>

<div id="outline-container-29-70-2" class="outline-4">
<h4 id="sec-29-70-2">Documentation </h4>
<div class="outline-text-4" id="text-29-70-2">

<p>Set PLAYER as the player object to which the World will forward
most user command messages. (See also the method `forward'.)
</p></div>
</div>

</div>

<div id="outline-container-29-71" class="outline-3">
<h3 id="sec-29-71">SET-VARIABLE [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-71">


</div>
