notebook/xe2-reference.org
** SET-VIEWPORT [WORLD] (method)
*** Arguments
(VIEWPORT)
*** Documentation
Set the viewport widget.
** START [WORLD] (method)
*** Arguments
NIL
*** Documentation
Prepare the world for play.
** TARGET-IN-DIRECTION-P [WORLD] (method)
*** Arguments
(ROW COLUMN DIRECTION)
*** Documentation
Return non-nil when there is a target one step in DIRECTION from ROW, COLUMN.
** TOP-CELL-AT [WORLD] (method)
*** Arguments
(ROW COLUMN)
* Symbols
** *ACTIVE-WIDGETS* (variable)
*** Documentation
List of active widget objects. 
These widgets receive input events and are rendered to the screen by
the console. See also `send-event-to-widgets'.

Do not set this variable directly from a module; instead, call
`install-widgets'.
** *BROWSER* (variable)
** *CHOOSE-DIRECTION-MENU* (variable)
** *COLORS* (variable)
** *COMPASS-DIRECTIONS* (variable)
*** Documentation
List of keywords representing the eight compass directions, plus :here.
** *COMPASS-OPPOSITES* (variable)
*** Documentation
Property list mapping direction keywords to their 180-degree
opposites.
** *DEFAULT-ACTION-POINTS* (variable)
** *DEFAULT-FONT* (variable)
** *DEFAULT-FRAME-HEIGHT* (variable)
** *DEFAULT-FRAME-WIDTH* (variable)
** *DEFAULT-MESSAGE-VERBOSITIES* (variable)
** *DEFAULT-WORLD-AXIS-SIZE* (variable)
** *DEFAULT-WORLD-Z-SIZE* (variable)
** *DT* (variable)
** *EVENT-HANDLER-FUNCTION* (variable)
*** Documentation
Function to be called with keypress events. This function should
accept an event list of the form

  (STRING . MODIFIERS)

where STRING is a string representing the key, and MODIFIERS is a list
of key modifier symbols like :shift, :control, :alt, and so on.

The modifier list is sorted; thus, events can be compared for
equality with `equal' and used as hashtable keys.

The default event handler is `send-event-to-widgets', which see. An
XE2 game can use the widget framework to do its drawing and event
handling, or override `*event-handler-function*' and do something
else.
** *EXECUTABLE* (variable)
** *FRAME-RATE* (variable)
*** Documentation
The intended frame rate of the game. Recommended value is 30.
Don't set this variable directly; use `set-frame-rate' instead.
** *FREQUENCY* (variable)
** *FULLSCREEN* (variable)
*** Documentation
When non-nil, attempt to use fullscreen mode.
** *GENERIC-JOYSTICK-MAPPING* (variable)
** *GRAMMAR* (variable)
*** Documentation
The current context-free grammar used for sentence generation.
This is an association list of the form:

    ((VARIABLE >> EXPANSIONS)
     (VARIABLE >> EXPANSIONS)
     ...)

Where EXPANSIONS is a list of alternatives, each of which may be
either (1) single symbols or (2) a list of symbols, representing
concatenation.
** *INITIALIZATION-HOOK* (variable)
*** Documentation
This hook is run after the XE2 console is initialized.
Set timer parameters and other settings here.
** *JOYSTICK-MAPPING* (variable)
** *LAST-EVENT* (variable)
** *LEFT-TURN* (variable)
** *MESSAGE-LOGGING* (variable)
** *MESSAGE-SEND-SYMBOL-SUFFIX* (variable)
** *MESSAGE-SENDER* (variable)
** *MESSAGE-VERBOSITIES* (variable)
*** Documentation
Property list mapping message keywords to the integers from 1-3.
A message outputs if its verbosity level is less than or equal to the
narration window's verbosity level. Level 1 is normal gameplay output,
while levels 2 and 3 offer increading debug information. Values of nil
and t mean to never (and always, respectively) output, regardless of
verbosity level.
** *MODULE-DIRECTORIES* (variable)
*** Documentation
List of directories where XE2 will search for modules.
Directories are searched in list order.
** *MODULE-WIDGETS* (variable)
*** Documentation
List of widget objects in the current module.
** *NEXT-MODULE* (variable)
** *OUTPUT-CHANNELS* (variable)
** *OUTPUT-CHUNKSIZE* (variable)
