notebook/xe2-reference.html

<div id="outline-container-29-71-1" class="outline-4">
<h4 id="sec-29-71-1">Arguments </h4>
<div class="outline-text-4" id="text-29-71-1">

<p>(VAR VALUE)
</p></div>
</div>

</div>

<div id="outline-container-29-72" class="outline-3">
<h3 id="sec-29-72">SET-VIEWPORT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-72">


</div>

<div id="outline-container-29-72-1" class="outline-4">
<h4 id="sec-29-72-1">Arguments </h4>
<div class="outline-text-4" id="text-29-72-1">

<p>(VIEWPORT)
</p></div>

</div>

<div id="outline-container-29-72-2" class="outline-4">
<h4 id="sec-29-72-2">Documentation </h4>
<div class="outline-text-4" id="text-29-72-2">

<p>Set the viewport widget.
</p></div>
</div>

</div>

<div id="outline-container-29-73" class="outline-3">
<h3 id="sec-29-73">START [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-73">


</div>

<div id="outline-container-29-73-1" class="outline-4">
<h4 id="sec-29-73-1">Arguments </h4>
<div class="outline-text-4" id="text-29-73-1">

<p>NIL
</p></div>

</div>

<div id="outline-container-29-73-2" class="outline-4">
<h4 id="sec-29-73-2">Documentation </h4>
<div class="outline-text-4" id="text-29-73-2">

<p>Prepare the world for play.
</p></div>
</div>

</div>

<div id="outline-container-29-74" class="outline-3">
<h3 id="sec-29-74">TARGET-IN-DIRECTION-P [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-74">


</div>

<div id="outline-container-29-74-1" class="outline-4">
<h4 id="sec-29-74-1">Arguments </h4>
<div class="outline-text-4" id="text-29-74-1">

<p>(ROW COLUMN DIRECTION)
</p></div>

</div>

<div id="outline-container-29-74-2" class="outline-4">
<h4 id="sec-29-74-2">Documentation </h4>
<div class="outline-text-4" id="text-29-74-2">

<p>Return non-nil when there is a target one step in DIRECTION from ROW, COLUMN.
</p></div>
</div>

</div>

<div id="outline-container-29-75" class="outline-3">
<h3 id="sec-29-75">TOP-CELL-AT [WORLD] (method) </h3>
<div class="outline-text-3" id="text-29-75">


</div>

<div id="outline-container-29-75-1" class="outline-4">
<h4 id="sec-29-75-1">Arguments </h4>
<div class="outline-text-4" id="text-29-75-1">

<p>(ROW COLUMN)
</p></div>
</div>
</div>

</div>

<div id="outline-container-30" class="outline-2">
<h2 id="sec-30">Symbols </h2>
<div class="outline-text-2" id="text-30">


</div>

<div id="outline-container-30-1" class="outline-3">
<h3 id="sec-30-1">*ACTIVE-WIDGETS* (variable) </h3>
<div class="outline-text-3" id="text-30-1">


</div>

<div id="outline-container-30-1-1" class="outline-4">
<h4 id="sec-30-1-1">Documentation </h4>
<div class="outline-text-4" id="text-30-1-1">

<p>List of active widget objects. 
These widgets receive input events and are rendered to the screen by
the console. See also `send-event-to-widgets'.
</p>
<p>
Do not set this variable directly from a module; instead, call
`install-widgets'.
</p></div>
</div>

</div>

<div id="outline-container-30-2" class="outline-3">
<h3 id="sec-30-2">*BROWSER* (variable) </h3>
<div class="outline-text-3" id="text-30-2">

</div>

</div>

<div id="outline-container-30-3" class="outline-3">
<h3 id="sec-30-3">*CHOOSE-DIRECTION-MENU* (variable) </h3>
<div class="outline-text-3" id="text-30-3">

</div>

</div>

<div id="outline-container-30-4" class="outline-3">
<h3 id="sec-30-4">*COLORS* (variable) </h3>
<div class="outline-text-3" id="text-30-4">

</div>

</div>

<div id="outline-container-30-5" class="outline-3">
<h3 id="sec-30-5">*COMPASS-DIRECTIONS* (variable) </h3>
<div class="outline-text-3" id="text-30-5">


</div>

<div id="outline-container-30-5-1" class="outline-4">
<h4 id="sec-30-5-1">Documentation </h4>
<div class="outline-text-4" id="text-30-5-1">

<p>List of keywords representing the eight compass directions, plus :here.
</p></div>
</div>

</div>

<div id="outline-container-30-6" class="outline-3">
<h3 id="sec-30-6">*COMPASS-OPPOSITES* (variable) </h3>
<div class="outline-text-3" id="text-30-6">


</div>

<div id="outline-container-30-6-1" class="outline-4">
<h4 id="sec-30-6-1">Documentation </h4>
<div class="outline-text-4" id="text-30-6-1">

<p>Property list mapping direction keywords to their 180-degree
opposites.
</p></div>
</div>

</div>

<div id="outline-container-30-7" class="outline-3">
<h3 id="sec-30-7">*DEFAULT-ACTION-POINTS* (variable) </h3>
<div class="outline-text-3" id="text-30-7">

</div>

</div>

<div id="outline-container-30-8" class="outline-3">
<h3 id="sec-30-8">*DEFAULT-FONT* (variable) </h3>
<div class="outline-text-3" id="text-30-8">

</div>

</div>

<div id="outline-container-30-9" class="outline-3">
<h3 id="sec-30-9">*DEFAULT-FRAME-HEIGHT* (variable) </h3>
<div class="outline-text-3" id="text-30-9">

</div>

</div>

<div id="outline-container-30-10" class="outline-3">
<h3 id="sec-30-10">*DEFAULT-FRAME-WIDTH* (variable) </h3>
<div class="outline-text-3" id="text-30-10">

</div>

</div>

<div id="outline-container-30-11" class="outline-3">
<h3 id="sec-30-11">*DEFAULT-MESSAGE-VERBOSITIES* (variable) </h3>
<div class="outline-text-3" id="text-30-11">

</div>

</div>

<div id="outline-container-30-12" class="outline-3">
<h3 id="sec-30-12">*DEFAULT-WORLD-AXIS-SIZE* (variable) </h3>
<div class="outline-text-3" id="text-30-12">

</div>

</div>

<div id="outline-container-30-13" class="outline-3">
<h3 id="sec-30-13">*DEFAULT-WORLD-Z-SIZE* (variable) </h3>
<div class="outline-text-3" id="text-30-13">

</div>

</div>

<div id="outline-container-30-14" class="outline-3">
<h3 id="sec-30-14">*DT* (variable) </h3>
<div class="outline-text-3" id="text-30-14">

</div>

</div>

<div id="outline-container-30-15" class="outline-3">
<h3 id="sec-30-15">*EVENT-HANDLER-FUNCTION* (variable) </h3>
<div class="outline-text-3" id="text-30-15">


</div>

<div id="outline-container-30-15-1" class="outline-4">
<h4 id="sec-30-15-1">Documentation </h4>
<div class="outline-text-4" id="text-30-15-1">

<p>Function to be called with keypress events. This function should
accept an event list of the form
</p>
<p>
  (STRING . MODIFIERS)
</p>
<p>
where STRING is a string representing the key, and MODIFIERS is a list
of key modifier symbols like :shift, :control, :alt, and so on.
</p>
<p>
The modifier list is sorted; thus, events can be compared for
equality with `equal' and used as hashtable keys.
</p>
<p>
The default event handler is `send-event-to-widgets', which see. An
XE2 game can use the widget framework to do its drawing and event
handling, or override `*event-handler-function*' and do something
else.
</p></div>
</div>

</div>

<div id="outline-container-30-16" class="outline-3">
<h3 id="sec-30-16">*EXECUTABLE* (variable) </h3>
<div class="outline-text-3" id="text-30-16">

</div>

</div>

<div id="outline-container-30-17" class="outline-3">
<h3 id="sec-30-17">*FRAME-RATE* (variable) </h3>
<div class="outline-text-3" id="text-30-17">


</div>

<div id="outline-container-30-17-1" class="outline-4">
<h4 id="sec-30-17-1">Documentation </h4>
<div class="outline-text-4" id="text-30-17-1">

<p>The intended frame rate of the game. Recommended value is 30.
Don't set this variable directly; use `set-frame-rate' instead.
</p></div>
</div>

</div>

<div id="outline-container-30-18" class="outline-3">
<h3 id="sec-30-18">*FREQUENCY* (variable) </h3>
<div class="outline-text-3" id="text-30-18">

</div>

</div>

<div id="outline-container-30-19" class="outline-3">
<h3 id="sec-30-19">*FULLSCREEN* (variable) </h3>
<div class="outline-text-3" id="text-30-19">


</div>

<div id="outline-container-30-19-1" class="outline-4">
<h4 id="sec-30-19-1">Documentation </h4>
<div class="outline-text-4" id="text-30-19-1">

<p>When non-nil, attempt to use fullscreen mode.
</p></div>
</div>

</div>

<div id="outline-container-30-20" class="outline-3">
<h3 id="sec-30-20">*GENERIC-JOYSTICK-MAPPING* (variable) </h3>
<div class="outline-text-3" id="text-30-20">

</div>

</div>

<div id="outline-container-30-21" class="outline-3">
<h3 id="sec-30-21">*GRAMMAR* (variable) </h3>
<div class="outline-text-3" id="text-30-21">


</div>

<div id="outline-container-30-21-1" class="outline-4">
<h4 id="sec-30-21-1">Documentation </h4>
<div class="outline-text-4" id="text-30-21-1">

<p>The current context-free grammar used for sentence generation.
This is an association list of the form:
</p>
<p>
    ((VARIABLE &gt;&gt; EXPANSIONS)
     (VARIABLE &gt;&gt; EXPANSIONS)
     &hellip;)
</p>
<p>
Where EXPANSIONS is a list of alternatives, each of which may be
either (1) single symbols or (2) a list of symbols, representing
concatenation.
</p></div>
</div>

</div>

<div id="outline-container-30-22" class="outline-3">
<h3 id="sec-30-22">*INITIALIZATION-HOOK* (variable) </h3>
<div class="outline-text-3" id="text-30-22">


</div>

<div id="outline-container-30-22-1" class="outline-4">
<h4 id="sec-30-22-1">Documentation </h4>
<div class="outline-text-4" id="text-30-22-1">

<p>This hook is run after the XE2 console is initialized.
Set timer parameters and other settings here.
</p></div>
</div>

</div>

<div id="outline-container-30-23" class="outline-3">
<h3 id="sec-30-23">*JOYSTICK-MAPPING* (variable) </h3>
<div class="outline-text-3" id="text-30-23">

</div>

</div>

<div id="outline-container-30-24" class="outline-3">
<h3 id="sec-30-24">*LAST-EVENT* (variable) </h3>
<div class="outline-text-3" id="text-30-24">

</div>

</div>

<div id="outline-container-30-25" class="outline-3">
<h3 id="sec-30-25">*LEFT-TURN* (variable) </h3>
<div class="outline-text-3" id="text-30-25">

</div>

</div>

<div id="outline-container-30-26" class="outline-3">
<h3 id="sec-30-26">*MESSAGE-LOGGING* (variable) </h3>
<div class="outline-text-3" id="text-30-26">

</div>

</div>

<div id="outline-container-30-27" class="outline-3">
<h3 id="sec-30-27">*MESSAGE-SEND-SYMBOL-SUFFIX* (variable) </h3>
<div class="outline-text-3" id="text-30-27">

</div>

</div>

<div id="outline-container-30-28" class="outline-3">
<h3 id="sec-30-28">*MESSAGE-SENDER* (variable) </h3>
<div class="outline-text-3" id="text-30-28">

</div>

</div>

<div id="outline-container-30-29" class="outline-3">
<h3 id="sec-30-29">*MESSAGE-VERBOSITIES* (variable) </h3>
<div class="outline-text-3" id="text-30-29">


</div>

<div id="outline-container-30-29-1" class="outline-4">
<h4 id="sec-30-29-1">Documentation </h4>
<div class="outline-text-4" id="text-30-29-1">

<p>Property list mapping message keywords to the integers from 1-3.
A message outputs if its verbosity level is less than or equal to the
narration window's verbosity level. Level 1 is normal gameplay output,
while levels 2 and 3 offer increading debug information. Values of nil
and t mean to never (and always, respectively) output, regardless of
verbosity level.
</p></div>
</div>

</div>

<div id="outline-container-30-30" class="outline-3">
<h3 id="sec-30-30">*MODULE-DIRECTORIES* (variable) </h3>
<div class="outline-text-3" id="text-30-30">


</div>

<div id="outline-container-30-30-1" class="outline-4">
<h4 id="sec-30-30-1">Documentation </h4>
<div class="outline-text-4" id="text-30-30-1">

<p>List of directories where XE2 will search for modules.
Directories are searched in list order.
</p></div>
</div>

</div>

<div id="outline-container-30-31" class="outline-3">
<h3 id="sec-30-31">*MODULE-WIDGETS* (variable) </h3>
<div class="outline-text-3" id="text-30-31">


</div>

<div id="outline-container-30-31-1" class="outline-4">
<h4 id="sec-30-31-1">Documentation </h4>
<div class="outline-text-4" id="text-30-31-1">

<p>List of widget objects in the current module.
</p></div>
</div>

</div>

<div id="outline-container-30-32" class="outline-3">
<h3 id="sec-30-32">*NEXT-MODULE* (variable) </h3>
<div class="outline-text-3" id="text-30-32">

</div>

</div>

<div id="outline-container-30-33" class="outline-3">
<h3 id="sec-30-33">*OUTPUT-CHANNELS* (variable) </h3>
<div class="outline-text-3" id="text-30-33">

</div>

</div>

<div id="outline-container-30-34" class="outline-3">
<h3 id="sec-30-34">*OUTPUT-CHUNKSIZE* (variable) </h3>
<div class="outline-text-3" id="text-30-34">

</div>

</div>
