notebook/xe2-reference.org
** *PAK-FILE-EXTENSION* (variable)
*** Documentation
PAK is a simple Lisp data interchange file format readable and
writable by both Emacs Lisp and Common Lisp. A PAK file can contain
one or more data resources. A 'resource' is an image, sound, text,
font, lisp program, or other data whose interpretation is up to the
client.

A PAK resource can be either self-contained, or point to an
external file for its data.

A 'resource record' defines a resource. A resource record is a
structure with the following elements:

 :NAME    A string; the name of the resource.
          The colon character : is reserved and used to specify 
          resource transformations; see below.
 :TYPE    A keyword symbol identifying the data type.
          Corresponding handlers are the responsibility of the client.
          See also `*resource-handlers*' and `load-resource'.

          The special type :pak is used to load the pak file
          specified in :FILE, from (optionally) another module
          whose name is given in :DATA.

          The special type :alias is used to provide multiple names
          for a resource. The :DATA field contains the name of the
          target resource. This name can specify resource
          transformations, see below. 

 :PROPERTIES  Property list with extra data; for example :copyright,
              :license, :author. 
              The special property :AUTOLOAD, when non-nil causes
              the resource to be loaded automatically upon startup 
              (the default is to load resources on demand.)

 :FILE    Name of file to load data from, if any. 
          Relative to directory of PAK file.
 :DATA    Lisp data encoding the resource itself, if any.

In memory, these will be represented by resource structs (see below).
On disk, it's Lisp data printed as text. This text will compress very
well.

The string '()' is a valid .PAK file; it contains no resources.
** *PHYSICS-FUNCTION* (variable)
** *PS3-JOYSTICK-MAPPING* (variable)
** *QUITTING* (variable)
** *RESOURCE-HANDLERS* (variable)
*** Documentation
A property list mapping resource type keywords to handler functions.
Each function should accept one resource record, and return an
object (possibly driver-dependent). When a resource is loaded (with
`load-resource'), the appropriate handler is looked up, and invoked on
the resource record.  The return value is stored in the OBJECT field
of the record.
** *RESOURCE-TABLE* (variable)
*** Documentation
A hash table mapping resource names to resource records. All loaded
resources go in this one hash table.

The `resource table' maps resource names to their corresponding
records. `Indexing' a resource means that its resource record is
added to the resource table. `Loading' a resource means that any
associated driver-dependent object (SDL image surface, audio buffer
object, etc) is created. This value is stored into the OBJECT field
of the resource record upon loading; see `load-resource'.

The loading operation may be driver-dependent, so each resource
type (i.e. :image, :text, :sound) is handled by its own plugin
function (see `*resource-handlers*').

`Finding' a resource means looking up its record in the resource
table, and loading the resource if it hasn't been loaded already.
A lookup failure results in an error. See `find-resource'.

A `module' is a directory full of resource files. The name of the
module is the name of the directory. Each module must contain a
file called {module-name}.pak, which should contain an index of
all the module's resources. Multiple modules may be loaded at one
time. In addition the special resource .startup will be loaded;
if this is type :lisp, the startup code for your game can go in
that external lisp file.
** *RIGHT-TURN* (variable)
** *SCREEN-HEIGHT* (variable)
*** Documentation
The height (in pixels) of the game
window. Set this in the game startup file.
** *SCREEN-WIDTH* (variable)
*** Documentation
The width (in pixels) of the game
window. Set this in the game startup file.
** *SENDER* (variable)
*** Documentation
This variable is bound to the object (if any) to
receive sent messages.
** *STANDARD-CATEGORIES* (variable)
** *STARTUP* (variable)
** *TIMER-INTERVAL* (variable)
*** Documentation
Number of frames to wait before sending each timer event.
Set this to 0 to get a timer event every frame.
Don't set this yourself; use `set-timer-interval'.
** *UNIVERSE* (variable)
** *USE-SOUND* (variable)
*** Documentation
Non-nil (the default) is to use sound. Nil disables sound.
** *USER-INIT-FILE-NAME* (variable)
** *USER-KEYBOARD-LAYOUT* (variable)
** *WINDOW-POSITION* (variable)
*** Documentation
Controls the position of the game window. Either a list of coordinates or the symbol :center.
** *WINDOW-TITLE* (variable)
** *WORKBOOK* (variable)
*** Documentation
Hash table mapping string page names to world objects.
** *WORLD* (variable)
*** Documentation
The current world object. Only one may be active at a time. See also
worlds.lisp. Cells are free to send messages to `*world*' at
any time, because it is always bound to the world containing the cell
at the time the cell method is run.
** *X11-COLOR-DATA* (variable)
** *ZOOM-FACTOR* (variable)
*** Documentation
When set to some integer greater than 1, all image resources are
scaled by that factor unless marked with the property :nozoom t.
** ADD-HOOK (function)
*** Arguments
(HOOK FUNC)
