notebook/xe2-reference.html

<div id="outline-container-30-35" class="outline-3">
<h3 id="sec-30-35">*PAK-FILE-EXTENSION* (variable) </h3>
<div class="outline-text-3" id="text-30-35">


</div>

<div id="outline-container-30-35-1" class="outline-4">
<h4 id="sec-30-35-1">Documentation </h4>
<div class="outline-text-4" id="text-30-35-1">

<p>PAK is a simple Lisp data interchange file format readable and
writable by both Emacs Lisp and Common Lisp. A PAK file can contain
one or more data resources. A 'resource' is an image, sound, text,
font, lisp program, or other data whose interpretation is up to the
client.
</p>
<p>
A PAK resource can be either self-contained, or point to an
external file for its data.
</p>
<p>
A 'resource record' defines a resource. A resource record is a
structure with the following elements:
</p>
<p>
 :NAME    A string; the name of the resource.
          The colon character : is reserved and used to specify 
          resource transformations; see below.
 :TYPE    A keyword symbol identifying the data type.
          Corresponding handlers are the responsibility of the client.
          See also `*resource-handlers*' and `load-resource'.
</p>
<p>
          The special type :pak is used to load the pak file
          specified in :FILE, from (optionally) another module
          whose name is given in :DATA.
</p>
<p>
          The special type :alias is used to provide multiple names
          for a resource. The :DATA field contains the name of the
          target resource. This name can specify resource
          transformations, see below. 
</p>
<p>
 :PROPERTIES  Property list with extra data; for example :copyright,
              :license, :author. 
              The special property :AUTOLOAD, when non-nil causes
              the resource to be loaded automatically upon startup 
              (the default is to load resources on demand.)
</p>
<p>
 :FILE    Name of file to load data from, if any. 
          Relative to directory of PAK file.
 :DATA    Lisp data encoding the resource itself, if any.
</p>
<p>
In memory, these will be represented by resource structs (see below).
On disk, it's Lisp data printed as text. This text will compress very
well.
</p>
<p>
The string '()' is a valid .PAK file; it contains no resources.
</p></div>
</div>

</div>

<div id="outline-container-30-36" class="outline-3">
<h3 id="sec-30-36">*PHYSICS-FUNCTION* (variable) </h3>
<div class="outline-text-3" id="text-30-36">

</div>

</div>

<div id="outline-container-30-37" class="outline-3">
<h3 id="sec-30-37">*PS3-JOYSTICK-MAPPING* (variable) </h3>
<div class="outline-text-3" id="text-30-37">

</div>

</div>

<div id="outline-container-30-38" class="outline-3">
<h3 id="sec-30-38">*QUITTING* (variable) </h3>
<div class="outline-text-3" id="text-30-38">

</div>

</div>

<div id="outline-container-30-39" class="outline-3">
<h3 id="sec-30-39">*RESOURCE-HANDLERS* (variable) </h3>
<div class="outline-text-3" id="text-30-39">


</div>

<div id="outline-container-30-39-1" class="outline-4">
<h4 id="sec-30-39-1">Documentation </h4>
<div class="outline-text-4" id="text-30-39-1">

<p>A property list mapping resource type keywords to handler functions.
Each function should accept one resource record, and return an
object (possibly driver-dependent). When a resource is loaded (with
`load-resource'), the appropriate handler is looked up, and invoked on
the resource record.  The return value is stored in the OBJECT field
of the record.
</p></div>
</div>

</div>

<div id="outline-container-30-40" class="outline-3">
<h3 id="sec-30-40">*RESOURCE-TABLE* (variable) </h3>
<div class="outline-text-3" id="text-30-40">


</div>

<div id="outline-container-30-40-1" class="outline-4">
<h4 id="sec-30-40-1">Documentation </h4>
<div class="outline-text-4" id="text-30-40-1">

<p>A hash table mapping resource names to resource records. All loaded
resources go in this one hash table.
</p>
<p>
The `resource table' maps resource names to their corresponding
records. `Indexing' a resource means that its resource record is
added to the resource table. `Loading' a resource means that any
associated driver-dependent object (SDL image surface, audio buffer
object, etc) is created. This value is stored into the OBJECT field
of the resource record upon loading; see `load-resource'.
</p>
<p>
The loading operation may be driver-dependent, so each resource
type (i.e. :image, :text, :sound) is handled by its own plugin
function (see `*resource-handlers*').
</p>
<p>
`Finding' a resource means looking up its record in the resource
table, and loading the resource if it hasn't been loaded already.
A lookup failure results in an error. See `find-resource'.
</p>
<p>
A `module' is a directory full of resource files. The name of the
module is the name of the directory. Each module must contain a
file called {module-name}.pak, which should contain an index of
all the module's resources. Multiple modules may be loaded at one
time. In addition the special resource .startup will be loaded;
if this is type :lisp, the startup code for your game can go in
that external lisp file.
</p></div>
</div>

</div>

<div id="outline-container-30-41" class="outline-3">
<h3 id="sec-30-41">*RIGHT-TURN* (variable) </h3>
<div class="outline-text-3" id="text-30-41">

</div>

</div>

<div id="outline-container-30-42" class="outline-3">
<h3 id="sec-30-42">*SCREEN-HEIGHT* (variable) </h3>
<div class="outline-text-3" id="text-30-42">


</div>

<div id="outline-container-30-42-1" class="outline-4">
<h4 id="sec-30-42-1">Documentation </h4>
<div class="outline-text-4" id="text-30-42-1">

<p>The height (in pixels) of the game
window. Set this in the game startup file.
</p></div>
</div>

</div>

<div id="outline-container-30-43" class="outline-3">
<h3 id="sec-30-43">*SCREEN-WIDTH* (variable) </h3>
<div class="outline-text-3" id="text-30-43">


</div>

<div id="outline-container-30-43-1" class="outline-4">
<h4 id="sec-30-43-1">Documentation </h4>
<div class="outline-text-4" id="text-30-43-1">

<p>The width (in pixels) of the game
window. Set this in the game startup file.
</p></div>
</div>

</div>

<div id="outline-container-30-44" class="outline-3">
<h3 id="sec-30-44">*SENDER* (variable) </h3>
<div class="outline-text-3" id="text-30-44">


</div>

<div id="outline-container-30-44-1" class="outline-4">
<h4 id="sec-30-44-1">Documentation </h4>
<div class="outline-text-4" id="text-30-44-1">

<p>This variable is bound to the object (if any) to
receive sent messages.
</p></div>
</div>

</div>

<div id="outline-container-30-45" class="outline-3">
<h3 id="sec-30-45">*STANDARD-CATEGORIES* (variable) </h3>
<div class="outline-text-3" id="text-30-45">

</div>

</div>

<div id="outline-container-30-46" class="outline-3">
<h3 id="sec-30-46">*STARTUP* (variable) </h3>
<div class="outline-text-3" id="text-30-46">

</div>

</div>

<div id="outline-container-30-47" class="outline-3">
<h3 id="sec-30-47">*TIMER-INTERVAL* (variable) </h3>
<div class="outline-text-3" id="text-30-47">


</div>

<div id="outline-container-30-47-1" class="outline-4">
<h4 id="sec-30-47-1">Documentation </h4>
<div class="outline-text-4" id="text-30-47-1">

<p>Number of frames to wait before sending each timer event.
Set this to 0 to get a timer event every frame.
Don't set this yourself; use `set-timer-interval'.
</p></div>
</div>

</div>

<div id="outline-container-30-48" class="outline-3">
<h3 id="sec-30-48">*UNIVERSE* (variable) </h3>
<div class="outline-text-3" id="text-30-48">

</div>

</div>

<div id="outline-container-30-49" class="outline-3">
<h3 id="sec-30-49">*USE-SOUND* (variable) </h3>
<div class="outline-text-3" id="text-30-49">


</div>

<div id="outline-container-30-49-1" class="outline-4">
<h4 id="sec-30-49-1">Documentation </h4>
<div class="outline-text-4" id="text-30-49-1">

<p>Non-nil (the default) is to use sound. Nil disables sound.
</p></div>
</div>

</div>

<div id="outline-container-30-50" class="outline-3">
<h3 id="sec-30-50">*USER-INIT-FILE-NAME* (variable) </h3>
<div class="outline-text-3" id="text-30-50">

</div>

</div>

<div id="outline-container-30-51" class="outline-3">
<h3 id="sec-30-51">*USER-KEYBOARD-LAYOUT* (variable) </h3>
<div class="outline-text-3" id="text-30-51">

</div>

</div>

<div id="outline-container-30-52" class="outline-3">
<h3 id="sec-30-52">*WINDOW-POSITION* (variable) </h3>
<div class="outline-text-3" id="text-30-52">


</div>

<div id="outline-container-30-52-1" class="outline-4">
<h4 id="sec-30-52-1">Documentation </h4>
<div class="outline-text-4" id="text-30-52-1">

<p>Controls the position of the game window. Either a list of coordinates or the symbol :center.
</p></div>
</div>

</div>

<div id="outline-container-30-53" class="outline-3">
<h3 id="sec-30-53">*WINDOW-TITLE* (variable) </h3>
<div class="outline-text-3" id="text-30-53">

</div>

</div>

<div id="outline-container-30-54" class="outline-3">
<h3 id="sec-30-54">*WORKBOOK* (variable) </h3>
<div class="outline-text-3" id="text-30-54">


</div>

<div id="outline-container-30-54-1" class="outline-4">
<h4 id="sec-30-54-1">Documentation </h4>
<div class="outline-text-4" id="text-30-54-1">

<p>Hash table mapping string page names to world objects.
</p></div>
</div>

</div>

<div id="outline-container-30-55" class="outline-3">
<h3 id="sec-30-55">*WORLD* (variable) </h3>
<div class="outline-text-3" id="text-30-55">


</div>

<div id="outline-container-30-55-1" class="outline-4">
<h4 id="sec-30-55-1">Documentation </h4>
<div class="outline-text-4" id="text-30-55-1">

<p>The current world object. Only one may be active at a time. See also
worlds.lisp. Cells are free to send messages to `*world*' at
any time, because it is always bound to the world containing the cell
at the time the cell method is run.
</p></div>
</div>

</div>

<div id="outline-container-30-56" class="outline-3">
<h3 id="sec-30-56">*X11-COLOR-DATA* (variable) </h3>
<div class="outline-text-3" id="text-30-56">

</div>

</div>

<div id="outline-container-30-57" class="outline-3">
<h3 id="sec-30-57">*ZOOM-FACTOR* (variable) </h3>
<div class="outline-text-3" id="text-30-57">


</div>

<div id="outline-container-30-57-1" class="outline-4">
<h4 id="sec-30-57-1">Documentation </h4>
<div class="outline-text-4" id="text-30-57-1">

<p>When set to some integer greater than 1, all image resources are
scaled by that factor unless marked with the property :nozoom t.
</p></div>
</div>

</div>

<div id="outline-container-30-58" class="outline-3">
<h3 id="sec-30-58">ADD-HOOK (function) </h3>
<div class="outline-text-3" id="text-30-58">


</div>
