notebook/xe2-reference.org
*** Documentation
Hooks are special variables whose names are of the form
`*foo-hook*' and whose values are lists of functions taking no
arguments. The functions of a given hook are all invoked (in list
order) whenever the hook is run with `run-hook'.

This function arranges for FUNC to be invoked whenever HOOK is triggered with
`run-hook'. The function should have no arguments.
** ADD-MESSAGE-VERBOSITIES (function)
*** Arguments
(PLIST)
** ADD-OVERLAY (variable)
** BIND-KEY-TO-METHOD (function)
*** Arguments
(P KEY MODIFIERS METHOD-KEYWORD)
** BIND-KEY-TO-PROMPT-INSERTION (function)
*** Arguments
(P KEY MODIFIERS &OPTIONAL (INSERTION KEY))
*** Documentation
For prompt P ensure that the event (KEY MODIFIERS) causes the
text INSERTION to be inserted at point.
** BROWSER (variable)
** CLONE (function)
*** Arguments
(PROTOTYPE &REST INITARGS)
*** Documentation
Create a new object from PROTOTYPE and pass INITARGS to the
initializer. The new object is created with fields for which INITFORMS
were specified (if any; see `define-prototype'); the INITFORMS are
evaluated, then any applicable initializer is triggered.
** COMPOSE-BLANK-FIELDS (function)
*** Arguments
(&OPTIONAL DESCRIPTORS (TYPE HASH))
** CREATE-IMAGE (function)
*** Arguments
(WIDTH HEIGHT)
*** Documentation
Create a new XE2 image of size (* WIDTH HEIGHT).
** DEFCELL (macro)
*** Arguments
(&REST ARGS)
*** Documentation
Define a cell named NAME, with the fields ARGS as in a normal
prototype declaration. This is a convenience macro for defining new
cells.
** DEFINE-METHOD (macro)
*** Arguments
(&REST ARGS)
*** Documentation
Define a new method.

METHOD-NAME is a symbol naming the method.  PROTOTYPE-NAME is the name
of the prototype you are defining a method for. This should be a
symbol (without equals signs---see Prototype Names. ARGLIST is
the argument list for the method. If METHOD-BODY begins with a string,
this string becomes the documentation string for the method.

Any DECLARE forms must appear as the first non-string sexp.

The forms in METHOD-BODY are executed when the method is invoked.
The hidden argument `self' may be referred to as needed within
the method body; it is bound to the object upon which the method
was invoked.
** DEFINE-PROTOTYPE (macro)
*** Arguments
(&REST ARGS)
*** Documentation
Create a new object prototype (possibly based on another prototype).

NAME should be a symbol naming the prototype. A special variable is
created, with equals signs bracketing the name; this variable's value
is the resulting prototype. For example, if your prototype is named
`foo', the special variable will be named `=foo=', and you create
objects with:

 (clone =foo=)

See also `clone'. 

The second argument is a property list of options for the
prototype. Valid keys are:

 :DOCUMENTATION     The documentation string for this prototype.
 :PARENT            The parent prototype from which the new prototype will 
                    inherit fields. This form is evaluated.
                     
DECLARATION-FIELD-DESCRIPTORS should be a list, each entry of which is
either a list of the form

  (FIELD-NAME . OPTIONS)

or, simply a symbol naming the field---a shorthand for declaring a
field with that name and no options. See also
`transform-declaration-field-descriptor'.

OPTIONS is a property list of field options. Valid keys are:

 :INITFORM          A form evaluated to initialize the field
                    upon cloning. If :initform is not provided,
                    the value is inherited from the PARENT.
                    With ":initform nil", the field is initialized 
                    with the value nil.
 :DOCUMENTATION     Documentation string for the field.
** DEFSPRITE (macro)
*** Arguments
(&REST ARGS)
** DIRECTION-TO (function)
*** Arguments
(R1 C1 R2 C2)
*** Documentation
Return general direction of the ray from R1,C1 to R2,C2.
** DIRECTORY-IS-MODULE-P (function)
*** Arguments
(DIR)
*** Documentation
Test whether a PAK index file exists in a directory.
** DISABLE-CLASSIC-KEY-REPEAT (function)
** DISABLE-HELD-KEYS (function)
*** Documentation
Disable key repeat.
** DISABLE-TIMER (function)
*** Documentation
Disable timer events.
** DISPATCH-EVENT (function)
*** Arguments
(EVENT)
*** Documentation
Send EVENT to the handler function.
** DISTANCE (function)
*** Arguments
(X1 Y1 X2 Y2)
*** Documentation
Compute the distance between the points X1,Y1 and X2,Y2.
** DO-CELLS (macro)
*** Arguments
(&REST ARGS)
