notebook/xe2-reference.html

<div id="outline-container-30-58-1" class="outline-4">
<h4 id="sec-30-58-1">Arguments </h4>
<div class="outline-text-4" id="text-30-58-1">

<p>(HOOK FUNC)
</p></div>

</div>

<div id="outline-container-30-58-2" class="outline-4">
<h4 id="sec-30-58-2">Documentation </h4>
<div class="outline-text-4" id="text-30-58-2">

<p>Hooks are special variables whose names are of the form
`*foo-hook*' and whose values are lists of functions taking no
arguments. The functions of a given hook are all invoked (in list
order) whenever the hook is run with `run-hook'.
</p>
<p>
This function arranges for FUNC to be invoked whenever HOOK is triggered with
`run-hook'. The function should have no arguments.
</p></div>
</div>

</div>

<div id="outline-container-30-59" class="outline-3">
<h3 id="sec-30-59">ADD-MESSAGE-VERBOSITIES (function) </h3>
<div class="outline-text-3" id="text-30-59">


</div>

<div id="outline-container-30-59-1" class="outline-4">
<h4 id="sec-30-59-1">Arguments </h4>
<div class="outline-text-4" id="text-30-59-1">

<p>(PLIST)
</p></div>
</div>

</div>

<div id="outline-container-30-60" class="outline-3">
<h3 id="sec-30-60">ADD-OVERLAY (variable) </h3>
<div class="outline-text-3" id="text-30-60">

</div>

</div>

<div id="outline-container-30-61" class="outline-3">
<h3 id="sec-30-61">BIND-KEY-TO-METHOD (function) </h3>
<div class="outline-text-3" id="text-30-61">


</div>

<div id="outline-container-30-61-1" class="outline-4">
<h4 id="sec-30-61-1">Arguments </h4>
<div class="outline-text-4" id="text-30-61-1">

<p>(P KEY MODIFIERS METHOD-KEYWORD)
</p></div>
</div>

</div>

<div id="outline-container-30-62" class="outline-3">
<h3 id="sec-30-62">BIND-KEY-TO-PROMPT-INSERTION (function) </h3>
<div class="outline-text-3" id="text-30-62">


</div>

<div id="outline-container-30-62-1" class="outline-4">
<h4 id="sec-30-62-1">Arguments </h4>
<div class="outline-text-4" id="text-30-62-1">

<p>(P KEY MODIFIERS &amp;OPTIONAL (INSERTION KEY))
</p></div>

</div>

<div id="outline-container-30-62-2" class="outline-4">
<h4 id="sec-30-62-2">Documentation </h4>
<div class="outline-text-4" id="text-30-62-2">

<p>For prompt P ensure that the event (KEY MODIFIERS) causes the
text INSERTION to be inserted at point.
</p></div>
</div>

</div>

<div id="outline-container-30-63" class="outline-3">
<h3 id="sec-30-63">BROWSER (variable) </h3>
<div class="outline-text-3" id="text-30-63">

</div>

</div>

<div id="outline-container-30-64" class="outline-3">
<h3 id="sec-30-64">CLONE (function) </h3>
<div class="outline-text-3" id="text-30-64">


</div>

<div id="outline-container-30-64-1" class="outline-4">
<h4 id="sec-30-64-1">Arguments </h4>
<div class="outline-text-4" id="text-30-64-1">

<p>(PROTOTYPE &amp;REST INITARGS)
</p></div>

</div>

<div id="outline-container-30-64-2" class="outline-4">
<h4 id="sec-30-64-2">Documentation </h4>
<div class="outline-text-4" id="text-30-64-2">

<p>Create a new object from PROTOTYPE and pass INITARGS to the
initializer. The new object is created with fields for which INITFORMS
were specified (if any; see `define-prototype'); the INITFORMS are
evaluated, then any applicable initializer is triggered.
</p></div>
</div>

</div>

<div id="outline-container-30-65" class="outline-3">
<h3 id="sec-30-65">COMPOSE-BLANK-FIELDS (function) </h3>
<div class="outline-text-3" id="text-30-65">


</div>

<div id="outline-container-30-65-1" class="outline-4">
<h4 id="sec-30-65-1">Arguments </h4>
<div class="outline-text-4" id="text-30-65-1">

<p>(&amp;OPTIONAL DESCRIPTORS (TYPE HASH))
</p></div>
</div>

</div>

<div id="outline-container-30-66" class="outline-3">
<h3 id="sec-30-66">CREATE-IMAGE (function) </h3>
<div class="outline-text-3" id="text-30-66">


</div>

<div id="outline-container-30-66-1" class="outline-4">
<h4 id="sec-30-66-1">Arguments </h4>
<div class="outline-text-4" id="text-30-66-1">

<p>(WIDTH HEIGHT)
</p></div>

</div>

<div id="outline-container-30-66-2" class="outline-4">
<h4 id="sec-30-66-2">Documentation </h4>
<div class="outline-text-4" id="text-30-66-2">

<p>Create a new XE2 image of size (* WIDTH HEIGHT).
</p></div>
</div>

</div>

<div id="outline-container-30-67" class="outline-3">
<h3 id="sec-30-67">DEFCELL (macro) </h3>
<div class="outline-text-3" id="text-30-67">


</div>

<div id="outline-container-30-67-1" class="outline-4">
<h4 id="sec-30-67-1">Arguments </h4>
<div class="outline-text-4" id="text-30-67-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-67-2" class="outline-4">
<h4 id="sec-30-67-2">Documentation </h4>
<div class="outline-text-4" id="text-30-67-2">

<p>Define a cell named NAME, with the fields ARGS as in a normal
prototype declaration. This is a convenience macro for defining new
cells.
</p></div>
</div>

</div>

<div id="outline-container-30-68" class="outline-3">
<h3 id="sec-30-68">DEFINE-METHOD (macro) </h3>
<div class="outline-text-3" id="text-30-68">


</div>

<div id="outline-container-30-68-1" class="outline-4">
<h4 id="sec-30-68-1">Arguments </h4>
<div class="outline-text-4" id="text-30-68-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-68-2" class="outline-4">
<h4 id="sec-30-68-2">Documentation </h4>
<div class="outline-text-4" id="text-30-68-2">

<p>Define a new method.
</p>
<p>
METHOD-NAME is a symbol naming the method.  PROTOTYPE-NAME is the name
of the prototype you are defining a method for. This should be a
symbol (without equals signs&mdash;see Prototype Names. ARGLIST is
the argument list for the method. If METHOD-BODY begins with a string,
this string becomes the documentation string for the method.
</p>
<p>
Any DECLARE forms must appear as the first non-string sexp.
</p>
<p>
The forms in METHOD-BODY are executed when the method is invoked.
The hidden argument `self' may be referred to as needed within
the method body; it is bound to the object upon which the method
was invoked.
</p></div>
</div>

</div>

<div id="outline-container-30-69" class="outline-3">
<h3 id="sec-30-69">DEFINE-PROTOTYPE (macro) </h3>
<div class="outline-text-3" id="text-30-69">


</div>

<div id="outline-container-30-69-1" class="outline-4">
<h4 id="sec-30-69-1">Arguments </h4>
<div class="outline-text-4" id="text-30-69-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-69-2" class="outline-4">
<h4 id="sec-30-69-2">Documentation </h4>
<div class="outline-text-4" id="text-30-69-2">

<p>Create a new object prototype (possibly based on another prototype).
</p>
<p>
NAME should be a symbol naming the prototype. A special variable is
created, with equals signs bracketing the name; this variable's value
is the resulting prototype. For example, if your prototype is named
`foo', the special variable will be named `=foo=', and you create
objects with:
</p>
<p>
 (clone =foo=)
</p>
<p>
See also `clone'. 
</p>
<p>
The second argument is a property list of options for the
prototype. Valid keys are:
</p>
<p>
 :DOCUMENTATION     The documentation string for this prototype.
 :PARENT            The parent prototype from which the new prototype will 
                    inherit fields. This form is evaluated.
</p>
<p>                     
DECLARATION-FIELD-DESCRIPTORS should be a list, each entry of which is
either a list of the form
</p>
<p>
  (FIELD-NAME . OPTIONS)
</p>
<p>
or, simply a symbol naming the field&mdash;a shorthand for declaring a
field with that name and no options. See also
`transform-declaration-field-descriptor'.
</p>
<p>
OPTIONS is a property list of field options. Valid keys are:
</p>
<p>
 :INITFORM          A form evaluated to initialize the field
                    upon cloning. If :initform is not provided,
                    the value is inherited from the PARENT.
                    With ":initform nil", the field is initialized 
                    with the value nil.
 :DOCUMENTATION     Documentation string for the field.
</p></div>
</div>

</div>

<div id="outline-container-30-70" class="outline-3">
<h3 id="sec-30-70">DEFSPRITE (macro) </h3>
<div class="outline-text-3" id="text-30-70">


</div>

<div id="outline-container-30-70-1" class="outline-4">
<h4 id="sec-30-70-1">Arguments </h4>
<div class="outline-text-4" id="text-30-70-1">

<p>(&amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-30-71" class="outline-3">
<h3 id="sec-30-71">DIRECTION-TO (function) </h3>
<div class="outline-text-3" id="text-30-71">


</div>

<div id="outline-container-30-71-1" class="outline-4">
<h4 id="sec-30-71-1">Arguments </h4>
<div class="outline-text-4" id="text-30-71-1">

<p>(R1 C1 R2 C2)
</p></div>

</div>

<div id="outline-container-30-71-2" class="outline-4">
<h4 id="sec-30-71-2">Documentation </h4>
<div class="outline-text-4" id="text-30-71-2">

<p>Return general direction of the ray from R1,C1 to R2,C2.
</p></div>
</div>

</div>

<div id="outline-container-30-72" class="outline-3">
<h3 id="sec-30-72">DIRECTORY-IS-MODULE-P (function) </h3>
<div class="outline-text-3" id="text-30-72">


</div>

<div id="outline-container-30-72-1" class="outline-4">
<h4 id="sec-30-72-1">Arguments </h4>
<div class="outline-text-4" id="text-30-72-1">

<p>(DIR)
</p></div>

</div>

<div id="outline-container-30-72-2" class="outline-4">
<h4 id="sec-30-72-2">Documentation </h4>
<div class="outline-text-4" id="text-30-72-2">

<p>Test whether a PAK index file exists in a directory.
</p></div>
</div>

</div>

<div id="outline-container-30-73" class="outline-3">
<h3 id="sec-30-73">DISABLE-CLASSIC-KEY-REPEAT (function) </h3>
<div class="outline-text-3" id="text-30-73">

</div>

</div>

<div id="outline-container-30-74" class="outline-3">
<h3 id="sec-30-74">DISABLE-HELD-KEYS (function) </h3>
<div class="outline-text-3" id="text-30-74">


</div>

<div id="outline-container-30-74-1" class="outline-4">
<h4 id="sec-30-74-1">Documentation </h4>
<div class="outline-text-4" id="text-30-74-1">

<p>Disable key repeat.
</p></div>
</div>

</div>

<div id="outline-container-30-75" class="outline-3">
<h3 id="sec-30-75">DISABLE-TIMER (function) </h3>
<div class="outline-text-3" id="text-30-75">


</div>

<div id="outline-container-30-75-1" class="outline-4">
<h4 id="sec-30-75-1">Documentation </h4>
<div class="outline-text-4" id="text-30-75-1">

<p>Disable timer events.
</p></div>
</div>

</div>

<div id="outline-container-30-76" class="outline-3">
<h3 id="sec-30-76">DISPATCH-EVENT (function) </h3>
<div class="outline-text-3" id="text-30-76">


</div>

<div id="outline-container-30-76-1" class="outline-4">
<h4 id="sec-30-76-1">Arguments </h4>
<div class="outline-text-4" id="text-30-76-1">

<p>(EVENT)
</p></div>

</div>

<div id="outline-container-30-76-2" class="outline-4">
<h4 id="sec-30-76-2">Documentation </h4>
<div class="outline-text-4" id="text-30-76-2">

<p>Send EVENT to the handler function.
</p></div>
</div>

</div>

<div id="outline-container-30-77" class="outline-3">
<h3 id="sec-30-77">DISTANCE (function) </h3>
<div class="outline-text-3" id="text-30-77">


</div>

<div id="outline-container-30-77-1" class="outline-4">
<h4 id="sec-30-77-1">Arguments </h4>
<div class="outline-text-4" id="text-30-77-1">

<p>(X1 Y1 X2 Y2)
</p></div>

</div>

<div id="outline-container-30-77-2" class="outline-4">
<h4 id="sec-30-77-2">Documentation </h4>
<div class="outline-text-4" id="text-30-77-2">

<p>Compute the distance between the points X1,Y1 and X2,Y2.
</p></div>
</div>

</div>
