notebook/xe2-reference.org
*** Documentation
Execute the forms in BODY with VAR bound successively to the
elements of the vector produced by evaluating EXPR.
** DRAW-BOX (function)
*** Arguments
(X Y WIDTH HEIGHT &KEY (STROKE-COLOR .white) (COLOR .black) DESTINATION)
*** Documentation
Draw a filled rectangle at (X Y) of size (* WIDTH HEIGHT).
** DRAW-CIRCLE (function)
*** Arguments
(X Y RADIUS &KEY (COLOR .white) DESTINATION)
** DRAW-IMAGE (function)
*** Arguments
(IMAGE X Y &KEY (DESTINATION *DEFAULT-SURFACE*) (RENDER-CELL NIL))
*** Documentation
Draw the IMAGE at offset (X Y) on the image DESTINATION.
The default destination is the main window.
** DRAW-LINE (function)
*** Arguments
(X0 Y0 X1 Y1 &KEY (COLOR .white) DESTINATION)
** DRAW-PIXEL (function)
*** Arguments
(X Y &KEY (COLOR .white) DESTINATION)
** DRAW-RECTANGLE (function)
*** Arguments
(X Y WIDTH HEIGHT &KEY (COLOR .white) DESTINATION)
** DRAW-RESOURCE-IMAGE (function)
*** Arguments
(NAME X Y &KEY (DESTINATION *DEFAULT-SURFACE*) (RENDER-CELL NIL))
*** Documentation
Draw the image named by NAME at offset (X Y) on the image DESTINATION.
The default destination is the main window.
** DRAW-STRING-SHADED (function)
*** Arguments
(STRING X Y &OPTIONAL (FOREGROUND .white) (BACKGROUND .black) &KEY DESTINATION
        (FONT *DEFAULT-FONT*))
** DRAW-STRING-SOLID (function)
*** Arguments
(STRING X Y &KEY DESTINATION (FONT *DEFAULT-FONT*) (COLOR .white))
** ENABLE-CLASSIC-KEY-REPEAT (function)
*** Arguments
(DELAY INTERVAL)
** ENABLE-HELD-KEYS (function)
*** Arguments
(&REST ARGS)
*** Documentation
Enable key repeat on every frame when held. Arguments are ignored
for backward-compatibility.
** ENABLE-TIMER (function)
*** Documentation
Enable timer events. The next scheduled event will be the first sent.
** EXPANSIONS (function)
*** Arguments
(VARIABLE)
** FIELD-OPTION-VALUE (function)
*** Arguments
(FIELD OBJECT OPTION)
*** Documentation
Return the value of the OPTION for FIELD in OBJECT.
** FIELD-OPTIONS (function)
*** Arguments
(FIELD OBJECT)
*** Documentation
Obtain the options property list for FIELD in OBJECT.
** FIELD-REFERENCE-P (function)
*** Arguments
(FORM)
*** Documentation
Return non-nil if FORM is a symbol like <foo>.
** FIELD-VALUE (function)
*** Arguments
(FIELD OBJECT &OPTIONAL NOERROR)
*** Documentation
Return the value of FIELD in OBJECT.
If the FIELD has no value in OBJECT, then the object's parent is also
checked, and so on. If a value is found during these checks, it is
returned. If a value cannot be found, an error of type `no-such-field'
is signaled, unless NOERROR is non-nil; in that case,
`*lookup-failure*' is returned. See also `has-field'.
** FIND-ALL-MODULES (function)
** FIND-MODULE-PATH (function)
*** Arguments
(MODULE-NAME)
*** Documentation
Search the `*module-directories*' path for a directory with the
name MODULE-NAME. Returns the pathname if found, otherwise nil.
** FIND-MODULES-IN-DIRECTORY (function)
*** Arguments
(DIR)
*** Documentation
Search DIR for modules and return a list of their names.
** FIND-RESOURCE (function)
*** Arguments
(NAME &OPTIONAL NOERROR)
*** Documentation
Obtain the resource named NAME, performing any necessary loading
and/or transformations. Unless NOERROR is non-nil, signal an error
when NAME cannot be found.
** FIND-RESOURCE-OBJECT (function)
*** Arguments
(NAME)
*** Documentation
Obtain the resource object named NAME, or signal an error if not
found.
** FIND-RESOURCE-PROPERTY (function)
*** Arguments
(RESOURCE-NAME PROPERTY)
