notebook/xe2-reference.html

<div id="outline-container-30-78" class="outline-3">
<h3 id="sec-30-78">DO-CELLS (macro) </h3>
<div class="outline-text-3" id="text-30-78">


</div>

<div id="outline-container-30-78-1" class="outline-4">
<h4 id="sec-30-78-1">Arguments </h4>
<div class="outline-text-4" id="text-30-78-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-78-2" class="outline-4">
<h4 id="sec-30-78-2">Documentation </h4>
<div class="outline-text-4" id="text-30-78-2">

<p>Execute the forms in BODY with VAR bound successively to the
elements of the vector produced by evaluating EXPR.
</p></div>
</div>

</div>

<div id="outline-container-30-79" class="outline-3">
<h3 id="sec-30-79">DRAW-BOX (function) </h3>
<div class="outline-text-3" id="text-30-79">


</div>

<div id="outline-container-30-79-1" class="outline-4">
<h4 id="sec-30-79-1">Arguments </h4>
<div class="outline-text-4" id="text-30-79-1">

<p>(X Y WIDTH HEIGHT &amp;KEY (STROKE-COLOR .white) (COLOR .black) DESTINATION)
</p></div>

</div>

<div id="outline-container-30-79-2" class="outline-4">
<h4 id="sec-30-79-2">Documentation </h4>
<div class="outline-text-4" id="text-30-79-2">

<p>Draw a filled rectangle at (X Y) of size (* WIDTH HEIGHT).
</p></div>
</div>

</div>

<div id="outline-container-30-80" class="outline-3">
<h3 id="sec-30-80">DRAW-CIRCLE (function) </h3>
<div class="outline-text-3" id="text-30-80">


</div>

<div id="outline-container-30-80-1" class="outline-4">
<h4 id="sec-30-80-1">Arguments </h4>
<div class="outline-text-4" id="text-30-80-1">

<p>(X Y RADIUS &amp;KEY (COLOR .white) DESTINATION)
</p></div>
</div>

</div>

<div id="outline-container-30-81" class="outline-3">
<h3 id="sec-30-81">DRAW-IMAGE (function) </h3>
<div class="outline-text-3" id="text-30-81">


</div>

<div id="outline-container-30-81-1" class="outline-4">
<h4 id="sec-30-81-1">Arguments </h4>
<div class="outline-text-4" id="text-30-81-1">

<p>(IMAGE X Y &amp;KEY (DESTINATION *DEFAULT-SURFACE*) (RENDER-CELL NIL))
</p></div>

</div>

<div id="outline-container-30-81-2" class="outline-4">
<h4 id="sec-30-81-2">Documentation </h4>
<div class="outline-text-4" id="text-30-81-2">

<p>Draw the IMAGE at offset (X Y) on the image DESTINATION.
The default destination is the main window.
</p></div>
</div>

</div>

<div id="outline-container-30-82" class="outline-3">
<h3 id="sec-30-82">DRAW-LINE (function) </h3>
<div class="outline-text-3" id="text-30-82">


</div>

<div id="outline-container-30-82-1" class="outline-4">
<h4 id="sec-30-82-1">Arguments </h4>
<div class="outline-text-4" id="text-30-82-1">

<p>(X0 Y0 X1 Y1 &amp;KEY (COLOR .white) DESTINATION)
</p></div>
</div>

</div>

<div id="outline-container-30-83" class="outline-3">
<h3 id="sec-30-83">DRAW-PIXEL (function) </h3>
<div class="outline-text-3" id="text-30-83">


</div>

<div id="outline-container-30-83-1" class="outline-4">
<h4 id="sec-30-83-1">Arguments </h4>
<div class="outline-text-4" id="text-30-83-1">

<p>(X Y &amp;KEY (COLOR .white) DESTINATION)
</p></div>
</div>

</div>

<div id="outline-container-30-84" class="outline-3">
<h3 id="sec-30-84">DRAW-RECTANGLE (function) </h3>
<div class="outline-text-3" id="text-30-84">


</div>

<div id="outline-container-30-84-1" class="outline-4">
<h4 id="sec-30-84-1">Arguments </h4>
<div class="outline-text-4" id="text-30-84-1">

<p>(X Y WIDTH HEIGHT &amp;KEY (COLOR .white) DESTINATION)
</p></div>
</div>

</div>

<div id="outline-container-30-85" class="outline-3">
<h3 id="sec-30-85">DRAW-RESOURCE-IMAGE (function) </h3>
<div class="outline-text-3" id="text-30-85">


</div>

<div id="outline-container-30-85-1" class="outline-4">
<h4 id="sec-30-85-1">Arguments </h4>
<div class="outline-text-4" id="text-30-85-1">

<p>(NAME X Y &amp;KEY (DESTINATION *DEFAULT-SURFACE*) (RENDER-CELL NIL))
</p></div>

</div>

<div id="outline-container-30-85-2" class="outline-4">
<h4 id="sec-30-85-2">Documentation </h4>
<div class="outline-text-4" id="text-30-85-2">

<p>Draw the image named by NAME at offset (X Y) on the image DESTINATION.
The default destination is the main window.
</p></div>
</div>

</div>

<div id="outline-container-30-86" class="outline-3">
<h3 id="sec-30-86">DRAW-STRING-SHADED (function) </h3>
<div class="outline-text-3" id="text-30-86">


</div>

<div id="outline-container-30-86-1" class="outline-4">
<h4 id="sec-30-86-1">Arguments </h4>
<div class="outline-text-4" id="text-30-86-1">

<p>(STRING X Y &amp;OPTIONAL (FOREGROUND .white) (BACKGROUND .black) &amp;KEY DESTINATION
        (FONT *DEFAULT-FONT*))
</p></div>
</div>

</div>

<div id="outline-container-30-87" class="outline-3">
<h3 id="sec-30-87">DRAW-STRING-SOLID (function) </h3>
<div class="outline-text-3" id="text-30-87">


</div>

<div id="outline-container-30-87-1" class="outline-4">
<h4 id="sec-30-87-1">Arguments </h4>
<div class="outline-text-4" id="text-30-87-1">

<p>(STRING X Y &amp;KEY DESTINATION (FONT *DEFAULT-FONT*) (COLOR .white))
</p></div>
</div>

</div>

<div id="outline-container-30-88" class="outline-3">
<h3 id="sec-30-88">ENABLE-CLASSIC-KEY-REPEAT (function) </h3>
<div class="outline-text-3" id="text-30-88">


</div>

<div id="outline-container-30-88-1" class="outline-4">
<h4 id="sec-30-88-1">Arguments </h4>
<div class="outline-text-4" id="text-30-88-1">

<p>(DELAY INTERVAL)
</p></div>
</div>

</div>

<div id="outline-container-30-89" class="outline-3">
<h3 id="sec-30-89">ENABLE-HELD-KEYS (function) </h3>
<div class="outline-text-3" id="text-30-89">


</div>

<div id="outline-container-30-89-1" class="outline-4">
<h4 id="sec-30-89-1">Arguments </h4>
<div class="outline-text-4" id="text-30-89-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-89-2" class="outline-4">
<h4 id="sec-30-89-2">Documentation </h4>
<div class="outline-text-4" id="text-30-89-2">

<p>Enable key repeat on every frame when held. Arguments are ignored
for backward-compatibility.
</p></div>
</div>

</div>

<div id="outline-container-30-90" class="outline-3">
<h3 id="sec-30-90">ENABLE-TIMER (function) </h3>
<div class="outline-text-3" id="text-30-90">


</div>

<div id="outline-container-30-90-1" class="outline-4">
<h4 id="sec-30-90-1">Documentation </h4>
<div class="outline-text-4" id="text-30-90-1">

<p>Enable timer events. The next scheduled event will be the first sent.
</p></div>
</div>

</div>

<div id="outline-container-30-91" class="outline-3">
<h3 id="sec-30-91">EXPANSIONS (function) </h3>
<div class="outline-text-3" id="text-30-91">


</div>

<div id="outline-container-30-91-1" class="outline-4">
<h4 id="sec-30-91-1">Arguments </h4>
<div class="outline-text-4" id="text-30-91-1">

<p>(VARIABLE)
</p></div>
</div>

</div>

<div id="outline-container-30-92" class="outline-3">
<h3 id="sec-30-92">FIELD-OPTION-VALUE (function) </h3>
<div class="outline-text-3" id="text-30-92">


</div>

<div id="outline-container-30-92-1" class="outline-4">
<h4 id="sec-30-92-1">Arguments </h4>
<div class="outline-text-4" id="text-30-92-1">

<p>(FIELD OBJECT OPTION)
</p></div>

</div>

<div id="outline-container-30-92-2" class="outline-4">
<h4 id="sec-30-92-2">Documentation </h4>
<div class="outline-text-4" id="text-30-92-2">

<p>Return the value of the OPTION for FIELD in OBJECT.
</p></div>
</div>

</div>

<div id="outline-container-30-93" class="outline-3">
<h3 id="sec-30-93">FIELD-OPTIONS (function) </h3>
<div class="outline-text-3" id="text-30-93">


</div>

<div id="outline-container-30-93-1" class="outline-4">
<h4 id="sec-30-93-1">Arguments </h4>
<div class="outline-text-4" id="text-30-93-1">

<p>(FIELD OBJECT)
</p></div>

</div>

<div id="outline-container-30-93-2" class="outline-4">
<h4 id="sec-30-93-2">Documentation </h4>
<div class="outline-text-4" id="text-30-93-2">

<p>Obtain the options property list for FIELD in OBJECT.
</p></div>
</div>

</div>

<div id="outline-container-30-94" class="outline-3">
<h3 id="sec-30-94">FIELD-REFERENCE-P (function) </h3>
<div class="outline-text-3" id="text-30-94">


</div>

<div id="outline-container-30-94-1" class="outline-4">
<h4 id="sec-30-94-1">Arguments </h4>
<div class="outline-text-4" id="text-30-94-1">

<p>(FORM)
</p></div>

</div>

<div id="outline-container-30-94-2" class="outline-4">
<h4 id="sec-30-94-2">Documentation </h4>
<div class="outline-text-4" id="text-30-94-2">

<p>Return non-nil if FORM is a symbol like &lt;foo&gt;.
</p></div>
</div>

</div>

<div id="outline-container-30-95" class="outline-3">
<h3 id="sec-30-95">FIELD-VALUE (function) </h3>
<div class="outline-text-3" id="text-30-95">


</div>

<div id="outline-container-30-95-1" class="outline-4">
<h4 id="sec-30-95-1">Arguments </h4>
<div class="outline-text-4" id="text-30-95-1">

<p>(FIELD OBJECT &amp;OPTIONAL NOERROR)
</p></div>

</div>

<div id="outline-container-30-95-2" class="outline-4">
<h4 id="sec-30-95-2">Documentation </h4>
<div class="outline-text-4" id="text-30-95-2">

<p>Return the value of FIELD in OBJECT.
If the FIELD has no value in OBJECT, then the object's parent is also
checked, and so on. If a value is found during these checks, it is
returned. If a value cannot be found, an error of type `no-such-field'
is signaled, unless NOERROR is non-nil; in that case,
`*lookup-failure*' is returned. See also `has-field'.
</p></div>
</div>

</div>

<div id="outline-container-30-96" class="outline-3">
<h3 id="sec-30-96">FIND-ALL-MODULES (function) </h3>
<div class="outline-text-3" id="text-30-96">

</div>

</div>

<div id="outline-container-30-97" class="outline-3">
<h3 id="sec-30-97">FIND-MODULE-PATH (function) </h3>
<div class="outline-text-3" id="text-30-97">


</div>

<div id="outline-container-30-97-1" class="outline-4">
<h4 id="sec-30-97-1">Arguments </h4>
<div class="outline-text-4" id="text-30-97-1">

<p>(MODULE-NAME)
</p></div>

</div>

<div id="outline-container-30-97-2" class="outline-4">
<h4 id="sec-30-97-2">Documentation </h4>
<div class="outline-text-4" id="text-30-97-2">

<p>Search the `*module-directories*' path for a directory with the
name MODULE-NAME. Returns the pathname if found, otherwise nil.
</p></div>
</div>

</div>

<div id="outline-container-30-98" class="outline-3">
<h3 id="sec-30-98">FIND-MODULES-IN-DIRECTORY (function) </h3>
<div class="outline-text-3" id="text-30-98">


</div>

<div id="outline-container-30-98-1" class="outline-4">
<h4 id="sec-30-98-1">Arguments </h4>
<div class="outline-text-4" id="text-30-98-1">

<p>(DIR)
</p></div>

</div>

<div id="outline-container-30-98-2" class="outline-4">
<h4 id="sec-30-98-2">Documentation </h4>
<div class="outline-text-4" id="text-30-98-2">

<p>Search DIR for modules and return a list of their names.
</p></div>
</div>

</div>

<div id="outline-container-30-99" class="outline-3">
<h3 id="sec-30-99">FIND-RESOURCE (function) </h3>
<div class="outline-text-3" id="text-30-99">


</div>

<div id="outline-container-30-99-1" class="outline-4">
<h4 id="sec-30-99-1">Arguments </h4>
<div class="outline-text-4" id="text-30-99-1">

<p>(NAME &amp;OPTIONAL NOERROR)
</p></div>

</div>

<div id="outline-container-30-99-2" class="outline-4">
<h4 id="sec-30-99-2">Documentation </h4>
<div class="outline-text-4" id="text-30-99-2">

<p>Obtain the resource named NAME, performing any necessary loading
and/or transformations. Unless NOERROR is non-nil, signal an error
when NAME cannot be found.
</p></div>
</div>

</div>

<div id="outline-container-30-100" class="outline-3">
<h3 id="sec-30-100">FIND-RESOURCE-OBJECT (function) </h3>
<div class="outline-text-3" id="text-30-100">


</div>

<div id="outline-container-30-100-1" class="outline-4">
<h4 id="sec-30-100-1">Arguments </h4>
<div class="outline-text-4" id="text-30-100-1">

<p>(NAME)
</p></div>

</div>

<div id="outline-container-30-100-2" class="outline-4">
<h4 id="sec-30-100-2">Documentation </h4>
<div class="outline-text-4" id="text-30-100-2">

<p>Obtain the resource object named NAME, or signal an error if not
found.
</p></div>
</div>

</div>

<div id="outline-container-30-101" class="outline-3">
<h3 id="sec-30-101">FIND-RESOURCE-PROPERTY (function) </h3>
<div class="outline-text-3" id="text-30-101">


</div>

<div id="outline-container-30-101-1" class="outline-4">
<h4 id="sec-30-101-1">Arguments </h4>
<div class="outline-text-4" id="text-30-101-1">

<p>(RESOURCE-NAME PROPERTY)
</p></div>

</div>
