notebook/xe2-reference.org
*** Documentation
Read the value of PROPERTY from the resource RESOURCE-NAME.
** FONT-HEIGHT (function)
*** Arguments
(FONT)
** FONT-TEXT-EXTENTS (function)
*** Arguments
(STRING FONT)
** FONT-WIDTH (function)
*** Arguments
(FONT)
** FORMATTED-LINE-HEIGHT (function)
*** Arguments
(LINE)
** FORMATTED-LINE-WIDTH (function)
*** Arguments
(LINE)
** FORMATTED-STRING-HEIGHT (function)
*** Arguments
(S)
** FORMATTED-STRING-WIDTH (function)
*** Arguments
(S)
** GENERATE (function)
*** Arguments
(PHRASE)
*** Documentation
Generate a random phrase using the grammar in `*grammar*'.
** GENSEQ (function)
*** Arguments
(&OPTIONAL (X 0))
*** Documentation
Generate an all-purpose sequence number.
** GET-COLOR (variable)
** GET-SOME-OBJECT-NAME (function)
*** Arguments
(OB)
** GOAL (variable)
** HALT-MUSIC (function)
*** Arguments
(FADE-MILLISECONDS)
*** Documentation
Stop all music playing.
** HALT-SAMPLE (function)
*** Arguments
(CHANNEL &REST ARGS)
** HAS-FIELD (function)
*** Arguments
(FIELD OBJECT)
*** Documentation
Return non-nil if FIELD has any value in OBJECT.
** ICON-IMAGE (function)
*** Arguments
(KEY)
*** Documentation
Return an icon image name for KEY.
** ICON-RESOURCE (function)
*** Arguments
(KEY)
*** Documentation
Return an icon resource for the key KEY.
The standard GEAR icon is used when no other applicable icon can be
found.
** INDEX-MODULE (function)
*** Arguments
(MODULE-NAME)
*** Documentation
Add all the resources from the module MODULE-NAME to the resource
table.
** INDEX-RESOURCE (function)
*** Arguments
(RESOURCE)
*** Documentation
Add the RESOURCE's record to the resource table.
If a record with that name already exists, it is replaced.  However,
if the resource is an :alias, just the string name of the target
resource is stored; see also `find-resource'.
** INITIALIZE-COLORS (function)
*** Documentation
Load the X11 color data into the resource table.
** INITIALIZE-ENGINE (variable)
** INITIALIZE-RESOURCE-TABLE (function)
*** Documentation
Create a new empty resource table.
** INSTALL-WIDGET (function)
*** Arguments
(WIDGET)
** INSTALL-WIDGETS (function)
*** Arguments
(&REST WIDGETS)
*** Documentation
User-level function for setting the active widget set. Note that
XE2 may override the current widget set at any time for system menus
and the like.
** IS-ZOOMED-RESOURCE (function)
*** Arguments
(RESOURCE)
*** Documentation
Return non-nil if the RESOURCE should be zoomed by `*zoom-factor*'.
** LEFT-HAND-SIDE (function)
*** Arguments
(RULE)
** LOAD-FONT-RESOURCE (function)
*** Arguments
(RESOURCE)
** LOAD-IMAGE-RESOURCE (function)
*** Arguments
(RESOURCE)
*** Documentation
Loads an :IMAGE-type pak resource from a :FILE on disk.
** LOAD-LISP-RESOURCE (function)
*** Arguments
(RESOURCE)
** LOAD-MODULE (function)
*** Arguments
(MODULE)
