notebook/xe2-reference.html

<div id="outline-container-30-101-2" class="outline-4">
<h4 id="sec-30-101-2">Documentation </h4>
<div class="outline-text-4" id="text-30-101-2">

<p>Read the value of PROPERTY from the resource RESOURCE-NAME.
</p></div>
</div>

</div>

<div id="outline-container-30-102" class="outline-3">
<h3 id="sec-30-102">FONT-HEIGHT (function) </h3>
<div class="outline-text-3" id="text-30-102">


</div>

<div id="outline-container-30-102-1" class="outline-4">
<h4 id="sec-30-102-1">Arguments </h4>
<div class="outline-text-4" id="text-30-102-1">

<p>(FONT)
</p></div>
</div>

</div>

<div id="outline-container-30-103" class="outline-3">
<h3 id="sec-30-103">FONT-TEXT-EXTENTS (function) </h3>
<div class="outline-text-3" id="text-30-103">


</div>

<div id="outline-container-30-103-1" class="outline-4">
<h4 id="sec-30-103-1">Arguments </h4>
<div class="outline-text-4" id="text-30-103-1">

<p>(STRING FONT)
</p></div>
</div>

</div>

<div id="outline-container-30-104" class="outline-3">
<h3 id="sec-30-104">FONT-WIDTH (function) </h3>
<div class="outline-text-3" id="text-30-104">


</div>

<div id="outline-container-30-104-1" class="outline-4">
<h4 id="sec-30-104-1">Arguments </h4>
<div class="outline-text-4" id="text-30-104-1">

<p>(FONT)
</p></div>
</div>

</div>

<div id="outline-container-30-105" class="outline-3">
<h3 id="sec-30-105">FORMATTED-LINE-HEIGHT (function) </h3>
<div class="outline-text-3" id="text-30-105">


</div>

<div id="outline-container-30-105-1" class="outline-4">
<h4 id="sec-30-105-1">Arguments </h4>
<div class="outline-text-4" id="text-30-105-1">

<p>(LINE)
</p></div>
</div>

</div>

<div id="outline-container-30-106" class="outline-3">
<h3 id="sec-30-106">FORMATTED-LINE-WIDTH (function) </h3>
<div class="outline-text-3" id="text-30-106">


</div>

<div id="outline-container-30-106-1" class="outline-4">
<h4 id="sec-30-106-1">Arguments </h4>
<div class="outline-text-4" id="text-30-106-1">

<p>(LINE)
</p></div>
</div>

</div>

<div id="outline-container-30-107" class="outline-3">
<h3 id="sec-30-107">FORMATTED-STRING-HEIGHT (function) </h3>
<div class="outline-text-3" id="text-30-107">


</div>

<div id="outline-container-30-107-1" class="outline-4">
<h4 id="sec-30-107-1">Arguments </h4>
<div class="outline-text-4" id="text-30-107-1">

<p>(S)
</p></div>
</div>

</div>

<div id="outline-container-30-108" class="outline-3">
<h3 id="sec-30-108">FORMATTED-STRING-WIDTH (function) </h3>
<div class="outline-text-3" id="text-30-108">


</div>

<div id="outline-container-30-108-1" class="outline-4">
<h4 id="sec-30-108-1">Arguments </h4>
<div class="outline-text-4" id="text-30-108-1">

<p>(S)
</p></div>
</div>

</div>

<div id="outline-container-30-109" class="outline-3">
<h3 id="sec-30-109">GENERATE (function) </h3>
<div class="outline-text-3" id="text-30-109">


</div>

<div id="outline-container-30-109-1" class="outline-4">
<h4 id="sec-30-109-1">Arguments </h4>
<div class="outline-text-4" id="text-30-109-1">

<p>(PHRASE)
</p></div>

</div>

<div id="outline-container-30-109-2" class="outline-4">
<h4 id="sec-30-109-2">Documentation </h4>
<div class="outline-text-4" id="text-30-109-2">

<p>Generate a random phrase using the grammar in `*grammar*'.
</p></div>
</div>

</div>

<div id="outline-container-30-110" class="outline-3">
<h3 id="sec-30-110">GENSEQ (function) </h3>
<div class="outline-text-3" id="text-30-110">


</div>

<div id="outline-container-30-110-1" class="outline-4">
<h4 id="sec-30-110-1">Arguments </h4>
<div class="outline-text-4" id="text-30-110-1">

<p>(&amp;OPTIONAL (X 0))
</p></div>

</div>

<div id="outline-container-30-110-2" class="outline-4">
<h4 id="sec-30-110-2">Documentation </h4>
<div class="outline-text-4" id="text-30-110-2">

<p>Generate an all-purpose sequence number.
</p></div>
</div>

</div>

<div id="outline-container-30-111" class="outline-3">
<h3 id="sec-30-111">GET-COLOR (variable) </h3>
<div class="outline-text-3" id="text-30-111">

</div>

</div>

<div id="outline-container-30-112" class="outline-3">
<h3 id="sec-30-112">GET-SOME-OBJECT-NAME (function) </h3>
<div class="outline-text-3" id="text-30-112">


</div>

<div id="outline-container-30-112-1" class="outline-4">
<h4 id="sec-30-112-1">Arguments </h4>
<div class="outline-text-4" id="text-30-112-1">

<p>(OB)
</p></div>
</div>

</div>

<div id="outline-container-30-113" class="outline-3">
<h3 id="sec-30-113">GOAL (variable) </h3>
<div class="outline-text-3" id="text-30-113">

</div>

</div>

<div id="outline-container-30-114" class="outline-3">
<h3 id="sec-30-114">HALT-MUSIC (function) </h3>
<div class="outline-text-3" id="text-30-114">


</div>

<div id="outline-container-30-114-1" class="outline-4">
<h4 id="sec-30-114-1">Arguments </h4>
<div class="outline-text-4" id="text-30-114-1">

<p>(FADE-MILLISECONDS)
</p></div>

</div>

<div id="outline-container-30-114-2" class="outline-4">
<h4 id="sec-30-114-2">Documentation </h4>
<div class="outline-text-4" id="text-30-114-2">

<p>Stop all music playing.
</p></div>
</div>

</div>

<div id="outline-container-30-115" class="outline-3">
<h3 id="sec-30-115">HALT-SAMPLE (function) </h3>
<div class="outline-text-3" id="text-30-115">


</div>

<div id="outline-container-30-115-1" class="outline-4">
<h4 id="sec-30-115-1">Arguments </h4>
<div class="outline-text-4" id="text-30-115-1">

<p>(CHANNEL &amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-30-116" class="outline-3">
<h3 id="sec-30-116">HAS-FIELD (function) </h3>
<div class="outline-text-3" id="text-30-116">


</div>

<div id="outline-container-30-116-1" class="outline-4">
<h4 id="sec-30-116-1">Arguments </h4>
<div class="outline-text-4" id="text-30-116-1">

<p>(FIELD OBJECT)
</p></div>

</div>

<div id="outline-container-30-116-2" class="outline-4">
<h4 id="sec-30-116-2">Documentation </h4>
<div class="outline-text-4" id="text-30-116-2">

<p>Return non-nil if FIELD has any value in OBJECT.
</p></div>
</div>

</div>

<div id="outline-container-30-117" class="outline-3">
<h3 id="sec-30-117">ICON-IMAGE (function) </h3>
<div class="outline-text-3" id="text-30-117">


</div>

<div id="outline-container-30-117-1" class="outline-4">
<h4 id="sec-30-117-1">Arguments </h4>
<div class="outline-text-4" id="text-30-117-1">

<p>(KEY)
</p></div>

</div>

<div id="outline-container-30-117-2" class="outline-4">
<h4 id="sec-30-117-2">Documentation </h4>
<div class="outline-text-4" id="text-30-117-2">

<p>Return an icon image name for KEY.
</p></div>
</div>

</div>

<div id="outline-container-30-118" class="outline-3">
<h3 id="sec-30-118">ICON-RESOURCE (function) </h3>
<div class="outline-text-3" id="text-30-118">


</div>

<div id="outline-container-30-118-1" class="outline-4">
<h4 id="sec-30-118-1">Arguments </h4>
<div class="outline-text-4" id="text-30-118-1">

<p>(KEY)
</p></div>

</div>

<div id="outline-container-30-118-2" class="outline-4">
<h4 id="sec-30-118-2">Documentation </h4>
<div class="outline-text-4" id="text-30-118-2">

<p>Return an icon resource for the key KEY.
The standard GEAR icon is used when no other applicable icon can be
found.
</p></div>
</div>

</div>

<div id="outline-container-30-119" class="outline-3">
<h3 id="sec-30-119">INDEX-MODULE (function) </h3>
<div class="outline-text-3" id="text-30-119">


</div>

<div id="outline-container-30-119-1" class="outline-4">
<h4 id="sec-30-119-1">Arguments </h4>
<div class="outline-text-4" id="text-30-119-1">

<p>(MODULE-NAME)
</p></div>

</div>

<div id="outline-container-30-119-2" class="outline-4">
<h4 id="sec-30-119-2">Documentation </h4>
<div class="outline-text-4" id="text-30-119-2">

<p>Add all the resources from the module MODULE-NAME to the resource
table.
</p></div>
</div>

</div>

<div id="outline-container-30-120" class="outline-3">
<h3 id="sec-30-120">INDEX-RESOURCE (function) </h3>
<div class="outline-text-3" id="text-30-120">


</div>

<div id="outline-container-30-120-1" class="outline-4">
<h4 id="sec-30-120-1">Arguments </h4>
<div class="outline-text-4" id="text-30-120-1">

<p>(RESOURCE)
</p></div>

</div>

<div id="outline-container-30-120-2" class="outline-4">
<h4 id="sec-30-120-2">Documentation </h4>
<div class="outline-text-4" id="text-30-120-2">

<p>Add the RESOURCE's record to the resource table.
If a record with that name already exists, it is replaced.  However,
if the resource is an :alias, just the string name of the target
resource is stored; see also `find-resource'.
</p></div>
</div>

</div>

<div id="outline-container-30-121" class="outline-3">
<h3 id="sec-30-121">INITIALIZE-COLORS (function) </h3>
<div class="outline-text-3" id="text-30-121">


</div>

<div id="outline-container-30-121-1" class="outline-4">
<h4 id="sec-30-121-1">Documentation </h4>
<div class="outline-text-4" id="text-30-121-1">

<p>Load the X11 color data into the resource table.
</p></div>
</div>

</div>

<div id="outline-container-30-122" class="outline-3">
<h3 id="sec-30-122">INITIALIZE-ENGINE (variable) </h3>
<div class="outline-text-3" id="text-30-122">

</div>

</div>

<div id="outline-container-30-123" class="outline-3">
<h3 id="sec-30-123">INITIALIZE-RESOURCE-TABLE (function) </h3>
<div class="outline-text-3" id="text-30-123">


</div>

<div id="outline-container-30-123-1" class="outline-4">
<h4 id="sec-30-123-1">Documentation </h4>
<div class="outline-text-4" id="text-30-123-1">

<p>Create a new empty resource table.
</p></div>
</div>

</div>

<div id="outline-container-30-124" class="outline-3">
<h3 id="sec-30-124">INSTALL-WIDGET (function) </h3>
<div class="outline-text-3" id="text-30-124">


</div>

<div id="outline-container-30-124-1" class="outline-4">
<h4 id="sec-30-124-1">Arguments </h4>
<div class="outline-text-4" id="text-30-124-1">

<p>(WIDGET)
</p></div>
</div>

</div>

<div id="outline-container-30-125" class="outline-3">
<h3 id="sec-30-125">INSTALL-WIDGETS (function) </h3>
<div class="outline-text-3" id="text-30-125">


</div>

<div id="outline-container-30-125-1" class="outline-4">
<h4 id="sec-30-125-1">Arguments </h4>
<div class="outline-text-4" id="text-30-125-1">

<p>(&amp;REST WIDGETS)
</p></div>

</div>

<div id="outline-container-30-125-2" class="outline-4">
<h4 id="sec-30-125-2">Documentation </h4>
<div class="outline-text-4" id="text-30-125-2">

<p>User-level function for setting the active widget set. Note that
XE2 may override the current widget set at any time for system menus
and the like.
</p></div>
</div>

</div>

<div id="outline-container-30-126" class="outline-3">
<h3 id="sec-30-126">IS-ZOOMED-RESOURCE (function) </h3>
<div class="outline-text-3" id="text-30-126">


</div>

<div id="outline-container-30-126-1" class="outline-4">
<h4 id="sec-30-126-1">Arguments </h4>
<div class="outline-text-4" id="text-30-126-1">

<p>(RESOURCE)
</p></div>

</div>

<div id="outline-container-30-126-2" class="outline-4">
<h4 id="sec-30-126-2">Documentation </h4>
<div class="outline-text-4" id="text-30-126-2">

<p>Return non-nil if the RESOURCE should be zoomed by `*zoom-factor*'.
</p></div>
</div>

</div>

<div id="outline-container-30-127" class="outline-3">
<h3 id="sec-30-127">LEFT-HAND-SIDE (function) </h3>
<div class="outline-text-3" id="text-30-127">


</div>

<div id="outline-container-30-127-1" class="outline-4">
<h4 id="sec-30-127-1">Arguments </h4>
<div class="outline-text-4" id="text-30-127-1">

<p>(RULE)
</p></div>
</div>

</div>

<div id="outline-container-30-128" class="outline-3">
<h3 id="sec-30-128">LOAD-FONT-RESOURCE (function) </h3>
<div class="outline-text-3" id="text-30-128">


</div>

<div id="outline-container-30-128-1" class="outline-4">
<h4 id="sec-30-128-1">Arguments </h4>
<div class="outline-text-4" id="text-30-128-1">

<p>(RESOURCE)
</p></div>
</div>

</div>

<div id="outline-container-30-129" class="outline-3">
<h3 id="sec-30-129">LOAD-IMAGE-RESOURCE (function) </h3>
<div class="outline-text-3" id="text-30-129">


</div>

<div id="outline-container-30-129-1" class="outline-4">
<h4 id="sec-30-129-1">Arguments </h4>
<div class="outline-text-4" id="text-30-129-1">

<p>(RESOURCE)
</p></div>

</div>

<div id="outline-container-30-129-2" class="outline-4">
<h4 id="sec-30-129-2">Documentation </h4>
<div class="outline-text-4" id="text-30-129-2">

<p>Loads an :IMAGE-type pak resource from a :FILE on disk.
</p></div>
</div>

</div>

<div id="outline-container-30-130" class="outline-3">
<h3 id="sec-30-130">LOAD-LISP-RESOURCE (function) </h3>
<div class="outline-text-3" id="text-30-130">


</div>

<div id="outline-container-30-130-1" class="outline-4">
<h4 id="sec-30-130-1">Arguments </h4>
<div class="outline-text-4" id="text-30-130-1">

<p>(RESOURCE)
</p></div>
</div>

</div>

<div id="outline-container-30-131" class="outline-3">
<h3 id="sec-30-131">LOAD-MODULE (function) </h3>
<div class="outline-text-3" id="text-30-131">


</div>
