notebook/xe2-reference.org
*** Documentation
Load the module named MODULE. Load any resources marked with a
non-nil :autoload property. This operation also sets the default
object save directory (by setting the current `*module*'. See also
`save-object-resource').
** LOAD-RESOURCE (function)
*** Arguments
(RESOURCE)
*** Documentation
Load the driver-dependent object of RESOURCE into the OBJECT field
so that it can be fed to the console.
** LOAD-USER-INIT-FILE (function)
** MAKE-EVENT (function)
*** Arguments
(SDL-KEY SDL-MODS)
*** Documentation
Create a normalized event out of the SDL data SDL-KEY and SDL-MODS.
The purpose of putting events in a normal form is to enable their use
as hash keys.
** MAKE-FIELD-INITIALIZER (function)
*** Arguments
(DESCRIPTOR)
*** Documentation
Create a setf statement that initializes a field.
The initform is taken from DESCRIPTOR. If there is no initform
specified, no setf statement is generated, because in this case the
slot value is inherited.
** MAKE-FIELD-INITIALIZER-BODY (variable)
** MAKE-FORMATTED-STRING (variable)
** MAKE-KEY-MODIFIER-SYMBOL (function)
*** Arguments
(SDL-MOD)
*** Documentation
Translate from the SDL key modifier symbol SDL-MOD to our own
key event symbols.
** MAKE-KEY-STRING (function)
*** Arguments
(SDL-KEY)
*** Documentation
Translate from :SDL-KEY-X to the string "X".
** MAKE-KEYWORD (function)
*** Arguments
(S)
*** Documentation
Make the symbol or string S into a keyword symbol.
** MAKE-OBJECT (variable)
** MAKE-OBJECT-RESOURCE (function)
*** Arguments
(NAME OBJECT)
*** Documentation
Make an object resource named NAME (a string) with the CLON object
OBJECT as the data.
** MAKE-QUEUE (function)
*** Arguments
(&KEY ((HEAD DUM470) NIL) ((TAIL DUM471) NIL) ((COUNT DUM472) NIL)
 ((MAX DUM473) NIL))
** MAKE-RESOURCE (function)
*** Arguments
(&KEY ((NAME DUM430) NIL) ((TYPE DUM431) NIL) ((PROPERTIES DUM432) NIL)
 ((FILE DUM433) NIL) ((DATA DUM434) NIL) ((OBJECT DUM435) NIL))
** MAKE-SPECIAL-VARIABLE-NAME (function)
*** Arguments
(S)
*** Documentation
Make the symbol S into a special variable name. This is used to
make the names of the objects made with `define-prototype'.
** MAKE-STAT (function)
*** Arguments
(&KEY BASE MIN MAX DELTA UNIT)
*** Documentation
Create a stat. Use this as an initialization form in cell declarations.
You must provide at least a :base value.
** MESSAGE (function)
*** Arguments
(FORMAT-STRING &REST ARGS)
*** Documentation
Print a log message to the standard output. The FORMAT-STRING and
remaining arguments are passed to `format'.

When the variable `*message-logging*' is nil, this output is
disabled.
** MESSAGE-SYMBOL (function)
*** Arguments
(STRING DELIMITER)
** MIDPOINT (function)
*** Arguments
(A B)
** NO-SUCH-FIELD (variable)
** NORMALIZE-EVENT (function)
*** Arguments
(EVENT)
*** Documentation
Convert EVENT to a normal form suitable for `equal' comparisons.
** NULL-PARENT (variable)
** OBJECT (function)
*** Arguments
(CONDITION)
** OBJECT-ADDRESS-STRING (function)
*** Arguments
(OB)
** OBJECT-FIELDS (function)
*** Arguments
(INSTANCE)
** OBJECT-NAME (function)
*** Arguments
(INSTANCE)
** OBJECT-PARENT (function)
*** Arguments
(INSTANCE)
** ONE-OF (function)
*** Arguments
(SET)
** OPERATION-SYMBOL (function)
*** Arguments
(STRING DELIMITER)
** OPPOSITE-DIRECTION (function)
*** Arguments
(DIRECTION)
