notebook/xe2-reference.html

<div id="outline-container-30-131-1" class="outline-4">
<h4 id="sec-30-131-1">Arguments </h4>
<div class="outline-text-4" id="text-30-131-1">

<p>(MODULE)
</p></div>

</div>

<div id="outline-container-30-131-2" class="outline-4">
<h4 id="sec-30-131-2">Documentation </h4>
<div class="outline-text-4" id="text-30-131-2">

<p>Load the module named MODULE. Load any resources marked with a
non-nil :autoload property. This operation also sets the default
object save directory (by setting the current `*module*'. See also
`save-object-resource').
</p></div>
</div>

</div>

<div id="outline-container-30-132" class="outline-3">
<h3 id="sec-30-132">LOAD-RESOURCE (function) </h3>
<div class="outline-text-3" id="text-30-132">


</div>

<div id="outline-container-30-132-1" class="outline-4">
<h4 id="sec-30-132-1">Arguments </h4>
<div class="outline-text-4" id="text-30-132-1">

<p>(RESOURCE)
</p></div>

</div>

<div id="outline-container-30-132-2" class="outline-4">
<h4 id="sec-30-132-2">Documentation </h4>
<div class="outline-text-4" id="text-30-132-2">

<p>Load the driver-dependent object of RESOURCE into the OBJECT field
so that it can be fed to the console.
</p></div>
</div>

</div>

<div id="outline-container-30-133" class="outline-3">
<h3 id="sec-30-133">LOAD-USER-INIT-FILE (function) </h3>
<div class="outline-text-3" id="text-30-133">

</div>

</div>

<div id="outline-container-30-134" class="outline-3">
<h3 id="sec-30-134">MAKE-EVENT (function) </h3>
<div class="outline-text-3" id="text-30-134">


</div>

<div id="outline-container-30-134-1" class="outline-4">
<h4 id="sec-30-134-1">Arguments </h4>
<div class="outline-text-4" id="text-30-134-1">

<p>(SDL-KEY SDL-MODS)
</p></div>

</div>

<div id="outline-container-30-134-2" class="outline-4">
<h4 id="sec-30-134-2">Documentation </h4>
<div class="outline-text-4" id="text-30-134-2">

<p>Create a normalized event out of the SDL data SDL-KEY and SDL-MODS.
The purpose of putting events in a normal form is to enable their use
as hash keys.
</p></div>
</div>

</div>

<div id="outline-container-30-135" class="outline-3">
<h3 id="sec-30-135">MAKE-FIELD-INITIALIZER (function) </h3>
<div class="outline-text-3" id="text-30-135">


</div>

<div id="outline-container-30-135-1" class="outline-4">
<h4 id="sec-30-135-1">Arguments </h4>
<div class="outline-text-4" id="text-30-135-1">

<p>(DESCRIPTOR)
</p></div>

</div>

<div id="outline-container-30-135-2" class="outline-4">
<h4 id="sec-30-135-2">Documentation </h4>
<div class="outline-text-4" id="text-30-135-2">

<p>Create a setf statement that initializes a field.
The initform is taken from DESCRIPTOR. If there is no initform
specified, no setf statement is generated, because in this case the
slot value is inherited.
</p></div>
</div>

</div>

<div id="outline-container-30-136" class="outline-3">
<h3 id="sec-30-136">MAKE-FIELD-INITIALIZER-BODY (variable) </h3>
<div class="outline-text-3" id="text-30-136">

</div>

</div>

<div id="outline-container-30-137" class="outline-3">
<h3 id="sec-30-137">MAKE-FORMATTED-STRING (variable) </h3>
<div class="outline-text-3" id="text-30-137">

</div>

</div>

<div id="outline-container-30-138" class="outline-3">
<h3 id="sec-30-138">MAKE-KEY-MODIFIER-SYMBOL (function) </h3>
<div class="outline-text-3" id="text-30-138">


</div>

<div id="outline-container-30-138-1" class="outline-4">
<h4 id="sec-30-138-1">Arguments </h4>
<div class="outline-text-4" id="text-30-138-1">

<p>(SDL-MOD)
</p></div>

</div>

<div id="outline-container-30-138-2" class="outline-4">
<h4 id="sec-30-138-2">Documentation </h4>
<div class="outline-text-4" id="text-30-138-2">

<p>Translate from the SDL key modifier symbol SDL-MOD to our own
key event symbols.
</p></div>
</div>

</div>

<div id="outline-container-30-139" class="outline-3">
<h3 id="sec-30-139">MAKE-KEY-STRING (function) </h3>
<div class="outline-text-3" id="text-30-139">


</div>

<div id="outline-container-30-139-1" class="outline-4">
<h4 id="sec-30-139-1">Arguments </h4>
<div class="outline-text-4" id="text-30-139-1">

<p>(SDL-KEY)
</p></div>

</div>

<div id="outline-container-30-139-2" class="outline-4">
<h4 id="sec-30-139-2">Documentation </h4>
<div class="outline-text-4" id="text-30-139-2">

<p>Translate from :SDL-KEY-X to the string "X".
</p></div>
</div>

</div>

<div id="outline-container-30-140" class="outline-3">
<h3 id="sec-30-140">MAKE-KEYWORD (function) </h3>
<div class="outline-text-3" id="text-30-140">


</div>

<div id="outline-container-30-140-1" class="outline-4">
<h4 id="sec-30-140-1">Arguments </h4>
<div class="outline-text-4" id="text-30-140-1">

<p>(S)
</p></div>

</div>

<div id="outline-container-30-140-2" class="outline-4">
<h4 id="sec-30-140-2">Documentation </h4>
<div class="outline-text-4" id="text-30-140-2">

<p>Make the symbol or string S into a keyword symbol.
</p></div>
</div>

</div>

<div id="outline-container-30-141" class="outline-3">
<h3 id="sec-30-141">MAKE-OBJECT (variable) </h3>
<div class="outline-text-3" id="text-30-141">

</div>

</div>

<div id="outline-container-30-142" class="outline-3">
<h3 id="sec-30-142">MAKE-OBJECT-RESOURCE (function) </h3>
<div class="outline-text-3" id="text-30-142">


</div>

<div id="outline-container-30-142-1" class="outline-4">
<h4 id="sec-30-142-1">Arguments </h4>
<div class="outline-text-4" id="text-30-142-1">

<p>(NAME OBJECT)
</p></div>

</div>

<div id="outline-container-30-142-2" class="outline-4">
<h4 id="sec-30-142-2">Documentation </h4>
<div class="outline-text-4" id="text-30-142-2">

<p>Make an object resource named NAME (a string) with the CLON object
OBJECT as the data.
</p></div>
</div>

</div>

<div id="outline-container-30-143" class="outline-3">
<h3 id="sec-30-143">MAKE-QUEUE (function) </h3>
<div class="outline-text-3" id="text-30-143">


</div>

<div id="outline-container-30-143-1" class="outline-4">
<h4 id="sec-30-143-1">Arguments </h4>
<div class="outline-text-4" id="text-30-143-1">

<p>(&amp;KEY ((HEAD DUM470) NIL) ((TAIL DUM471) NIL) ((COUNT DUM472) NIL)
 ((MAX DUM473) NIL))
</p></div>
</div>

</div>

<div id="outline-container-30-144" class="outline-3">
<h3 id="sec-30-144">MAKE-RESOURCE (function) </h3>
<div class="outline-text-3" id="text-30-144">


</div>

<div id="outline-container-30-144-1" class="outline-4">
<h4 id="sec-30-144-1">Arguments </h4>
<div class="outline-text-4" id="text-30-144-1">

<p>(&amp;KEY ((NAME DUM430) NIL) ((TYPE DUM431) NIL) ((PROPERTIES DUM432) NIL)
 ((FILE DUM433) NIL) ((DATA DUM434) NIL) ((OBJECT DUM435) NIL))
</p></div>
</div>

</div>

<div id="outline-container-30-145" class="outline-3">
<h3 id="sec-30-145">MAKE-SPECIAL-VARIABLE-NAME (function) </h3>
<div class="outline-text-3" id="text-30-145">


</div>

<div id="outline-container-30-145-1" class="outline-4">
<h4 id="sec-30-145-1">Arguments </h4>
<div class="outline-text-4" id="text-30-145-1">

<p>(S)
</p></div>

</div>

<div id="outline-container-30-145-2" class="outline-4">
<h4 id="sec-30-145-2">Documentation </h4>
<div class="outline-text-4" id="text-30-145-2">

<p>Make the symbol S into a special variable name. This is used to
make the names of the objects made with `define-prototype'.
</p></div>
</div>

</div>

<div id="outline-container-30-146" class="outline-3">
<h3 id="sec-30-146">MAKE-STAT (function) </h3>
<div class="outline-text-3" id="text-30-146">


</div>

<div id="outline-container-30-146-1" class="outline-4">
<h4 id="sec-30-146-1">Arguments </h4>
<div class="outline-text-4" id="text-30-146-1">

<p>(&amp;KEY BASE MIN MAX DELTA UNIT)
</p></div>

</div>

<div id="outline-container-30-146-2" class="outline-4">
<h4 id="sec-30-146-2">Documentation </h4>
<div class="outline-text-4" id="text-30-146-2">

<p>Create a stat. Use this as an initialization form in cell declarations.
You must provide at least a :base value.
</p></div>
</div>

</div>

<div id="outline-container-30-147" class="outline-3">
<h3 id="sec-30-147">MESSAGE (function) </h3>
<div class="outline-text-3" id="text-30-147">


</div>

<div id="outline-container-30-147-1" class="outline-4">
<h4 id="sec-30-147-1">Arguments </h4>
<div class="outline-text-4" id="text-30-147-1">

<p>(FORMAT-STRING &amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-147-2" class="outline-4">
<h4 id="sec-30-147-2">Documentation </h4>
<div class="outline-text-4" id="text-30-147-2">

<p>Print a log message to the standard output. The FORMAT-STRING and
remaining arguments are passed to `format'.
</p>
<p>
When the variable `*message-logging*' is nil, this output is
disabled.
</p></div>
</div>

</div>

<div id="outline-container-30-148" class="outline-3">
<h3 id="sec-30-148">MESSAGE-SYMBOL (function) </h3>
<div class="outline-text-3" id="text-30-148">


</div>

<div id="outline-container-30-148-1" class="outline-4">
<h4 id="sec-30-148-1">Arguments </h4>
<div class="outline-text-4" id="text-30-148-1">

<p>(STRING DELIMITER)
</p></div>
</div>

</div>

<div id="outline-container-30-149" class="outline-3">
<h3 id="sec-30-149">MIDPOINT (function) </h3>
<div class="outline-text-3" id="text-30-149">


</div>

<div id="outline-container-30-149-1" class="outline-4">
<h4 id="sec-30-149-1">Arguments </h4>
<div class="outline-text-4" id="text-30-149-1">

<p>(A B)
</p></div>
</div>

</div>

<div id="outline-container-30-150" class="outline-3">
<h3 id="sec-30-150">NO-SUCH-FIELD (variable) </h3>
<div class="outline-text-3" id="text-30-150">

</div>

</div>

<div id="outline-container-30-151" class="outline-3">
<h3 id="sec-30-151">NORMALIZE-EVENT (function) </h3>
<div class="outline-text-3" id="text-30-151">


</div>

<div id="outline-container-30-151-1" class="outline-4">
<h4 id="sec-30-151-1">Arguments </h4>
<div class="outline-text-4" id="text-30-151-1">

<p>(EVENT)
</p></div>

</div>

<div id="outline-container-30-151-2" class="outline-4">
<h4 id="sec-30-151-2">Documentation </h4>
<div class="outline-text-4" id="text-30-151-2">

<p>Convert EVENT to a normal form suitable for `equal' comparisons.
</p></div>
</div>

</div>

<div id="outline-container-30-152" class="outline-3">
<h3 id="sec-30-152">NULL-PARENT (variable) </h3>
<div class="outline-text-3" id="text-30-152">

</div>

</div>

<div id="outline-container-30-153" class="outline-3">
<h3 id="sec-30-153">OBJECT (function) </h3>
<div class="outline-text-3" id="text-30-153">


</div>

<div id="outline-container-30-153-1" class="outline-4">
<h4 id="sec-30-153-1">Arguments </h4>
<div class="outline-text-4" id="text-30-153-1">

<p>(CONDITION)
</p></div>
</div>

</div>

<div id="outline-container-30-154" class="outline-3">
<h3 id="sec-30-154">OBJECT-ADDRESS-STRING (function) </h3>
<div class="outline-text-3" id="text-30-154">


</div>

<div id="outline-container-30-154-1" class="outline-4">
<h4 id="sec-30-154-1">Arguments </h4>
<div class="outline-text-4" id="text-30-154-1">

<p>(OB)
</p></div>
</div>

</div>

<div id="outline-container-30-155" class="outline-3">
<h3 id="sec-30-155">OBJECT-FIELDS (function) </h3>
<div class="outline-text-3" id="text-30-155">


</div>

<div id="outline-container-30-155-1" class="outline-4">
<h4 id="sec-30-155-1">Arguments </h4>
<div class="outline-text-4" id="text-30-155-1">

<p>(INSTANCE)
</p></div>
</div>

</div>

<div id="outline-container-30-156" class="outline-3">
<h3 id="sec-30-156">OBJECT-NAME (function) </h3>
<div class="outline-text-3" id="text-30-156">


</div>

<div id="outline-container-30-156-1" class="outline-4">
<h4 id="sec-30-156-1">Arguments </h4>
<div class="outline-text-4" id="text-30-156-1">

<p>(INSTANCE)
</p></div>
</div>

</div>

<div id="outline-container-30-157" class="outline-3">
<h3 id="sec-30-157">OBJECT-PARENT (function) </h3>
<div class="outline-text-3" id="text-30-157">


</div>

<div id="outline-container-30-157-1" class="outline-4">
<h4 id="sec-30-157-1">Arguments </h4>
<div class="outline-text-4" id="text-30-157-1">

<p>(INSTANCE)
</p></div>
</div>

</div>

<div id="outline-container-30-158" class="outline-3">
<h3 id="sec-30-158">ONE-OF (function) </h3>
<div class="outline-text-3" id="text-30-158">


</div>

<div id="outline-container-30-158-1" class="outline-4">
<h4 id="sec-30-158-1">Arguments </h4>
<div class="outline-text-4" id="text-30-158-1">

<p>(SET)
</p></div>
</div>

</div>

<div id="outline-container-30-159" class="outline-3">
<h3 id="sec-30-159">OPERATION-SYMBOL (function) </h3>
<div class="outline-text-3" id="text-30-159">


</div>
