notebook/xe2-reference.org
*** Documentation
Return the direction keyword that is the opposite direction from
DIRECTION.
** OVERLAY (variable)
** PERCENT-OF-TIME (macro)
*** Arguments
(&REST ARGS)
** PLASMA-RECT (variable)
** PLAY (function)
*** Arguments
(&OPTIONAL (MODULE-NAME standard))
*** Documentation
This is the main entry point to XE2. MODULE-NAME is loaded 
and its .startup resource is loaded.
** PLAY-MUSIC (function)
*** Arguments
(MUSIC-NAME &REST ARGS)
*** Documentation
Begin playing the music resource MUSIC-NAME. If the resource
MUSIC-NAME has the property :volume, its value is used as the volume
of the music.
** PLAY-SAMPLE (function)
*** Arguments
(SAMPLE-NAME &REST ARGS)
*** Documentation
When sound is enabled, play the sample resource SAMPLE-NAME.
** POLL-JOYSTICK-AXIS (function)
*** Arguments
(AXIS)
** QUEUE (function)
*** Arguments
(ITEM Q)
** QUEUE-COUNT (variable)
** QUEUE-HEAD (variable)
** QUEUE-MAX (variable)
** QUEUE-MESSAGE (function)
*** Arguments
(SENDER METHOD-KEY RECEIVER ARGS)
*** Documentation
Enter a message into the current `*message-queue*'.
** QUEUE-TAIL (variable)
** QUEUED-MESSAGES-P (function)
*** Documentation
Return non-nil if there are queued messages.
** QUIT (function)
*** Arguments
(&OPTIONAL SHUTDOWN)
** RANDOM-DIRECTION (function)
** READ-PAK (function)
*** Arguments
(FILENAME)
*** Documentation
Return a list of resources from the PAK file FILENAME.
** READ-SEXP-FROM-FILE (function)
*** Arguments
(FILENAME)
** RENDER-FORMATTED-LINE (function)
*** Arguments
(LINE X Y &KEY DESTINATION (FONT *DEFAULT-FONT*))
*** Documentation
Render the formatted LINE at position X,Y on the image DESTINATION.
Return the height of the rendered line.
** RENDER-FORMATTED-PARAGRAPH (variable)
** RENDER-FORMATTED-STRING (function)
*** Arguments
(FORMATTED-STRING X Y &KEY (TEXT-OFFSET 0) DESTINATION)
*** Documentation
Render the FORMATTED-STRING to position X,Y on the image DESTINATION.
If TEXT-OFFSET is provided, add that many pixels to the Y coordinate
for rendered text in the line. (This is used to make text align with
inline images that are larger than the text height---see also
`render-formatted-line').
** RENDER-PLASMA (function)
*** Arguments
(HEIGHT WIDTH &KEY (GRAININESS 1.0) ARRAY)
** RESET (function)
*** Arguments
(&OPTIONAL (MODULE-NAME standard))
** RESET-JOYSTICK (function)
*** Documentation
Re-open the joystick device and re-initialize the state.
** RESOURCE (variable)
** RESOURCE-TO-PLIST (function)
*** Arguments
(RES)
*** Documentation
Convert the resource record RES into a property list.

This prepares it for printing as part of a PAK file.
** RIGHT-HAND-SIDE (function)
*** Arguments
(RULE)
** ROLL (function)
*** Arguments
(ROLLS &OPTIONAL (SIDES 6) (ADDS 0))
*** Documentation
Total ROLLS rolls of a SIDES-sided die, then add ADDS.
So 2d6+2 would be (roll 2 6 2).
** ROLL-UNDER (function)
*** Arguments
(N SIDES)
** RUN-HOOK (function)
*** Arguments
(HOOK)
*** Documentation
Call all the functions in HOOK, in list order.
** SAVE-OBJECT-RESOURCE (function)
