notebook/xe2-reference.html

<div id="outline-container-30-159-1" class="outline-4">
<h4 id="sec-30-159-1">Arguments </h4>
<div class="outline-text-4" id="text-30-159-1">

<p>(STRING DELIMITER)
</p></div>
</div>

</div>

<div id="outline-container-30-160" class="outline-3">
<h3 id="sec-30-160">OPPOSITE-DIRECTION (function) </h3>
<div class="outline-text-3" id="text-30-160">


</div>

<div id="outline-container-30-160-1" class="outline-4">
<h4 id="sec-30-160-1">Arguments </h4>
<div class="outline-text-4" id="text-30-160-1">

<p>(DIRECTION)
</p></div>

</div>

<div id="outline-container-30-160-2" class="outline-4">
<h4 id="sec-30-160-2">Documentation </h4>
<div class="outline-text-4" id="text-30-160-2">

<p>Return the direction keyword that is the opposite direction from
DIRECTION.
</p></div>
</div>

</div>

<div id="outline-container-30-161" class="outline-3">
<h3 id="sec-30-161">OVERLAY (variable) </h3>
<div class="outline-text-3" id="text-30-161">

</div>

</div>

<div id="outline-container-30-162" class="outline-3">
<h3 id="sec-30-162">PERCENT-OF-TIME (macro) </h3>
<div class="outline-text-3" id="text-30-162">


</div>

<div id="outline-container-30-162-1" class="outline-4">
<h4 id="sec-30-162-1">Arguments </h4>
<div class="outline-text-4" id="text-30-162-1">

<p>(&amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-30-163" class="outline-3">
<h3 id="sec-30-163">PLASMA-RECT (variable) </h3>
<div class="outline-text-3" id="text-30-163">

</div>

</div>

<div id="outline-container-30-164" class="outline-3">
<h3 id="sec-30-164">PLAY (function) </h3>
<div class="outline-text-3" id="text-30-164">


</div>

<div id="outline-container-30-164-1" class="outline-4">
<h4 id="sec-30-164-1">Arguments </h4>
<div class="outline-text-4" id="text-30-164-1">

<p>(&amp;OPTIONAL (MODULE-NAME standard))
</p></div>

</div>

<div id="outline-container-30-164-2" class="outline-4">
<h4 id="sec-30-164-2">Documentation </h4>
<div class="outline-text-4" id="text-30-164-2">

<p>This is the main entry point to XE2. MODULE-NAME is loaded 
and its .startup resource is loaded.
</p></div>
</div>

</div>

<div id="outline-container-30-165" class="outline-3">
<h3 id="sec-30-165">PLAY-MUSIC (function) </h3>
<div class="outline-text-3" id="text-30-165">


</div>

<div id="outline-container-30-165-1" class="outline-4">
<h4 id="sec-30-165-1">Arguments </h4>
<div class="outline-text-4" id="text-30-165-1">

<p>(MUSIC-NAME &amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-165-2" class="outline-4">
<h4 id="sec-30-165-2">Documentation </h4>
<div class="outline-text-4" id="text-30-165-2">

<p>Begin playing the music resource MUSIC-NAME. If the resource
MUSIC-NAME has the property :volume, its value is used as the volume
of the music.
</p></div>
</div>

</div>

<div id="outline-container-30-166" class="outline-3">
<h3 id="sec-30-166">PLAY-SAMPLE (function) </h3>
<div class="outline-text-3" id="text-30-166">


</div>

<div id="outline-container-30-166-1" class="outline-4">
<h4 id="sec-30-166-1">Arguments </h4>
<div class="outline-text-4" id="text-30-166-1">

<p>(SAMPLE-NAME &amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-166-2" class="outline-4">
<h4 id="sec-30-166-2">Documentation </h4>
<div class="outline-text-4" id="text-30-166-2">

<p>When sound is enabled, play the sample resource SAMPLE-NAME.
</p></div>
</div>

</div>

<div id="outline-container-30-167" class="outline-3">
<h3 id="sec-30-167">POLL-JOYSTICK-AXIS (function) </h3>
<div class="outline-text-3" id="text-30-167">


</div>

<div id="outline-container-30-167-1" class="outline-4">
<h4 id="sec-30-167-1">Arguments </h4>
<div class="outline-text-4" id="text-30-167-1">

<p>(AXIS)
</p></div>
</div>

</div>

<div id="outline-container-30-168" class="outline-3">
<h3 id="sec-30-168">QUEUE (function) </h3>
<div class="outline-text-3" id="text-30-168">


</div>

<div id="outline-container-30-168-1" class="outline-4">
<h4 id="sec-30-168-1">Arguments </h4>
<div class="outline-text-4" id="text-30-168-1">

<p>(ITEM Q)
</p></div>
</div>

</div>

<div id="outline-container-30-169" class="outline-3">
<h3 id="sec-30-169">QUEUE-COUNT (variable) </h3>
<div class="outline-text-3" id="text-30-169">

</div>

</div>

<div id="outline-container-30-170" class="outline-3">
<h3 id="sec-30-170">QUEUE-HEAD (variable) </h3>
<div class="outline-text-3" id="text-30-170">

</div>

</div>

<div id="outline-container-30-171" class="outline-3">
<h3 id="sec-30-171">QUEUE-MAX (variable) </h3>
<div class="outline-text-3" id="text-30-171">

</div>

</div>

<div id="outline-container-30-172" class="outline-3">
<h3 id="sec-30-172">QUEUE-MESSAGE (function) </h3>
<div class="outline-text-3" id="text-30-172">


</div>

<div id="outline-container-30-172-1" class="outline-4">
<h4 id="sec-30-172-1">Arguments </h4>
<div class="outline-text-4" id="text-30-172-1">

<p>(SENDER METHOD-KEY RECEIVER ARGS)
</p></div>

</div>

<div id="outline-container-30-172-2" class="outline-4">
<h4 id="sec-30-172-2">Documentation </h4>
<div class="outline-text-4" id="text-30-172-2">

<p>Enter a message into the current `*message-queue*'.
</p></div>
</div>

</div>

<div id="outline-container-30-173" class="outline-3">
<h3 id="sec-30-173">QUEUE-TAIL (variable) </h3>
<div class="outline-text-3" id="text-30-173">

</div>

</div>

<div id="outline-container-30-174" class="outline-3">
<h3 id="sec-30-174">QUEUED-MESSAGES-P (function) </h3>
<div class="outline-text-3" id="text-30-174">


</div>

<div id="outline-container-30-174-1" class="outline-4">
<h4 id="sec-30-174-1">Documentation </h4>
<div class="outline-text-4" id="text-30-174-1">

<p>Return non-nil if there are queued messages.
</p></div>
</div>

</div>

<div id="outline-container-30-175" class="outline-3">
<h3 id="sec-30-175">QUIT (function) </h3>
<div class="outline-text-3" id="text-30-175">


</div>

<div id="outline-container-30-175-1" class="outline-4">
<h4 id="sec-30-175-1">Arguments </h4>
<div class="outline-text-4" id="text-30-175-1">

<p>(&amp;OPTIONAL SHUTDOWN)
</p></div>
</div>

</div>

<div id="outline-container-30-176" class="outline-3">
<h3 id="sec-30-176">RANDOM-DIRECTION (function) </h3>
<div class="outline-text-3" id="text-30-176">

</div>

</div>

<div id="outline-container-30-177" class="outline-3">
<h3 id="sec-30-177">READ-PAK (function) </h3>
<div class="outline-text-3" id="text-30-177">


</div>

<div id="outline-container-30-177-1" class="outline-4">
<h4 id="sec-30-177-1">Arguments </h4>
<div class="outline-text-4" id="text-30-177-1">

<p>(FILENAME)
</p></div>

</div>

<div id="outline-container-30-177-2" class="outline-4">
<h4 id="sec-30-177-2">Documentation </h4>
<div class="outline-text-4" id="text-30-177-2">

<p>Return a list of resources from the PAK file FILENAME.
</p></div>
</div>

</div>

<div id="outline-container-30-178" class="outline-3">
<h3 id="sec-30-178">READ-SEXP-FROM-FILE (function) </h3>
<div class="outline-text-3" id="text-30-178">


</div>

<div id="outline-container-30-178-1" class="outline-4">
<h4 id="sec-30-178-1">Arguments </h4>
<div class="outline-text-4" id="text-30-178-1">

<p>(FILENAME)
</p></div>
</div>

</div>

<div id="outline-container-30-179" class="outline-3">
<h3 id="sec-30-179">RENDER-FORMATTED-LINE (function) </h3>
<div class="outline-text-3" id="text-30-179">


</div>

<div id="outline-container-30-179-1" class="outline-4">
<h4 id="sec-30-179-1">Arguments </h4>
<div class="outline-text-4" id="text-30-179-1">

<p>(LINE X Y &amp;KEY DESTINATION (FONT *DEFAULT-FONT*))
</p></div>

</div>

<div id="outline-container-30-179-2" class="outline-4">
<h4 id="sec-30-179-2">Documentation </h4>
<div class="outline-text-4" id="text-30-179-2">

<p>Render the formatted LINE at position X,Y on the image DESTINATION.
Return the height of the rendered line.
</p></div>
</div>

</div>

<div id="outline-container-30-180" class="outline-3">
<h3 id="sec-30-180">RENDER-FORMATTED-PARAGRAPH (variable) </h3>
<div class="outline-text-3" id="text-30-180">

</div>

</div>

<div id="outline-container-30-181" class="outline-3">
<h3 id="sec-30-181">RENDER-FORMATTED-STRING (function) </h3>
<div class="outline-text-3" id="text-30-181">


</div>

<div id="outline-container-30-181-1" class="outline-4">
<h4 id="sec-30-181-1">Arguments </h4>
<div class="outline-text-4" id="text-30-181-1">

<p>(FORMATTED-STRING X Y &amp;KEY (TEXT-OFFSET 0) DESTINATION)
</p></div>

</div>

<div id="outline-container-30-181-2" class="outline-4">
<h4 id="sec-30-181-2">Documentation </h4>
<div class="outline-text-4" id="text-30-181-2">

<p>Render the FORMATTED-STRING to position X,Y on the image DESTINATION.
If TEXT-OFFSET is provided, add that many pixels to the Y coordinate
for rendered text in the line. (This is used to make text align with
inline images that are larger than the text height&mdash;see also
`render-formatted-line').
</p></div>
</div>

</div>

<div id="outline-container-30-182" class="outline-3">
<h3 id="sec-30-182">RENDER-PLASMA (function) </h3>
<div class="outline-text-3" id="text-30-182">


</div>

<div id="outline-container-30-182-1" class="outline-4">
<h4 id="sec-30-182-1">Arguments </h4>
<div class="outline-text-4" id="text-30-182-1">

<p>(HEIGHT WIDTH &amp;KEY (GRAININESS 1.0) ARRAY)
</p></div>
</div>

</div>

<div id="outline-container-30-183" class="outline-3">
<h3 id="sec-30-183">RESET (function) </h3>
<div class="outline-text-3" id="text-30-183">


</div>

<div id="outline-container-30-183-1" class="outline-4">
<h4 id="sec-30-183-1">Arguments </h4>
<div class="outline-text-4" id="text-30-183-1">

<p>(&amp;OPTIONAL (MODULE-NAME standard))
</p></div>
</div>

</div>

<div id="outline-container-30-184" class="outline-3">
<h3 id="sec-30-184">RESET-JOYSTICK (function) </h3>
<div class="outline-text-3" id="text-30-184">


</div>

<div id="outline-container-30-184-1" class="outline-4">
<h4 id="sec-30-184-1">Documentation </h4>
<div class="outline-text-4" id="text-30-184-1">

<p>Re-open the joystick device and re-initialize the state.
</p></div>
</div>

</div>

<div id="outline-container-30-185" class="outline-3">
<h3 id="sec-30-185">RESOURCE (variable) </h3>
<div class="outline-text-3" id="text-30-185">

</div>

</div>

<div id="outline-container-30-186" class="outline-3">
<h3 id="sec-30-186">RESOURCE-TO-PLIST (function) </h3>
<div class="outline-text-3" id="text-30-186">


</div>

<div id="outline-container-30-186-1" class="outline-4">
<h4 id="sec-30-186-1">Arguments </h4>
<div class="outline-text-4" id="text-30-186-1">

<p>(RES)
</p></div>

</div>

<div id="outline-container-30-186-2" class="outline-4">
<h4 id="sec-30-186-2">Documentation </h4>
<div class="outline-text-4" id="text-30-186-2">

<p>Convert the resource record RES into a property list.
</p>
<p>
This prepares it for printing as part of a PAK file.
</p></div>
</div>

</div>

<div id="outline-container-30-187" class="outline-3">
<h3 id="sec-30-187">RIGHT-HAND-SIDE (function) </h3>
<div class="outline-text-3" id="text-30-187">


</div>

<div id="outline-container-30-187-1" class="outline-4">
<h4 id="sec-30-187-1">Arguments </h4>
<div class="outline-text-4" id="text-30-187-1">

<p>(RULE)
</p></div>
</div>

</div>

<div id="outline-container-30-188" class="outline-3">
<h3 id="sec-30-188">ROLL (function) </h3>
<div class="outline-text-3" id="text-30-188">


</div>

<div id="outline-container-30-188-1" class="outline-4">
<h4 id="sec-30-188-1">Arguments </h4>
<div class="outline-text-4" id="text-30-188-1">

<p>(ROLLS &amp;OPTIONAL (SIDES 6) (ADDS 0))
</p></div>

</div>

<div id="outline-container-30-188-2" class="outline-4">
<h4 id="sec-30-188-2">Documentation </h4>
<div class="outline-text-4" id="text-30-188-2">

<p>Total ROLLS rolls of a SIDES-sided die, then add ADDS.
So 2d6+2 would be (roll 2 6 2).
</p></div>
</div>

</div>

<div id="outline-container-30-189" class="outline-3">
<h3 id="sec-30-189">ROLL-UNDER (function) </h3>
<div class="outline-text-3" id="text-30-189">


</div>

<div id="outline-container-30-189-1" class="outline-4">
<h4 id="sec-30-189-1">Arguments </h4>
<div class="outline-text-4" id="text-30-189-1">

<p>(N SIDES)
</p></div>
</div>

</div>

<div id="outline-container-30-190" class="outline-3">
<h3 id="sec-30-190">RUN-HOOK (function) </h3>
<div class="outline-text-3" id="text-30-190">


</div>

<div id="outline-container-30-190-1" class="outline-4">
<h4 id="sec-30-190-1">Arguments </h4>
<div class="outline-text-4" id="text-30-190-1">

<p>(HOOK)
</p></div>

</div>

<div id="outline-container-30-190-2" class="outline-4">
<h4 id="sec-30-190-2">Documentation </h4>
<div class="outline-text-4" id="text-30-190-2">

<p>Call all the functions in HOOK, in list order.
</p></div>
</div>

</div>
