notebook/xe2-reference.org
*** Arguments
(RESOURCE &OPTIONAL (MODULE *MODULE*))
*** Documentation
Save an object resource to disk as {RESOURCE-NAME}.PAK.
** SEEK-MUSIC (variable)
** SELF (variable)
** SEND (function)
*** Arguments
(SENDER METHOD OBJECT &REST ARGS)
*** Documentation
Invoke the method identified by the keyword METHOD on the OBJECT with ARGS.
If the method is not found, attempt to forward the message. The SENDER
argument is ignored for now.
** SEND-EVENT-TO-WIDGETS (function)
*** Arguments
(EVENT)
*** Documentation
Keyboard, mouse, joystick, and timer events are represented as
event lists of the form:

:      (STRING . MODIFIERS)

Where MODIFIERS is a list of symbols like :shift, :control, :alt,
 :timer, :system, :mouse, and so on.

The default event handler attempts to deliver a keypress to one of
the widgets in `*active-widgets*'. See widgets.lisp and the docstrings
below for more information.

This function attempts to deliver EVENT to each of the *active-widgets*
one at a time (in list order) until one of them is found to have a
matching keybinding, in which case the keybinding's corresponding
function is triggered. If none of the widgets have a matching
keybinding, nothing happens, and this function returns nil.
** SEND-QUEUE (function)
*** Arguments
(SENDER METHOD-KEY OBJECT &REST ARGS)
*** Documentation
Queue a message. Returns nil.
** SEND-SUPER (variable)
** SET-BROWSER (variable)
** SET-FIELD-OPTION-VALUE (function)
*** Arguments
(FIELD OBJECT OPTION VALUE)
*** Documentation
Set the value of the OPTION for FIELD in OBJECT to VALUE.
** SET-FIELD-OPTIONS (function)
*** Arguments
(FIELD OBJECT OPTIONS)
*** Documentation
Set the options property list to OPTIONS for FIELD in OBJECT.
** SET-FIELD-VALUE (function)
*** Arguments
(FIELD OBJECT VALUE)
*** Documentation
Set OBJECT's FIELD to VALUE.
The new value overrides any inherited value.
** SET-FRAME-RATE (function)
*** Arguments
(RATE)
*** Documentation
Set the frame rate for the game. The recommended default is 30.
You only need to set the frame rate if you are using the timer; see
`enable-timer'.
** SET-MESSAGE-VERBOSITIES (function)
*** Arguments
(PLIST &OPTIONAL (INCLUDE-DEFAULT T))
** SET-MUSIC-VOLUME (function)
*** Arguments
(NUMBER)
*** Documentation
Set the mixer music volume between 0 (silent) and 255 (full volume).
** SET-SCREEN-HEIGHT (function)
*** Arguments
(HEIGHT)
** SET-SCREEN-WIDTH (function)
*** Arguments
(WIDTH)
** SET-TIMER-INTERVAL (function)
*** Arguments
(INTERVAL)
*** Documentation
Set the number of frames to wait before sending each timer event.
Set it to 0 to get a timer event every frame.
** SHOW-WIDGETS (function)
*** Documentation
Draw the active widgets to the screen.
** SPLIT-STRING-ON-LINES (function)
*** Arguments
(STRING)
** STAT-VALUE (variable)
** STEP-IN-DIRECTION (function)
*** Arguments
(ROW COLUMN DIRECTION &OPTIONAL (N 1))
*** Documentation
Return the point ROW, COLUMN moved by n squares in DIRECTION.
** SUBDIVIDE-RECT (function)
*** Arguments
(R)
*** Documentation
Subdivide rectangle R into four rectangles joined at the
center point of the original R, and return the list of four
rectangles, or NIL if they would be smaller than one pixel.
** TRACE-COLUMN (function)
*** Arguments
(TRACE-FUNCTION COLUMN Y0 Y1)
** TRACE-LINE (function)
*** Arguments
(TRACE-FUNCTION X0 Y0 X1 Y1)
*** Documentation
Trace a line between X0,Y0 and X1,Y1.
calling TRACE-FUNCTION at each point of the line.
** TRACE-OCTAGON (function)
*** Arguments
(TRACE-FUNCTION CENTER-ROW CENTER-COLUMN RADIUS &OPTIONAL THICKEN)
