notebook/xe2-reference.html

<div id="outline-container-30-191" class="outline-3">
<h3 id="sec-30-191">SAVE-OBJECT-RESOURCE (function) </h3>
<div class="outline-text-3" id="text-30-191">


</div>

<div id="outline-container-30-191-1" class="outline-4">
<h4 id="sec-30-191-1">Arguments </h4>
<div class="outline-text-4" id="text-30-191-1">

<p>(RESOURCE &amp;OPTIONAL (MODULE *MODULE*))
</p></div>

</div>

<div id="outline-container-30-191-2" class="outline-4">
<h4 id="sec-30-191-2">Documentation </h4>
<div class="outline-text-4" id="text-30-191-2">

<p>Save an object resource to disk as {RESOURCE-NAME}.PAK.
</p></div>
</div>

</div>

<div id="outline-container-30-192" class="outline-3">
<h3 id="sec-30-192">SEEK-MUSIC (variable) </h3>
<div class="outline-text-3" id="text-30-192">

</div>

</div>

<div id="outline-container-30-193" class="outline-3">
<h3 id="sec-30-193">SELF (variable) </h3>
<div class="outline-text-3" id="text-30-193">

</div>

</div>

<div id="outline-container-30-194" class="outline-3">
<h3 id="sec-30-194">SEND (function) </h3>
<div class="outline-text-3" id="text-30-194">


</div>

<div id="outline-container-30-194-1" class="outline-4">
<h4 id="sec-30-194-1">Arguments </h4>
<div class="outline-text-4" id="text-30-194-1">

<p>(SENDER METHOD OBJECT &amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-194-2" class="outline-4">
<h4 id="sec-30-194-2">Documentation </h4>
<div class="outline-text-4" id="text-30-194-2">

<p>Invoke the method identified by the keyword METHOD on the OBJECT with ARGS.
If the method is not found, attempt to forward the message. The SENDER
argument is ignored for now.
</p></div>
</div>

</div>

<div id="outline-container-30-195" class="outline-3">
<h3 id="sec-30-195">SEND-EVENT-TO-WIDGETS (function) </h3>
<div class="outline-text-3" id="text-30-195">


</div>

<div id="outline-container-30-195-1" class="outline-4">
<h4 id="sec-30-195-1">Arguments </h4>
<div class="outline-text-4" id="text-30-195-1">

<p>(EVENT)
</p></div>

</div>

<div id="outline-container-30-195-2" class="outline-4">
<h4 id="sec-30-195-2">Documentation </h4>
<div class="outline-text-4" id="text-30-195-2">

<p>Keyboard, mouse, joystick, and timer events are represented as
event lists of the form:
</p>
<pre class="example">
     (STRING . MODIFIERS)
</pre>


<p>
Where MODIFIERS is a list of symbols like :shift, :control, :alt,
 :timer, :system, :mouse, and so on.
</p>
<p>
The default event handler attempts to deliver a keypress to one of
the widgets in `*active-widgets*'. See widgets.lisp and the docstrings
below for more information.
</p>
<p>
This function attempts to deliver EVENT to each of the *active-widgets*
one at a time (in list order) until one of them is found to have a
matching keybinding, in which case the keybinding's corresponding
function is triggered. If none of the widgets have a matching
keybinding, nothing happens, and this function returns nil.
</p></div>
</div>

</div>

<div id="outline-container-30-196" class="outline-3">
<h3 id="sec-30-196">SEND-QUEUE (function) </h3>
<div class="outline-text-3" id="text-30-196">


</div>

<div id="outline-container-30-196-1" class="outline-4">
<h4 id="sec-30-196-1">Arguments </h4>
<div class="outline-text-4" id="text-30-196-1">

<p>(SENDER METHOD-KEY OBJECT &amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-196-2" class="outline-4">
<h4 id="sec-30-196-2">Documentation </h4>
<div class="outline-text-4" id="text-30-196-2">

<p>Queue a message. Returns nil.
</p></div>
</div>

</div>

<div id="outline-container-30-197" class="outline-3">
<h3 id="sec-30-197">SEND-SUPER (variable) </h3>
<div class="outline-text-3" id="text-30-197">

</div>

</div>

<div id="outline-container-30-198" class="outline-3">
<h3 id="sec-30-198">SET-BROWSER (variable) </h3>
<div class="outline-text-3" id="text-30-198">

</div>

</div>

<div id="outline-container-30-199" class="outline-3">
<h3 id="sec-30-199">SET-FIELD-OPTION-VALUE (function) </h3>
<div class="outline-text-3" id="text-30-199">


</div>

<div id="outline-container-30-199-1" class="outline-4">
<h4 id="sec-30-199-1">Arguments </h4>
<div class="outline-text-4" id="text-30-199-1">

<p>(FIELD OBJECT OPTION VALUE)
</p></div>

</div>

<div id="outline-container-30-199-2" class="outline-4">
<h4 id="sec-30-199-2">Documentation </h4>
<div class="outline-text-4" id="text-30-199-2">

<p>Set the value of the OPTION for FIELD in OBJECT to VALUE.
</p></div>
</div>

</div>

<div id="outline-container-30-200" class="outline-3">
<h3 id="sec-30-200">SET-FIELD-OPTIONS (function) </h3>
<div class="outline-text-3" id="text-30-200">


</div>

<div id="outline-container-30-200-1" class="outline-4">
<h4 id="sec-30-200-1">Arguments </h4>
<div class="outline-text-4" id="text-30-200-1">

<p>(FIELD OBJECT OPTIONS)
</p></div>

</div>

<div id="outline-container-30-200-2" class="outline-4">
<h4 id="sec-30-200-2">Documentation </h4>
<div class="outline-text-4" id="text-30-200-2">

<p>Set the options property list to OPTIONS for FIELD in OBJECT.
</p></div>
</div>

</div>

<div id="outline-container-30-201" class="outline-3">
<h3 id="sec-30-201">SET-FIELD-VALUE (function) </h3>
<div class="outline-text-3" id="text-30-201">


</div>

<div id="outline-container-30-201-1" class="outline-4">
<h4 id="sec-30-201-1">Arguments </h4>
<div class="outline-text-4" id="text-30-201-1">

<p>(FIELD OBJECT VALUE)
</p></div>

</div>

<div id="outline-container-30-201-2" class="outline-4">
<h4 id="sec-30-201-2">Documentation </h4>
<div class="outline-text-4" id="text-30-201-2">

<p>Set OBJECT's FIELD to VALUE.
The new value overrides any inherited value.
</p></div>
</div>

</div>

<div id="outline-container-30-202" class="outline-3">
<h3 id="sec-30-202">SET-FRAME-RATE (function) </h3>
<div class="outline-text-3" id="text-30-202">


</div>

<div id="outline-container-30-202-1" class="outline-4">
<h4 id="sec-30-202-1">Arguments </h4>
<div class="outline-text-4" id="text-30-202-1">

<p>(RATE)
</p></div>

</div>

<div id="outline-container-30-202-2" class="outline-4">
<h4 id="sec-30-202-2">Documentation </h4>
<div class="outline-text-4" id="text-30-202-2">

<p>Set the frame rate for the game. The recommended default is 30.
You only need to set the frame rate if you are using the timer; see
`enable-timer'.
</p></div>
</div>

</div>

<div id="outline-container-30-203" class="outline-3">
<h3 id="sec-30-203">SET-MESSAGE-VERBOSITIES (function) </h3>
<div class="outline-text-3" id="text-30-203">


</div>

<div id="outline-container-30-203-1" class="outline-4">
<h4 id="sec-30-203-1">Arguments </h4>
<div class="outline-text-4" id="text-30-203-1">

<p>(PLIST &amp;OPTIONAL (INCLUDE-DEFAULT T))
</p></div>
</div>

</div>

<div id="outline-container-30-204" class="outline-3">
<h3 id="sec-30-204">SET-MUSIC-VOLUME (function) </h3>
<div class="outline-text-3" id="text-30-204">


</div>

<div id="outline-container-30-204-1" class="outline-4">
<h4 id="sec-30-204-1">Arguments </h4>
<div class="outline-text-4" id="text-30-204-1">

<p>(NUMBER)
</p></div>

</div>

<div id="outline-container-30-204-2" class="outline-4">
<h4 id="sec-30-204-2">Documentation </h4>
<div class="outline-text-4" id="text-30-204-2">

<p>Set the mixer music volume between 0 (silent) and 255 (full volume).
</p></div>
</div>

</div>

<div id="outline-container-30-205" class="outline-3">
<h3 id="sec-30-205">SET-SCREEN-HEIGHT (function) </h3>
<div class="outline-text-3" id="text-30-205">


</div>

<div id="outline-container-30-205-1" class="outline-4">
<h4 id="sec-30-205-1">Arguments </h4>
<div class="outline-text-4" id="text-30-205-1">

<p>(HEIGHT)
</p></div>
</div>

</div>

<div id="outline-container-30-206" class="outline-3">
<h3 id="sec-30-206">SET-SCREEN-WIDTH (function) </h3>
<div class="outline-text-3" id="text-30-206">


</div>

<div id="outline-container-30-206-1" class="outline-4">
<h4 id="sec-30-206-1">Arguments </h4>
<div class="outline-text-4" id="text-30-206-1">

<p>(WIDTH)
</p></div>
</div>

</div>

<div id="outline-container-30-207" class="outline-3">
<h3 id="sec-30-207">SET-TIMER-INTERVAL (function) </h3>
<div class="outline-text-3" id="text-30-207">


</div>

<div id="outline-container-30-207-1" class="outline-4">
<h4 id="sec-30-207-1">Arguments </h4>
<div class="outline-text-4" id="text-30-207-1">

<p>(INTERVAL)
</p></div>

</div>

<div id="outline-container-30-207-2" class="outline-4">
<h4 id="sec-30-207-2">Documentation </h4>
<div class="outline-text-4" id="text-30-207-2">

<p>Set the number of frames to wait before sending each timer event.
Set it to 0 to get a timer event every frame.
</p></div>
</div>

</div>

<div id="outline-container-30-208" class="outline-3">
<h3 id="sec-30-208">SHOW-WIDGETS (function) </h3>
<div class="outline-text-3" id="text-30-208">


</div>

<div id="outline-container-30-208-1" class="outline-4">
<h4 id="sec-30-208-1">Documentation </h4>
<div class="outline-text-4" id="text-30-208-1">

<p>Draw the active widgets to the screen.
</p></div>
</div>

</div>

<div id="outline-container-30-209" class="outline-3">
<h3 id="sec-30-209">SPLIT-STRING-ON-LINES (function) </h3>
<div class="outline-text-3" id="text-30-209">


</div>

<div id="outline-container-30-209-1" class="outline-4">
<h4 id="sec-30-209-1">Arguments </h4>
<div class="outline-text-4" id="text-30-209-1">

<p>(STRING)
</p></div>
</div>

</div>

<div id="outline-container-30-210" class="outline-3">
<h3 id="sec-30-210">STAT-VALUE (variable) </h3>
<div class="outline-text-3" id="text-30-210">

</div>

</div>

<div id="outline-container-30-211" class="outline-3">
<h3 id="sec-30-211">STEP-IN-DIRECTION (function) </h3>
<div class="outline-text-3" id="text-30-211">


</div>

<div id="outline-container-30-211-1" class="outline-4">
<h4 id="sec-30-211-1">Arguments </h4>
<div class="outline-text-4" id="text-30-211-1">

<p>(ROW COLUMN DIRECTION &amp;OPTIONAL (N 1))
</p></div>

</div>

<div id="outline-container-30-211-2" class="outline-4">
<h4 id="sec-30-211-2">Documentation </h4>
<div class="outline-text-4" id="text-30-211-2">

<p>Return the point ROW, COLUMN moved by n squares in DIRECTION.
</p></div>
</div>

</div>

<div id="outline-container-30-212" class="outline-3">
<h3 id="sec-30-212">SUBDIVIDE-RECT (function) </h3>
<div class="outline-text-3" id="text-30-212">


</div>

<div id="outline-container-30-212-1" class="outline-4">
<h4 id="sec-30-212-1">Arguments </h4>
<div class="outline-text-4" id="text-30-212-1">

<p>(R)
</p></div>

</div>

<div id="outline-container-30-212-2" class="outline-4">
<h4 id="sec-30-212-2">Documentation </h4>
<div class="outline-text-4" id="text-30-212-2">

<p>Subdivide rectangle R into four rectangles joined at the
center point of the original R, and return the list of four
rectangles, or NIL if they would be smaller than one pixel.
</p></div>
</div>

</div>

<div id="outline-container-30-213" class="outline-3">
<h3 id="sec-30-213">TRACE-COLUMN (function) </h3>
<div class="outline-text-3" id="text-30-213">


</div>

<div id="outline-container-30-213-1" class="outline-4">
<h4 id="sec-30-213-1">Arguments </h4>
<div class="outline-text-4" id="text-30-213-1">

<p>(TRACE-FUNCTION COLUMN Y0 Y1)
</p></div>
</div>

</div>

<div id="outline-container-30-214" class="outline-3">
<h3 id="sec-30-214">TRACE-LINE (function) </h3>
<div class="outline-text-3" id="text-30-214">


</div>

<div id="outline-container-30-214-1" class="outline-4">
<h4 id="sec-30-214-1">Arguments </h4>
<div class="outline-text-4" id="text-30-214-1">

<p>(TRACE-FUNCTION X0 Y0 X1 Y1)
</p></div>

</div>

<div id="outline-container-30-214-2" class="outline-4">
<h4 id="sec-30-214-2">Documentation </h4>
<div class="outline-text-4" id="text-30-214-2">

<p>Trace a line between X0,Y0 and X1,Y1.
calling TRACE-FUNCTION at each point of the line.
</p></div>
</div>

</div>

<div id="outline-container-30-215" class="outline-3">
<h3 id="sec-30-215">TRACE-OCTAGON (function) </h3>
<div class="outline-text-3" id="text-30-215">


</div>

<div id="outline-container-30-215-1" class="outline-4">
<h4 id="sec-30-215-1">Arguments </h4>
<div class="outline-text-4" id="text-30-215-1">

<p>(TRACE-FUNCTION CENTER-ROW CENTER-COLUMN RADIUS &amp;OPTIONAL THICKEN)
</p></div>

</div>
