notebook/xe2-reference.org
*** Documentation
Call TRACE-FUNCTION for each point on the octagon of radius RADIUS
centered at row ROW, column COLUMN. When THICKEN is non-nil, thicken
the diagonals of the rectangle in order to facilitate raycasting.
It's an ugly hack, but it helps reduce artifacts.
** TRACE-RECTANGLE (function)
*** Arguments
(TRACE-FUNCTION ROW COLUMN HEIGHT WIDTH &OPTIONAL FILL)
*** Documentation
Call TRACE-FUNCTION for each point on the rectangle of HEIGHT and
WIDTH with top left corner at ROW COLUMN. When FILL is non-nil, fill
the rectangle.
** TRACE-ROW (function)
*** Arguments
(TRACE-FUNCTION ROW X0 X1)
** TRANSFORM-DECLARATION-FIELD-DESCRIPTOR (function)
*** Arguments
(D)
*** Documentation
Convert the declaration-field-descriptor D into a canonical field
descriptor.

The descriptor D must be either a symbol, in which case a field is
defined with no options, or a list of the form:

 (:FIELD-NAME . OPTIONS)

Where OPTIONS is a property list of field options.

The returned entry will be of the form:

 (:FIELD-NAME OPTIONS) 

and will be suitable for use with the functions that operate on field
descriptors, and for inclusion in the association list
<field-descriptors>.

See also `define-prototype'.
** TRANSFORM-FIELD-REFERENCE (function)
*** Arguments
(REF)
*** Documentation
Change the symbol REF from <foo> to (field-value :foo self).
** TRANSFORM-METHOD-BODY (function)
*** Arguments
(BODY)
*** Documentation
Process the forms in BODY to transform field references.
** TRANSFORM-TREE (function)
*** Arguments
(TESTER TRANSFORMER TREE)
** UNINSTALL-WIDGET (function)
*** Arguments
(WIDGET)
** UNQUEUE (function)
*** Arguments
(Q)
** UNQUEUE-MESSAGE (function)
*** Documentation
Remove the next message from the queue. The returned message is a
list of the form (METHOD-KEY RECEIVER ARGS).
** WHILE (macro)
*** Arguments
(&REST ARGS)
** WITH-FIELD-VALUES (macro)
*** Arguments
(&REST ARGS)
*** Documentation
Bind the names in FIELDS to the values of the corresponding fields
in EXPRESSION, in evaluating BODY. Each slot is accessed only once,
upon binding.
** WITH-FIELDS (macro)
*** Arguments
(&REST ARGS)
*** Documentation
Bind FIELDS from the object EXPRESSION to names in the local
environment in evaluating BODY. Local symbol macros are used, meaning
that each reference (get or set) is a slot access on the object.
** WITH-MESSAGE-QUEUE (macro)
*** Arguments
(&REST ARGS)
*** Documentation
Run the BODY forms, capturing any queued output messages to the
message queue resulting from the evaluation of EXPR.
** WITH-MESSAGE-SENDER (variable)
** WORLD (function)
*** Documentation
Return the current world.
** WRITE-PAK (function)
*** Arguments
(FILENAME RESOURCES)
*** Documentation
Write the RESOURCES to the PAK file FILENAME.
** WRITE-SEXP-TO-FILE (function)
*** Arguments
(FILENAME SEXP)
** ZOOM-IMAGE (function)
*** Arguments
(IMAGE &OPTIONAL (FACTOR *ZOOM-FACTOR*))
*** Documentation
Return a zoomed version of IMAGE, zoomed by FACTOR.
Allocates a new image.
