notebook/xe2-reference.html

<div id="outline-container-30-215-2" class="outline-4">
<h4 id="sec-30-215-2">Documentation </h4>
<div class="outline-text-4" id="text-30-215-2">

<p>Call TRACE-FUNCTION for each point on the octagon of radius RADIUS
centered at row ROW, column COLUMN. When THICKEN is non-nil, thicken
the diagonals of the rectangle in order to facilitate raycasting.
It's an ugly hack, but it helps reduce artifacts.
</p></div>
</div>

</div>

<div id="outline-container-30-216" class="outline-3">
<h3 id="sec-30-216">TRACE-RECTANGLE (function) </h3>
<div class="outline-text-3" id="text-30-216">


</div>

<div id="outline-container-30-216-1" class="outline-4">
<h4 id="sec-30-216-1">Arguments </h4>
<div class="outline-text-4" id="text-30-216-1">

<p>(TRACE-FUNCTION ROW COLUMN HEIGHT WIDTH &amp;OPTIONAL FILL)
</p></div>

</div>

<div id="outline-container-30-216-2" class="outline-4">
<h4 id="sec-30-216-2">Documentation </h4>
<div class="outline-text-4" id="text-30-216-2">

<p>Call TRACE-FUNCTION for each point on the rectangle of HEIGHT and
WIDTH with top left corner at ROW COLUMN. When FILL is non-nil, fill
the rectangle.
</p></div>
</div>

</div>

<div id="outline-container-30-217" class="outline-3">
<h3 id="sec-30-217">TRACE-ROW (function) </h3>
<div class="outline-text-3" id="text-30-217">


</div>

<div id="outline-container-30-217-1" class="outline-4">
<h4 id="sec-30-217-1">Arguments </h4>
<div class="outline-text-4" id="text-30-217-1">

<p>(TRACE-FUNCTION ROW X0 X1)
</p></div>
</div>

</div>

<div id="outline-container-30-218" class="outline-3">
<h3 id="sec-30-218">TRANSFORM-DECLARATION-FIELD-DESCRIPTOR (function) </h3>
<div class="outline-text-3" id="text-30-218">


</div>

<div id="outline-container-30-218-1" class="outline-4">
<h4 id="sec-30-218-1">Arguments </h4>
<div class="outline-text-4" id="text-30-218-1">

<p>(D)
</p></div>

</div>

<div id="outline-container-30-218-2" class="outline-4">
<h4 id="sec-30-218-2">Documentation </h4>
<div class="outline-text-4" id="text-30-218-2">

<p>Convert the declaration-field-descriptor D into a canonical field
descriptor.
</p>
<p>
The descriptor D must be either a symbol, in which case a field is
defined with no options, or a list of the form:
</p>
<p>
 (:FIELD-NAME . OPTIONS)
</p>
<p>
Where OPTIONS is a property list of field options.
</p>
<p>
The returned entry will be of the form:
</p>
<p>
 (:FIELD-NAME OPTIONS) 
</p>
<p>
and will be suitable for use with the functions that operate on field
descriptors, and for inclusion in the association list
&lt;field-descriptors&gt;.
</p>
<p>
See also `define-prototype'.
</p></div>
</div>

</div>

<div id="outline-container-30-219" class="outline-3">
<h3 id="sec-30-219">TRANSFORM-FIELD-REFERENCE (function) </h3>
<div class="outline-text-3" id="text-30-219">


</div>

<div id="outline-container-30-219-1" class="outline-4">
<h4 id="sec-30-219-1">Arguments </h4>
<div class="outline-text-4" id="text-30-219-1">

<p>(REF)
</p></div>

</div>

<div id="outline-container-30-219-2" class="outline-4">
<h4 id="sec-30-219-2">Documentation </h4>
<div class="outline-text-4" id="text-30-219-2">

<p>Change the symbol REF from &lt;foo&gt; to (field-value :foo self).
</p></div>
</div>

</div>

<div id="outline-container-30-220" class="outline-3">
<h3 id="sec-30-220">TRANSFORM-METHOD-BODY (function) </h3>
<div class="outline-text-3" id="text-30-220">


</div>

<div id="outline-container-30-220-1" class="outline-4">
<h4 id="sec-30-220-1">Arguments </h4>
<div class="outline-text-4" id="text-30-220-1">

<p>(BODY)
</p></div>

</div>

<div id="outline-container-30-220-2" class="outline-4">
<h4 id="sec-30-220-2">Documentation </h4>
<div class="outline-text-4" id="text-30-220-2">

<p>Process the forms in BODY to transform field references.
</p></div>
</div>

</div>

<div id="outline-container-30-221" class="outline-3">
<h3 id="sec-30-221">TRANSFORM-TREE (function) </h3>
<div class="outline-text-3" id="text-30-221">


</div>

<div id="outline-container-30-221-1" class="outline-4">
<h4 id="sec-30-221-1">Arguments </h4>
<div class="outline-text-4" id="text-30-221-1">

<p>(TESTER TRANSFORMER TREE)
</p></div>
</div>

</div>

<div id="outline-container-30-222" class="outline-3">
<h3 id="sec-30-222">UNINSTALL-WIDGET (function) </h3>
<div class="outline-text-3" id="text-30-222">


</div>

<div id="outline-container-30-222-1" class="outline-4">
<h4 id="sec-30-222-1">Arguments </h4>
<div class="outline-text-4" id="text-30-222-1">

<p>(WIDGET)
</p></div>
</div>

</div>

<div id="outline-container-30-223" class="outline-3">
<h3 id="sec-30-223">UNQUEUE (function) </h3>
<div class="outline-text-3" id="text-30-223">


</div>

<div id="outline-container-30-223-1" class="outline-4">
<h4 id="sec-30-223-1">Arguments </h4>
<div class="outline-text-4" id="text-30-223-1">

<p>(Q)
</p></div>
</div>

</div>

<div id="outline-container-30-224" class="outline-3">
<h3 id="sec-30-224">UNQUEUE-MESSAGE (function) </h3>
<div class="outline-text-3" id="text-30-224">


</div>

<div id="outline-container-30-224-1" class="outline-4">
<h4 id="sec-30-224-1">Documentation </h4>
<div class="outline-text-4" id="text-30-224-1">

<p>Remove the next message from the queue. The returned message is a
list of the form (METHOD-KEY RECEIVER ARGS).
</p></div>
</div>

</div>

<div id="outline-container-30-225" class="outline-3">
<h3 id="sec-30-225">WHILE (macro) </h3>
<div class="outline-text-3" id="text-30-225">


</div>

<div id="outline-container-30-225-1" class="outline-4">
<h4 id="sec-30-225-1">Arguments </h4>
<div class="outline-text-4" id="text-30-225-1">

<p>(&amp;REST ARGS)
</p></div>
</div>

</div>

<div id="outline-container-30-226" class="outline-3">
<h3 id="sec-30-226">WITH-FIELD-VALUES (macro) </h3>
<div class="outline-text-3" id="text-30-226">


</div>

<div id="outline-container-30-226-1" class="outline-4">
<h4 id="sec-30-226-1">Arguments </h4>
<div class="outline-text-4" id="text-30-226-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-226-2" class="outline-4">
<h4 id="sec-30-226-2">Documentation </h4>
<div class="outline-text-4" id="text-30-226-2">

<p>Bind the names in FIELDS to the values of the corresponding fields
in EXPRESSION, in evaluating BODY. Each slot is accessed only once,
upon binding.
</p></div>
</div>

</div>

<div id="outline-container-30-227" class="outline-3">
<h3 id="sec-30-227">WITH-FIELDS (macro) </h3>
<div class="outline-text-3" id="text-30-227">


</div>

<div id="outline-container-30-227-1" class="outline-4">
<h4 id="sec-30-227-1">Arguments </h4>
<div class="outline-text-4" id="text-30-227-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-227-2" class="outline-4">
<h4 id="sec-30-227-2">Documentation </h4>
<div class="outline-text-4" id="text-30-227-2">

<p>Bind FIELDS from the object EXPRESSION to names in the local
environment in evaluating BODY. Local symbol macros are used, meaning
that each reference (get or set) is a slot access on the object.
</p></div>
</div>

</div>

<div id="outline-container-30-228" class="outline-3">
<h3 id="sec-30-228">WITH-MESSAGE-QUEUE (macro) </h3>
<div class="outline-text-3" id="text-30-228">


</div>

<div id="outline-container-30-228-1" class="outline-4">
<h4 id="sec-30-228-1">Arguments </h4>
<div class="outline-text-4" id="text-30-228-1">

<p>(&amp;REST ARGS)
</p></div>

</div>

<div id="outline-container-30-228-2" class="outline-4">
<h4 id="sec-30-228-2">Documentation </h4>
<div class="outline-text-4" id="text-30-228-2">

<p>Run the BODY forms, capturing any queued output messages to the
message queue resulting from the evaluation of EXPR.
</p></div>
</div>

</div>

<div id="outline-container-30-229" class="outline-3">
<h3 id="sec-30-229">WITH-MESSAGE-SENDER (variable) </h3>
<div class="outline-text-3" id="text-30-229">

</div>

</div>

<div id="outline-container-30-230" class="outline-3">
<h3 id="sec-30-230">WORLD (function) </h3>
<div class="outline-text-3" id="text-30-230">


</div>

<div id="outline-container-30-230-1" class="outline-4">
<h4 id="sec-30-230-1">Documentation </h4>
<div class="outline-text-4" id="text-30-230-1">

<p>Return the current world.
</p></div>
</div>

</div>

<div id="outline-container-30-231" class="outline-3">
<h3 id="sec-30-231">WRITE-PAK (function) </h3>
<div class="outline-text-3" id="text-30-231">


</div>

<div id="outline-container-30-231-1" class="outline-4">
<h4 id="sec-30-231-1">Arguments </h4>
<div class="outline-text-4" id="text-30-231-1">

<p>(FILENAME RESOURCES)
</p></div>

</div>

<div id="outline-container-30-231-2" class="outline-4">
<h4 id="sec-30-231-2">Documentation </h4>
<div class="outline-text-4" id="text-30-231-2">

<p>Write the RESOURCES to the PAK file FILENAME.
</p></div>
</div>

</div>

<div id="outline-container-30-232" class="outline-3">
<h3 id="sec-30-232">WRITE-SEXP-TO-FILE (function) </h3>
<div class="outline-text-3" id="text-30-232">


</div>

<div id="outline-container-30-232-1" class="outline-4">
<h4 id="sec-30-232-1">Arguments </h4>
<div class="outline-text-4" id="text-30-232-1">

<p>(FILENAME SEXP)
</p></div>
</div>

</div>

<div id="outline-container-30-233" class="outline-3">
<h3 id="sec-30-233">ZOOM-IMAGE (function) </h3>
<div class="outline-text-3" id="text-30-233">


</div>

<div id="outline-container-30-233-1" class="outline-4">
<h4 id="sec-30-233-1">Arguments </h4>
<div class="outline-text-4" id="text-30-233-1">

<p>(IMAGE &amp;OPTIONAL (FACTOR *ZOOM-FACTOR*))
</p></div>

</div>

<div id="outline-container-30-233-2" class="outline-4">
<h4 id="sec-30-233-2">Documentation </h4>
<div class="outline-text-4" id="text-30-233-2">

<p>Return a zoomed version of IMAGE, zoomed by FACTOR.
Allocates a new image.
</p></div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-08-02 18:58:30 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
